<abi-corpus version='2.1' architecture='elf-arm' soname='libnativehelper.so'>
  <elf-needed>
    <dependency name='liblog.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AFileDescriptor_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AFileDescriptor_getFd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AFileDescriptor_setFd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='JNI_CreateJavaVM' type='func-type' binding='global-binding' visibility='protected-visibility' is-defined='yes'/>
    <elf-symbol name='JNI_GetCreatedJavaVMs' type='func-type' binding='global-binding' visibility='protected-visibility' is-defined='yes'/>
    <elf-symbol name='JNI_GetDefaultJavaVMInitArgs' type='func-type' binding='global-binding' visibility='protected-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C99' path='various'>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <function-type size-in-bits='32' id='0149d965'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b89f496'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='106bd8ac' size-in-bits='32' id='01eb6566'/>
    <pointer-type-def type-id='b66924e8' size-in-bits='32' id='0290ef52'/>
    <function-type size-in-bits='32' id='02a81098'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='02c4e402'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='c2fb5303'/>
    </function-type>
    <pointer-type-def type-id='dd7295b3' size-in-bits='32' id='0323d66f'/>
    <typedef-decl name='__int16_t' type-id='a2185560' id='03896e23'/>
    <pointer-type-def type-id='3d8c391f' size-in-bits='32' id='03bcacf3'/>
    <pointer-type-def type-id='d6dcfc5b' size-in-bits='32' id='03c9e007'/>
    <function-type size-in-bits='32' id='03e3ce24'>
      <parameter type-id='fae49a1f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='0411e2cc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='a6979e77'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='14c3a3b0' size-in-bits='32' id='04aa9df2'/>
    <pointer-type-def type-id='9539c406' size-in-bits='32' id='04b3e5a0'/>
    <function-type size-in-bits='32' id='055a6f41'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='80f4b756'/>
    </function-type>
    <pointer-type-def type-id='c12bf182' size-in-bits='32' id='0571aa74'/>
    <function-type size-in-bits='32' id='06074860'>
      <parameter type-id='fae49a1f'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='eb796c24' size-in-bits='32' id='060c7d5e'/>
    <pointer-type-def type-id='5fa8a65a' size-in-bits='32' id='067e0250'/>
    <pointer-type-def type-id='16cc647b' size-in-bits='32' id='06fbd437'/>
    <pointer-type-def type-id='8dfe2e06' size-in-bits='32' id='071e4e5d'/>
    <pointer-type-def type-id='db9b93fa' size-in-bits='32' id='0736b484'/>
    <pointer-type-def type-id='6d519b6e' size-in-bits='32' id='075b7a00'/>
    <function-type size-in-bits='32' id='07f91629'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='055a6f41' size-in-bits='32' id='08565ebd'/>
    <typedef-decl name='jcharArray' type-id='65b69bb3' id='088b642f'/>
    <pointer-type-def type-id='c9f7d0f5' size-in-bits='32' id='090a6901'/>
    <pointer-type-def type-id='7a6fe7df' size-in-bits='32' id='09176273'/>
    <pointer-type-def type-id='0ed3c13b' size-in-bits='32' id='097c7407'/>
    <typedef-decl name='jvalue' type-id='2eab072b' id='0994533b'/>
    <pointer-type-def type-id='784a10a1' size-in-bits='32' id='09b49e9d'/>
    <pointer-type-def type-id='dcbb605e' size-in-bits='32' id='0a7e4740'/>
    <pointer-type-def type-id='6ab04463' size-in-bits='32' id='0ae13aef'/>
    <qualified-type-def type-id='6be48efb' const='yes' id='0b0cda36'/>
    <typedef-decl name='jint' type-id='3ff5601b' id='0b9c02cb'/>
    <pointer-type-def type-id='30f9fd2c' size-in-bits='32' id='0ba6a8b6'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' id='0c9942d2'/>
    <pointer-type-def type-id='d413ac7e' size-in-bits='32' id='0cb5bb00'/>
    <function-type size-in-bits='32' id='0ccd5902'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='dc1ed48c' size-in-bits='32' id='0d5970ee'/>
    <pointer-type-def type-id='90c673e3' size-in-bits='32' id='0de4af77'/>
    <function-type size-in-bits='32' id='0df96076'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='d4a328b7'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='2f0b7817' size-in-bits='32' id='0e5e0cdb'/>
    <function-type size-in-bits='32' id='0ed3c13b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='0fce6948'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='470aec15' size-in-bits='32' id='10182119'/>
    <function-type size-in-bits='32' id='106bd8ac'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='071e4e5d'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='126e53d0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='bed9a8c1' size-in-bits='32' id='13196dfd'/>
    <function-type size-in-bits='32' id='148c6738'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <function-type size-in-bits='32' id='14c3a3b0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='1f3810cb'/>
    </function-type>
    <pointer-type-def type-id='38d85c8f' size-in-bits='32' id='151a1d63'/>
    <typedef-decl name='jshortArray' type-id='65b69bb3' id='152bf3a9'/>
    <pointer-type-def type-id='bf1e0391' size-in-bits='32' id='15887ec5'/>
    <pointer-type-def type-id='aca2cd7e' size-in-bits='32' id='162473c8'/>
    <function-type size-in-bits='32' id='16cc647b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='e0efb9de' size-in-bits='32' id='17d955f8'/>
    <pointer-type-def type-id='c3a70532' size-in-bits='32' id='17ed04c8'/>
    <function-type size-in-bits='32' id='181a3db0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='973e3c3f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jintArray' type-id='65b69bb3' id='181f4ac0'/>
    <pointer-type-def type-id='95d32fc8' size-in-bits='32' id='187251e2'/>
    <function-type size-in-bits='32' id='18caaa83'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='ca62bfca' size-in-bits='32' id='1930d02c'/>
    <pointer-type-def type-id='181a3db0' size-in-bits='32' id='195d3e42'/>
    <typedef-decl name='jfloat' type-id='a6c45d85' id='1a7fe6b0'/>
    <function-type size-in-bits='32' id='1a9d598b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='1ab7137e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='38565182'/>
    </function-type>
    <function-type size-in-bits='32' id='1cd86ccf'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='fe213acd' size-in-bits='32' id='1d2f8a91'/>
    <function-type size-in-bits='32' id='1d639c93'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='8ec52105'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='d1ff2147' size-in-bits='32' id='1db4c5bb'/>
    <function-type size-in-bits='32' id='1dba3069'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='1ded82e5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='adf18958'/>
      <return type-id='48b5725f'/>
    </function-type>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <typedef-decl name='jfieldID' type-id='ee3187c5' id='1f3810cb'/>
    <pointer-type-def type-id='5fea4ff8' size-in-bits='32' id='1f57b15a'/>
    <function-type size-in-bits='32' id='1f8f9f18'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='56c055db' size-in-bits='32' id='1fda464f'/>
    <pointer-type-def type-id='31d87a2b' size-in-bits='32' id='2041a8d7'/>
    <function-type size-in-bits='32' id='21042e4a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='84110544' size-in-bits='32' id='210c37a6'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <function-type size-in-bits='32' id='21fee85f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='223133a2'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='a6979e77'/>
    </function-type>
    <pointer-type-def type-id='57aaeac5' size-in-bits='32' id='239d7ad9'/>
    <typedef-decl name='int16_t' type-id='03896e23' id='23bd8cb5'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <pointer-type-def type-id='5e933196' size-in-bits='32' id='255ff5d8'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <function-type size-in-bits='32' id='26ee7735'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='640aedbe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='27a87596'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <function-type size-in-bits='32' id='2987b0c7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='fae49a1f' size-in-bits='32' id='2adec16f'/>
    <typedef-decl name='va_list' type-id='7f896fb4' id='2aee9912'/>
    <function-type size-in-bits='32' id='2b209300'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <typedef-decl name='jsize' type-id='0b9c02cb' id='2c2f1adb'/>
    <pointer-type-def type-id='ef48369b' size-in-bits='32' id='2c684c9f'/>
    <function-type size-in-bits='32' id='2c8ecc6a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='c2fb5303'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jobjectArray' type-id='65b69bb3' id='2d5e6f72'/>
    <pointer-type-def type-id='d776b039' size-in-bits='32' id='2dab161d'/>
    <pointer-type-def type-id='b7e7edbe' size-in-bits='32' id='2dcc8b98'/>
    <pointer-type-def type-id='a1159711' size-in-bits='32' id='2deb20e5'/>
    <function-type size-in-bits='32' id='2e19a82f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2d5e6f72'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2e613a3e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='96f3d089'/>
    </function-type>
    <class-decl name='_jfieldID' is-struct='yes' visibility='default' is-declaration-only='yes' id='2e67d715'/>
    <function-type size-in-bits='32' id='2e6e32b5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='c5b6437f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <union-decl name='jvalue' size-in-bits='64' visibility='default' id='2eab072b'>
      <data-member access='public'>
        <var-decl name='z' type-id='cc6e09ca' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='b' type-id='adf18958' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='c' type-id='8dfe2e06' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s' type-id='9a10f134' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i' type-id='0b9c02cb' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='j' type-id='c8745fdc' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='f' type-id='1a7fe6b0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='d' type-id='973e3c3f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='l' type-id='96f3d089' visibility='default'/>
      </data-member>
    </union-decl>
    <function-type size-in-bits='32' id='2f02ea7a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='2f03f5b7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='a8d5bec6'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='2f0b7817'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='59330a47' size-in-bits='32' id='30411993'/>
    <function-type size-in-bits='32' id='307d2c7d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='1ab7137e' size-in-bits='32' id='30974818'/>
    <pointer-type-def type-id='83574fe4' size-in-bits='32' id='30b9a8ce'/>
    <function-type size-in-bits='32' id='30f9fd2c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='c2fb5303'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='3197286d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='31d87a2b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='181f4ac0'/>
    </function-type>
    <pointer-type-def type-id='dc0b1ac7' size-in-bits='32' id='31ebf17b'/>
    <pointer-type-def type-id='82d29439' size-in-bits='32' id='326df5b5'/>
    <pointer-type-def type-id='becc7143' size-in-bits='32' id='3271bf2f'/>
    <pointer-type-def type-id='42337f0c' size-in-bits='32' id='3318dad6'/>
    <pointer-type-def type-id='2f03f5b7' size-in-bits='32' id='3358ddb3'/>
    <pointer-type-def type-id='223133a2' size-in-bits='32' id='33683384'/>
    <pointer-type-def type-id='41b981f8' size-in-bits='32' id='337e1672'/>
    <pointer-type-def type-id='554d87f1' size-in-bits='32' id='339f696d'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <pointer-type-def type-id='18caaa83' size-in-bits='32' id='3459b4cf'/>
    <pointer-type-def type-id='2e6e32b5' size-in-bits='32' id='348c02e9'/>
    <pointer-type-def type-id='7f8ca3fe' size-in-bits='32' id='34c67260'/>
    <pointer-type-def type-id='307d2c7d' size-in-bits='32' id='362e2831'/>
    <pointer-type-def type-id='b142692f' size-in-bits='32' id='377b5e63'/>
    <typedef-decl name='jmethodID' type-id='b09bab5e' id='38565182'/>
    <function-type size-in-bits='32' id='386e18fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='a6979e77'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='38d85c8f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='38edd3d4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='96f3d089'/>
      <return type-id='2d5e6f72'/>
    </function-type>
    <pointer-type-def type-id='6e835a19' size-in-bits='32' id='3a8fe115'/>
    <pointer-type-def type-id='9bf2d596' size-in-bits='32' id='3b4676f4'/>
    <function-type size-in-bits='32' id='3b720171'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='96f3d089'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='2987b0c7' size-in-bits='32' id='3bd86cfb'/>
    <pointer-type-def type-id='897a51fb' size-in-bits='32' id='3c8ecc03'/>
    <function-type size-in-bits='32' id='3d2d0c38'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='1a7fe6b0'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='3d8c391f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='6c9a8402'/>
    </function-type>
    <function-type size-in-bits='32' id='3eafa32f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <qualified-type-def type-id='adf18958' const='yes' id='3ebf19c8'/>
    <function-type size-in-bits='32' id='3fa8e199'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <pointer-type-def type-id='7de99def' size-in-bits='32' id='40f183ab'/>
    <pointer-type-def type-id='6da5b67e' size-in-bits='32' id='412650f8'/>
    <pointer-type-def type-id='7be75d9e' size-in-bits='32' id='4127a730'/>
    <function-type size-in-bits='32' id='41301cf9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='b9c972b8' size-in-bits='32' id='413559e2'/>
    <function-type size-in-bits='32' id='413b072a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='4142d35b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='41b981f8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='0fce6948' size-in-bits='32' id='41d61b6a'/>
    <function-type size-in-bits='32' id='42337f0c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='e24417ff' size-in-bits='32' id='4278623b'/>
    <function-type size-in-bits='32' id='44a04411'>
      <parameter type-id='c3a70532'/>
      <parameter type-id='2adec16f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='d664a6f7' size-in-bits='32' id='44bea17b'/>
    <pointer-type-def type-id='2b209300' size-in-bits='32' id='461c5f2a'/>
    <function-type size-in-bits='32' id='461d0e9f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='467aaa2c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='470aec15'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='884af3d2'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='a017e9d1' size-in-bits='32' id='47653e05'/>
    <pointer-type-def type-id='49617147' size-in-bits='32' id='476f48bb'/>
    <function-type size-in-bits='32' id='47891898'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='148c6738' size-in-bits='32' id='478facc2'/>
    <pointer-type-def type-id='a4a61472' size-in-bits='32' id='47bc557c'/>
    <function-type size-in-bits='32' id='4890b95b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <type-decl name='void' id='48b5725f'/>
    <function-type size-in-bits='32' id='49617147'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='0149d965' size-in-bits='32' id='4a0b9bf1'/>
    <function-type size-in-bits='32' id='4a42a622'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='4aec61f6'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='06074860' size-in-bits='32' id='4b15419a'/>
    <function-type size-in-bits='32' id='4b5c8855'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='5b7c7bab'/>
    </function-type>
    <function-type size-in-bits='32' id='4bcddb36'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='4bd440f5'>
      <parameter type-id='fae49a1f'/>
      <return type-id='5b89f496'/>
    </function-type>
    <function-type size-in-bits='32' id='4dd30b7b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='4e053e6d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='1a7fe6b0'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='4e7eaf04'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='1dba3069' size-in-bits='32' id='4ed90115'/>
    <pointer-type-def type-id='6878e9a8' size-in-bits='32' id='4f68d4b2'/>
    <pointer-type-def type-id='ae2834f4' size-in-bits='32' id='4f7677f6'/>
    <enum-decl name='jobjectRefType' id='4f771c8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='JNIInvalidRefType' value='0'/>
      <enumerator name='JNILocalRefType' value='1'/>
      <enumerator name='JNIGlobalRefType' value='2'/>
      <enumerator name='JNIWeakGlobalRefType' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='e8f54abb' size-in-bits='32' id='500eebf7'/>
    <function-type size-in-bits='32' id='50ce2e7b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='17ed04c8'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='533df676'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='da4ac88c' size-in-bits='32' id='5353c67e'/>
    <function-type size-in-bits='32' id='5368e5fc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='7f83e8c4'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='5432adc5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6c9a8402'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='554d87f1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='558a0aa4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='152bf3a9'/>
    </function-type>
    <function-type size-in-bits='32' id='56c055db'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='57859aeb'>
      <parameter type-id='c3a70532'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='59ed1e59' size-in-bits='32' id='5796afad'/>
    <function-type size-in-bits='32' id='57aaeac5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='67748225' size-in-bits='32' id='582ba311'/>
    <pointer-type-def type-id='f341e414' size-in-bits='32' id='58398eee'/>
    <function-type size-in-bits='32' id='588dec50'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='59330a47'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='973e3c3f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='59b5ee8a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='59da7e0d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='0411e2cc' size-in-bits='32' id='59e7b6c6'/>
    <function-type size-in-bits='32' id='59ed1e59'>
      <parameter type-id='fae49a1f'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='50ce2e7b' size-in-bits='32' id='5a4c25bf'/>
    <function-type size-in-bits='32' id='5ad5f77b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <typedef-decl name='jstring' type-id='96f3d089' id='5b7c7bab'/>
    <typedef-decl name='jthrowable' type-id='96f3d089' id='5b89f496'/>
    <function-type size-in-bits='32' id='5d4b6f06'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <return type-id='2c2f1adb'/>
    </function-type>
    <function-type size-in-bits='32' id='5d529e9d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='fea2690f' size-in-bits='32' id='5d99509b'/>
    <pointer-type-def type-id='5ad5f77b' size-in-bits='32' id='5da2c37f'/>
    <pointer-type-def type-id='e3e7515c' size-in-bits='32' id='5db5877e'/>
    <function-type size-in-bits='32' id='5e933196'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='b6e5053d' size-in-bits='32' id='5ee69201'/>
    <class-decl name='__va_list' size-in-bits='32' is-struct='yes' visibility='default' id='5f919c1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__ap' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='4890b95b' size-in-bits='32' id='5f929ab7'/>
    <qualified-type-def type-id='cc6e09ca' const='yes' id='5fa8a65a'/>
    <function-type size-in-bits='32' id='5fea4ff8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='aa210e95'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='d47c1022' size-in-bits='32' id='601f438c'/>
    <pointer-type-def type-id='8c344f84' size-in-bits='32' id='60306f66'/>
    <function-type size-in-bits='32' id='60e6a162'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='7f83e8c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='efa46d99' size-in-bits='32' id='61d681d5'/>
    <typedef-decl name='jbyteArray' type-id='65b69bb3' id='61dc2b35'/>
    <function-type size-in-bits='32' id='625a21da'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='973e3c3f' size-in-bits='32' id='6292c81e'/>
    <pointer-type-def type-id='c5c8084e' size-in-bits='32' id='629961b8'/>
    <pointer-type-def type-id='86910635' size-in-bits='32' id='62d9dee9'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <pointer-type-def type-id='07f91629' size-in-bits='32' id='63f7d65d'/>
    <pointer-type-def type-id='af8c6a20' size-in-bits='32' id='640aedbe'/>
    <pointer-type-def type-id='4a42a622' size-in-bits='32' id='64ca4b84'/>
    <pointer-type-def type-id='2c2f1adb' size-in-bits='32' id='653969ba'/>
    <typedef-decl name='jarray' type-id='96f3d089' id='65b69bb3'/>
    <pointer-type-def type-id='0df96076' size-in-bits='32' id='666fc788'/>
    <function-type size-in-bits='32' id='66c316f9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='4bcddb36' size-in-bits='32' id='66ebe6b0'/>
    <pointer-type-def type-id='588dec50' size-in-bits='32' id='67514b72'/>
    <function-type size-in-bits='32' id='67748225'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='47891898' size-in-bits='32' id='67a46ff2'/>
    <function-type size-in-bits='32' id='6878e9a8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='7f83e8c4'/>
    </function-type>
    <pointer-type-def type-id='4b5c8855' size-in-bits='32' id='691ba251'/>
    <pointer-type-def type-id='b6d76995' size-in-bits='32' id='692552f9'/>
    <function-type size-in-bits='32' id='6935722a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='cd5e6e48' size-in-bits='32' id='69b7386a'/>
    <pointer-type-def type-id='c17f92e4' size-in-bits='32' id='69d41a4a'/>
    <function-type size-in-bits='32' id='6ab04463'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2d5e6f72'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='6b5c9008'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='d4a328b7'/>
    </function-type>
    <function-type size-in-bits='32' id='6b6501bd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='6bb2df61'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='067e0250'/>
      <return type-id='48b5725f'/>
    </function-type>
    <class-decl name='JNIInvokeInterface' size-in-bits='256' is-struct='yes' visibility='default' id='6be48efb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved0' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='DestroyJavaVM' type-id='03c9e007' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='AttachCurrentThread' type-id='badd5935' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='DetachCurrentThread' type-id='03c9e007' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='GetEnv' type-id='85752237' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='AttachCurrentThreadAsDaemon' type-id='badd5935' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='81719d6d' size-in-bits='32' id='6c160b51'/>
    <function-type size-in-bits='32' id='6c431008'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='66c316f9' size-in-bits='32' id='6c56e815'/>
    <typedef-decl name='jweak' type-id='96f3d089' id='6c9a8402'/>
    <function-type size-in-bits='32' id='6d519b6e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='aa210e95'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6da5b67e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='6e3cf71b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='8dfe2e06'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6e835a19'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jfloatArray' type-id='65b69bb3' id='6e9854cd'/>
    <function-type size-in-bits='32' id='6f160e3a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='6292c81e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='7f57b6c0' size-in-bits='32' id='6fc0eca2'/>
    <function-type size-in-bits='32' id='70b02f6f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jclass' type-id='96f3d089' id='70de5c42'/>
    <pointer-type-def type-id='6c431008' size-in-bits='32' id='7139225a'/>
    <function-type size-in-bits='32' id='717ad472'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='088b642f'/>
    </function-type>
    <pointer-type-def type-id='625a21da' size-in-bits='32' id='72f7c194'/>
    <pointer-type-def type-id='2c8ecc6a' size-in-bits='32' id='747a49e4'/>
    <pointer-type-def type-id='0ccd5902' size-in-bits='32' id='74823d0c'/>
    <function-type size-in-bits='32' id='757515fe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='1d639c93' size-in-bits='32' id='764ac7bf'/>
    <pointer-type-def type-id='21fee85f' size-in-bits='32' id='771014ab'/>
    <pointer-type-def type-id='3b720171' size-in-bits='32' id='782c53f5'/>
    <function-type size-in-bits='32' id='784a10a1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='a981db8b' size-in-bits='32' id='786cbe73'/>
    <function-type size-in-bits='32' id='792136c4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='6292c81e'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='7a6fe7df'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='38565182'/>
    </function-type>
    <function-type size-in-bits='32' id='7ba71958'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <function-type size-in-bits='32' id='7be75d9e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <qualified-type-def type-id='c8745fdc' const='yes' id='7c1d680c'/>
    <function-type size-in-bits='32' id='7de99def'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='3b4676f4'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='5b7c7bab'/>
    </function-type>
    <pointer-type-def type-id='60e6a162' size-in-bits='32' id='7f0ac28c'/>
    <function-type size-in-bits='32' id='7f57b6c0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='0b9c02cb' size-in-bits='32' id='7f83e8c4'/>
    <typedef-decl name='__builtin_va_list' type-id='5f919c1f' id='7f896fb4'/>
    <function-type size-in-bits='32' id='7f8ca3fe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='4bd440f5' size-in-bits='32' id='7fdf58e1'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <pointer-type-def type-id='0b0cda36' size-in-bits='32' id='813b5a14'/>
    <function-type size-in-bits='32' id='81719d6d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='82d29439'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='83574fe4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='837777dd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='84110544'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='d8263a65'/>
    </function-type>
    <function-type size-in-bits='32' id='8570b09c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='57859aeb' size-in-bits='32' id='85752237'/>
    <function-type size-in-bits='32' id='85d5402e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='86910635'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='69d41a4a'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='02a81098' size-in-bits='32' id='87e0b5ea'/>
    <function-type size-in-bits='32' id='8833c461'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='7c1d680c' size-in-bits='32' id='884af3d2'/>
    <pointer-type-def type-id='b7d01ad5' size-in-bits='32' id='88d99751'/>
    <function-type size-in-bits='32' id='88f16d4f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <qualified-type-def type-id='0b9c02cb' const='yes' id='897a51fb'/>
    <pointer-type-def type-id='becc631c' size-in-bits='32' id='8a1f7e9e'/>
    <qualified-type-def type-id='973e3c3f' const='yes' id='8bac99cf'/>
    <pointer-type-def type-id='03e3ce24' size-in-bits='32' id='8bc971a6'/>
    <pointer-type-def type-id='5d529e9d' size-in-bits='32' id='8c22ffe9'/>
    <function-type size-in-bits='32' id='8c344f84'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='413b072a' size-in-bits='32' id='8c4e1254'/>
    <typedef-decl name='jchar' type-id='149c6638' id='8dfe2e06'/>
    <function-type size-in-bits='32' id='8e80bdd8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='f62c522d' size-in-bits='32' id='8ec52105'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <function-type size-in-bits='32' id='8f71b7e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='61dc2b35'/>
    </function-type>
    <function-type size-in-bits='32' id='90c673e3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='1a9d598b' size-in-bits='32' id='916299d7'/>
    <pointer-type-def type-id='59da7e0d' size-in-bits='32' id='921cf101'/>
    <pointer-type-def type-id='b3b907e8' size-in-bits='32' id='93737cc2'/>
    <function-type size-in-bits='32' id='9441d304'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='b43b1271'/>
    </function-type>
    <pointer-type-def type-id='fcac2709' size-in-bits='32' id='9447819d'/>
    <function-type size-in-bits='32' id='9539c406'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='95d32fc8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='9a10f134'/>
      <return type-id='48b5725f'/>
    </function-type>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <pointer-type-def type-id='2f02ea7a' size-in-bits='32' id='95fba39c'/>
    <function-type size-in-bits='32' id='968ef04b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <typedef-decl name='jobject' type-id='eaa32e2f' id='96f3d089'/>
    <function-type size-in-bits='32' id='96fb4d64'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <typedef-decl name='jdouble' type-id='a0eb0f08' id='973e3c3f'/>
    <pointer-type-def type-id='558a0aa4' size-in-bits='32' id='978c735e'/>
    <function-type size-in-bits='32' id='9863e9ef'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='98accb07'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='98f7aa67'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='2e19a82f' size-in-bits='32' id='99167093'/>
    <function-type size-in-bits='32' id='995d71ea'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='071e4e5d'/>
    </function-type>
    <typedef-decl name='jshort' type-id='23bd8cb5' id='9a10f134'/>
    <pointer-type-def type-id='fba5b0d7' size-in-bits='32' id='9ac8b1e3'/>
    <pointer-type-def type-id='f4d3e94e' size-in-bits='32' id='9aeb7958'/>
    <pointer-type-def type-id='6b5c9008' size-in-bits='32' id='9b3c0ac2'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <qualified-type-def type-id='8dfe2e06' const='yes' id='9bf2d596'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <function-type size-in-bits='32' id='a017e9d1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='e612672d' size-in-bits='32' id='a01a6e09'/>
    <pointer-type-def type-id='2e613a3e' size-in-bits='32' id='a0ba6dc8'/>
    <pointer-type-def type-id='3197286d' size-in-bits='32' id='a0bc56e9'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <function-type size-in-bits='32' id='a1159711'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='a1390ee9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='70de5c42'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='a18ab994'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <pointer-type-def type-id='5d4b6f06' size-in-bits='32' id='a23a76e0'/>
    <pointer-type-def type-id='837777dd' size-in-bits='32' id='a3ea0661'/>
    <pointer-type-def type-id='1ded82e5' size-in-bits='32' id='a4a48a09'/>
    <function-type size-in-bits='32' id='a4a61472'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='467aaa2c' size-in-bits='32' id='a4a6a786'/>
    <pointer-type-def type-id='ee0744fc' size-in-bits='32' id='a55b35a6'/>
    <pointer-type-def type-id='4aec61f6' size-in-bits='32' id='a60dd490'/>
    <pointer-type-def type-id='6bb2df61' size-in-bits='32' id='a617346d'/>
    <pointer-type-def type-id='461d0e9f' size-in-bits='32' id='a642a393'/>
    <pointer-type-def type-id='adf18958' size-in-bits='32' id='a6979e77'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <pointer-type-def type-id='d318157e' size-in-bits='32' id='a7d6acc8'/>
    <function-type size-in-bits='32' id='a8186878'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <pointer-type-def type-id='27a87596' size-in-bits='32' id='a86eb340'/>
    <pointer-type-def type-id='3ebf19c8' size-in-bits='32' id='a8d5bec6'/>
    <pointer-type-def type-id='a8186878' size-in-bits='32' id='a937264a'/>
    <pointer-type-def type-id='26ee7735' size-in-bits='32' id='a975aa19'/>
    <qualified-type-def type-id='0994533b' const='yes' id='a981db8b'/>
    <pointer-type-def type-id='9a10f134' size-in-bits='32' id='aa210e95'/>
    <function-type size-in-bits='32' id='ab5a280f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='98accb07' size-in-bits='32' id='ac33476b'/>
    <pointer-type-def type-id='4e053e6d' size-in-bits='32' id='ac4ad749'/>
    <pointer-type-def type-id='98f7aa67' size-in-bits='32' id='ac4e6cb3'/>
    <pointer-type-def type-id='717ad472' size-in-bits='32' id='ac74c0c4'/>
    <function-type size-in-bits='32' id='aca2cd7e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='e825b06b'/>
    </function-type>
    <class-decl name='JNINativeInterface' size-in-bits='7456' is-struct='yes' visibility='default' id='ad414f12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved0' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved3' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='GetVersion' type-id='4b15419a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='DefineClass' type-id='3358ddb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='FindClass' type-id='e905d0ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='FromReflectedMethod' type-id='09176273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='FromReflectedField' type-id='04aa9df2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ToReflectedMethod' type-id='582ba311' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='GetSuperclass' type-id='93737cc2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='IsAssignableFrom' type-id='f39f8bbd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ToReflectedField' type-id='58398eee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='Throw' type-id='4a0b9bf1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ThrowNew' type-id='0571aa74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ExceptionOccurred' type-id='7fdf58e1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ExceptionDescribe' type-id='8bc971a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='ExceptionClear' type-id='8bc971a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='FatalError' type-id='2deb20e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='PushLocalFrame' type-id='9aeb7958' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PopLocalFrame' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='NewGlobalRef' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='DeleteGlobalRef' type-id='8a1f7e9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='DeleteLocalRef' type-id='8a1f7e9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='IsSameObject' type-id='782c53f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='NewLocalRef' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='EnsureLocalCapacity' type-id='9aeb7958' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='AllocObject' type-id='151a1d63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='NewObject' type-id='f8af7982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='NewObjectV' type-id='a01a6e09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='NewObjectA' type-id='f0a0ff54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='GetObjectClass' type-id='b5f4f133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='IsInstanceOf' type-id='bcee08ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='GetMethodID' type-id='30974818' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='CallObjectMethod' type-id='2dab161d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='CallObjectMethodV' type-id='0290ef52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='CallObjectMethodA' type-id='4278623b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='CallBooleanMethod' type-id='461c5f2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='CallBooleanMethodV' type-id='88d99751' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='CallBooleanMethodA' type-id='74823d0c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='CallByteMethod' type-id='17d955f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='CallByteMethodV' type-id='44bea17b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='CallByteMethodA' type-id='ed0795aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='CallCharMethod' type-id='e747dee6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='CallCharMethodV' type-id='d31f1c35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='CallCharMethodA' type-id='b0061f70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='CallShortMethod' type-id='bf87e894' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='CallShortMethodV' type-id='5da2c37f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='CallShortMethodA' type-id='5db5877e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='CallIntMethod' type-id='3271bf2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='CallIntMethodV' type-id='66ebe6b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='CallIntMethodA' type-id='6c56e815' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='CallLongMethod' type-id='ea8867ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='CallLongMethodV' type-id='5f929ab7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='CallLongMethodA' type-id='a55b35a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='CallFloatMethod' type-id='e8139a80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='CallFloatMethodV' type-id='9ac8b1e3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='CallFloatMethodA' type-id='413559e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='CallDoubleMethod' type-id='a642a393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='CallDoubleMethodV' type-id='95fba39c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='CallDoubleMethodA' type-id='a3ea0661' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='CallVoidMethod' type-id='d696f7b3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='CallVoidMethodV' type-id='bbecc3fc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='CallVoidMethodA' type-id='921cf101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='CallNonvirtualObjectMethod' type-id='4f7677f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='CallNonvirtualObjectMethodV' type-id='15887ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='CallNonvirtualObjectMethodA' type-id='34c67260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='CallNonvirtualBooleanMethod' type-id='f1191df9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='CallNonvirtualBooleanMethodV' type-id='ff535cb6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='CallNonvirtualBooleanMethodA' type-id='fb38167f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='CallNonvirtualByteMethod' type-id='377b5e63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='CallNonvirtualByteMethodV' type-id='1930d02c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='CallNonvirtualByteMethodA' type-id='1d2f8a91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='CallNonvirtualCharMethod' type-id='63f7d65d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='CallNonvirtualCharMethodV' type-id='c32cfa12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='CallNonvirtualCharMethodA' type-id='c2280e7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='CallNonvirtualShortMethod' type-id='0de4af77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='CallNonvirtualShortMethodV' type-id='255ff5d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='CallNonvirtualShortMethodA' type-id='f4bbad8d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='CallNonvirtualIntMethod' type-id='ce1853bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='CallNonvirtualIntMethodV' type-id='d5b0b547' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='CallNonvirtualIntMethodA' type-id='3318dad6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='CallNonvirtualLongMethod' type-id='3459b4cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='CallNonvirtualLongMethodV' type-id='a60dd490' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='CallNonvirtualLongMethodA' type-id='326df5b5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='CallNonvirtualFloatMethod' type-id='eb164d0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='CallNonvirtualFloatMethodV' type-id='8c4e1254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='CallNonvirtualFloatMethodA' type-id='a0bc56e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='CallNonvirtualDoubleMethod' type-id='2dcc8b98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='CallNonvirtualDoubleMethodV' type-id='0e5e0cdb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='CallNonvirtualDoubleMethodA' type-id='a937264a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='CallNonvirtualVoidMethod' type-id='c14258b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='CallNonvirtualVoidMethodV' type-id='1db4c5bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='CallNonvirtualVoidMethodA' type-id='41d61b6a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='GetFieldID' type-id='5d99509b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='GetObjectField' type-id='7139225a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='GetBooleanField' type-id='13196dfd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='GetByteField' type-id='c8bc780f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='GetCharField' type-id='239d7ad9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='GetShortField' type-id='476f48bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='GetIntField' type-id='f7e564c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='GetLongField' type-id='ac4e6cb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GetFloatField' type-id='06fbd437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='GetDoubleField' type-id='47bc557c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='SetObjectField' type-id='e333ff60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='SetBooleanField' type-id='b263848f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='SetByteField' type-id='a4a48a09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='SetCharField' type-id='e4b27ecf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='SetShortField' type-id='090a6901' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='SetIntField' type-id='d3651c96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='SetLongField' type-id='09b49e9d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='SetFloatField' type-id='ac4ad749' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='SetDoubleField' type-id='195d3e42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='GetStaticMethodID' type-id='30974818' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='CallStaticObjectMethod' type-id='f8af7982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='CallStaticObjectMethodV' type-id='a01a6e09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='CallStaticObjectMethodA' type-id='f0a0ff54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='CallStaticBooleanMethod' type-id='916299d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='CallStaticBooleanMethodV' type-id='412650f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='CallStaticBooleanMethodA' type-id='339f696d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='CallStaticByteMethod' type-id='ce9d67cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='CallStaticByteMethodV' type-id='478facc2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='CallStaticByteMethodA' type-id='db28fdcb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='CallStaticCharMethod' type-id='3bd86cfb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='CallStaticCharMethodV' type-id='dddcefc4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='CallStaticCharMethodA' type-id='692552f9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='CallStaticShortMethod' type-id='362e2831' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='CallStaticShortMethodV' type-id='d1173c4e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='CallStaticShortMethodA' type-id='097c7407' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='CallStaticIntMethod' type-id='64ca4b84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='CallStaticIntMethodV' type-id='0323d66f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='CallStaticIntMethodA' type-id='30b9a8ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='CallStaticLongMethod' type-id='8c22ffe9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='CallStaticLongMethodV' type-id='60306f66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='CallStaticLongMethodA' type-id='1fda464f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='CallStaticFloatMethod' type-id='4ed90115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='CallStaticFloatMethodV' type-id='87e0b5ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='CallStaticFloatMethodA' type-id='caa57963' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='CallStaticDoubleMethod' type-id='04b3e5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='CallStaticDoubleMethodV' type-id='be0ed943' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='CallStaticDoubleMethodA' type-id='df8dc702' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='CallStaticVoidMethod' type-id='a86eb340' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='CallStaticVoidMethodV' type-id='cf05fa23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='CallStaticVoidMethodA' type-id='6fc0eca2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='GetStaticFieldID' type-id='5d99509b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='GetStaticObjectField' type-id='d7560895' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='GetStaticBooleanField' type-id='4127a730' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='GetStaticByteField' type-id='c404650a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='GetStaticCharField' type-id='0736b484' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4768'>
        <var-decl name='GetStaticShortField' type-id='0d5970ee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='GetStaticIntField' type-id='771014ab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='GetStaticLongField' type-id='a4a6a786' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='GetStaticFloatField' type-id='337e1672' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4896'>
        <var-decl name='GetStaticDoubleField' type-id='bd4849d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='SetStaticObjectField' type-id='6c160b51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='SetStaticBooleanField' type-id='0a7e4740' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='SetStaticByteField' type-id='0cb5bb00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='SetStaticCharField' type-id='bbfff1aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='SetStaticShortField' type-id='187251e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='SetStaticIntField' type-id='3a8fe115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='SetStaticLongField' type-id='72f7c194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='SetStaticFloatField' type-id='e0227512' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='SetStaticDoubleField' type-id='30411993' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='NewString' type-id='40f183ab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='GetStringLength' type-id='a7d6acc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5280'>
        <var-decl name='GetStringChars' type-id='e5a87447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ReleaseStringChars' type-id='61d681d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5344'>
        <var-decl name='NewStringUTF' type-id='691ba251' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='GetStringUTFLength' type-id='a7d6acc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5408'>
        <var-decl name='GetStringUTFChars' type-id='08565ebd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='ReleaseStringUTFChars' type-id='ac33476b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5472'>
        <var-decl name='GetArrayLength' type-id='a23a76e0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='NewObjectArray' type-id='e4f2ab66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5536'>
        <var-decl name='GetObjectArrayElement' type-id='0ae13aef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='SetObjectArrayElement' type-id='99167093' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5600'>
        <var-decl name='NewBooleanArray' type-id='162473c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='NewByteArray' type-id='be49c182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5664'>
        <var-decl name='NewCharArray' type-id='ac74c0c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='NewShortArray' type-id='978c735e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='NewIntArray' type-id='2041a8d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='NewLongArray' type-id='d7ea3436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5792'>
        <var-decl name='NewFloatArray' type-id='69b7386a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='NewDoubleArray' type-id='31ebf17b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5856'>
        <var-decl name='GetBooleanArrayElements' type-id='9b3c0ac2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='GetByteArrayElements' type-id='33683384' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5920'>
        <var-decl name='GetCharArrayElements' type-id='be2cecec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='GetShortArrayElements' type-id='5353c67e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5984'>
        <var-decl name='GetIntArrayElements' type-id='4f68d4b2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='GetLongArrayElements' type-id='b286ae14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6048'>
        <var-decl name='GetFloatArrayElements' type-id='210c37a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='GetDoubleArrayElements' type-id='b181362a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6112'>
        <var-decl name='ReleaseBooleanArrayElements' type-id='666fc788' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='ReleaseByteArrayElements' type-id='59e7b6c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6176'>
        <var-decl name='ReleaseCharArrayElements' type-id='01eb6566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='ReleaseShortArrayElements' type-id='075b7a00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='ReleaseIntArrayElements' type-id='bc4a7a06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ReleaseLongArrayElements' type-id='0ba6a8b6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='ReleaseFloatArrayElements' type-id='c503a924' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ReleaseDoubleArrayElements' type-id='c8abb79e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6368'>
        <var-decl name='GetBooleanArrayRegion' type-id='67514b72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='GetByteArrayRegion' type-id='c541e6a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6432'>
        <var-decl name='GetCharArrayRegion' type-id='af95e824' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='GetShortArrayRegion' type-id='1f57b15a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='GetIntArrayRegion' type-id='7f0ac28c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='GetLongArrayRegion' type-id='747a49e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='GetFloatArrayRegion' type-id='060c7d5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='GetDoubleArrayRegion' type-id='fce8e074' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='SetBooleanArrayRegion' type-id='a617346d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='SetByteArrayRegion' type-id='5ee69201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='SetCharArrayRegion' type-id='b049b821' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='SetShortArrayRegion' type-id='62d9dee9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='SetIntArrayRegion' type-id='f569444f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='SetLongArrayRegion' type-id='10182119' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='SetFloatArrayRegion' type-id='a975aa19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='SetDoubleArrayRegion' type-id='348c02e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='RegisterNatives' type-id='764ac7bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='UnregisterNatives' type-id='9447819d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='MonitorEnter' type-id='67a46ff2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='MonitorExit' type-id='67a46ff2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7008'>
        <var-decl name='GetJavaVM' type-id='5a4c25bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='GetStringRegion' type-id='fb79cfe8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7072'>
        <var-decl name='GetStringUTFRegion' type-id='629961b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='GetPrimitiveArrayCritical' type-id='d82ed742' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <var-decl name='ReleasePrimitiveArrayCritical' type-id='601f438c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='GetStringCritical' type-id='e5a87447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7200'>
        <var-decl name='ReleaseStringCritical' type-id='61d681d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='NewWeakGlobalRef' type-id='03bcacf3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='DeleteWeakGlobalRef' type-id='ccc141a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='ExceptionCheck' type-id='5796afad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7328'>
        <var-decl name='NewDirectByteBuffer' type-id='2c684c9f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='GetDirectBufferAddress' type-id='bd98ffce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7392'>
        <var-decl name='GetDirectBufferCapacity' type-id='47653e05' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='GetObjectRefType' type-id='500eebf7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='jbyte' type-id='ee31ee44' id='adf18958'/>
    <function-type size-in-bits='32' id='ae2834f4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <qualified-type-def type-id='1a7fe6b0' const='yes' id='af8c6a20'/>
    <pointer-type-def type-id='c8bb07fa' size-in-bits='32' id='af95e824'/>
    <pointer-type-def type-id='85d5402e' size-in-bits='32' id='b0061f70'/>
    <function-type size-in-bits='32' id='b01f64aa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='c4cf512d' size-in-bits='32' id='b049b821'/>
    <pointer-type-def type-id='d988e2e8' size-in-bits='32' id='b09bab5e'/>
    <function-type size-in-bits='32' id='b10103d8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='b142692f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='f5043860' size-in-bits='32' id='b181362a'/>
    <pointer-type-def type-id='c5a3852b' size-in-bits='32' id='b263848f'/>
    <pointer-type-def type-id='02c4e402' size-in-bits='32' id='b286ae14'/>
    <function-type size-in-bits='32' id='b2cf38da'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='b3b907e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='b3d5cbab'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='3b4676f4'/>
    </function-type>
    <typedef-decl name='jlongArray' type-id='65b69bb3' id='b43b1271'/>
    <pointer-type-def type-id='caf8409f' size-in-bits='32' id='b5f4f133'/>
    <function-type size-in-bits='32' id='b66924e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='b6d76995'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='b6e5053d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='a8d5bec6'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='JNINativeMethod' type-id='e754f6f2' id='b7b5d51d'/>
    <function-type size-in-bits='32' id='b7d01ad5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='b7e7edbe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <function-type size-in-bits='32' id='b9c972b8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='44a04411' size-in-bits='32' id='badd5935'/>
    <pointer-type-def type-id='59b5ee8a' size-in-bits='32' id='bbecc3fc'/>
    <pointer-type-def type-id='e81ac6f8' size-in-bits='32' id='bbfff1aa'/>
    <pointer-type-def type-id='5368e5fc' size-in-bits='32' id='bc4a7a06'/>
    <pointer-type-def type-id='6935722a' size-in-bits='32' id='bcee08ac'/>
    <function-type size-in-bits='32' id='bcf91e7a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='d8263a65'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='ed3044e3' size-in-bits='32' id='bd4849d7'/>
    <pointer-type-def type-id='a18ab994' size-in-bits='32' id='bd98ffce'/>
    <pointer-type-def type-id='dad530df' size-in-bits='32' id='be0ed943'/>
    <pointer-type-def type-id='995d71ea' size-in-bits='32' id='be2cecec'/>
    <pointer-type-def type-id='8f71b7e8' size-in-bits='32' id='be49c182'/>
    <qualified-type-def type-id='ad414f12' const='yes' id='bebf8fb7'/>
    <function-type size-in-bits='32' id='becc631c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='becc7143'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='bed9a8c1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='bf1e0391'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='f6de0a0a' size-in-bits='32' id='bf87e894'/>
    <function-type size-in-bits='32' id='c12bf182'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='d47f2e6e' size-in-bits='32' id='c14258b8'/>
    <qualified-type-def type-id='9a10f134' const='yes' id='c17f92e4'/>
    <pointer-type-def type-id='ab5a280f' size-in-bits='32' id='c2280e7b'/>
    <pointer-type-def type-id='c8745fdc' size-in-bits='32' id='c2fb5303'/>
    <pointer-type-def type-id='b10103d8' size-in-bits='32' id='c32cfa12'/>
    <function-type size-in-bits='32' id='c355496b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='3c8ecc03'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jobjectRefType' type-id='4f771c8a' id='c36bf49e'/>
    <pointer-type-def type-id='ebc81181' size-in-bits='32' id='c3a70532'/>
    <pointer-type-def type-id='8e80bdd8' size-in-bits='32' id='c404650a'/>
    <function-type size-in-bits='32' id='c4cf512d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='3b4676f4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='bcf91e7a' size-in-bits='32' id='c503a924'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <pointer-type-def type-id='386e18fa' size-in-bits='32' id='c541e6a4'/>
    <function-type size-in-bits='32' id='c5a3852b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='8bac99cf' size-in-bits='32' id='c5b6437f'/>
    <function-type size-in-bits='32' id='c5c8084e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='26a90f95'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jlong' type-id='9da381c4' id='c8745fdc'/>
    <pointer-type-def type-id='792136c4' size-in-bits='32' id='c8abb79e'/>
    <function-type size-in-bits='32' id='c8bb07fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='071e4e5d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='4142d35b' size-in-bits='32' id='c8bc780f'/>
    <function-type size-in-bits='32' id='c9f7d0f5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='9a10f134'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='ca62bfca'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='88f16d4f' size-in-bits='32' id='caa57963'/>
    <function-type size-in-bits='32' id='caf8409f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='cb425c26'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='071e4e5d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jboolean' type-id='b96825af' id='cc6e09ca'/>
    <pointer-type-def type-id='5432adc5' size-in-bits='32' id='ccc141a1'/>
    <function-type size-in-bits='32' id='cd5e6e48'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='6e9854cd'/>
    </function-type>
    <pointer-type-def type-id='b2cf38da' size-in-bits='32' id='ce1853bc'/>
    <pointer-type-def type-id='e6efff49' size-in-bits='32' id='ce9d67cd'/>
    <pointer-type-def type-id='9863e9ef' size-in-bits='32' id='cf05fa23'/>
    <pointer-type-def type-id='da5acea4' size-in-bits='32' id='d1173c4e'/>
    <function-type size-in-bits='32' id='d1ff2147'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d318157e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <return type-id='2c2f1adb'/>
    </function-type>
    <pointer-type-def type-id='8833c461' size-in-bits='32' id='d31f1c35'/>
    <typedef-decl name='JNIEnv' type-id='e48f1427' id='d357872a'/>
    <pointer-type-def type-id='8570b09c' size-in-bits='32' id='d3651c96'/>
    <function-type size-in-bits='32' id='d413ac7e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='adf18958'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d47c1022'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d47f2e6e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='cc6e09ca' size-in-bits='32' id='d4a328b7'/>
    <pointer-type-def type-id='968ef04b' size-in-bits='32' id='d5b0b547'/>
    <function-type size-in-bits='32' id='d664a6f7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='70b02f6f' size-in-bits='32' id='d696f7b3'/>
    <function-type size-in-bits='32' id='d6dcfc5b'>
      <parameter type-id='c3a70532'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='41301cf9' size-in-bits='32' id='d7560895'/>
    <function-type size-in-bits='32' id='d776b039'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='9441d304' size-in-bits='32' id='d7ea3436'/>
    <pointer-type-def type-id='1a7fe6b0' size-in-bits='32' id='d8263a65'/>
    <pointer-type-def type-id='7ba71958' size-in-bits='32' id='d82ed742'/>
    <class-decl name='_jmethodID' is-struct='yes' visibility='default' is-declaration-only='yes' id='d988e2e8'/>
    <function-type size-in-bits='32' id='da11822e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='da4ac88c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='aa210e95'/>
    </function-type>
    <function-type size-in-bits='32' id='da5acea4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='dad530df'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='3eafa32f' size-in-bits='32' id='db28fdcb'/>
    <function-type size-in-bits='32' id='db9b93fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='dc0b1ac7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='feee141c'/>
    </function-type>
    <function-type size-in-bits='32' id='dc1ed48c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='dcbb605e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='dd7295b3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='e5e01142' size-in-bits='32' id='dddcefc4'/>
    <pointer-type-def type-id='126e53d0' size-in-bits='32' id='df8dc702'/>
    <pointer-type-def type-id='3d2d0c38' size-in-bits='32' id='e0227512'/>
    <function-type size-in-bits='32' id='e0efb9de'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='e1e0781a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='e24417ff'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='da11822e' size-in-bits='32' id='e333ff60'/>
    <function-type size-in-bits='32' id='e3e7515c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='bebf8fb7' size-in-bits='32' id='e48f1427'/>
    <pointer-type-def type-id='6e3cf71b' size-in-bits='32' id='e4b27ecf'/>
    <pointer-type-def type-id='38edd3d4' size-in-bits='32' id='e4f2ab66'/>
    <pointer-type-def type-id='b3d5cbab' size-in-bits='32' id='e5a87447'/>
    <function-type size-in-bits='32' id='e5e01142'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='e612672d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='e6efff49'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='4e7eaf04' size-in-bits='32' id='e747dee6'/>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' visibility='default' id='e754f6f2' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='signature' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fnPtr' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='757515fe' size-in-bits='32' id='e8139a80'/>
    <function-type size-in-bits='32' id='e81ac6f8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='8dfe2e06'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jbooleanArray' type-id='65b69bb3' id='e825b06b'/>
    <function-type size-in-bits='32' id='e8f54abb'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='c36bf49e'/>
    </function-type>
    <pointer-type-def type-id='e1e0781a' size-in-bits='32' id='e905d0ac'/>
    <pointer-type-def type-id='b01f64aa' size-in-bits='32' id='ea8867ec'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <pointer-type-def type-id='1cd86ccf' size-in-bits='32' id='eb164d0b'/>
    <function-type size-in-bits='32' id='eb796c24'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='d8263a65'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='JavaVM' type-id='813b5a14' id='ebc81181'/>
    <pointer-type-def type-id='ed5f0798' size-in-bits='32' id='ed0795aa'/>
    <function-type size-in-bits='32' id='ed3044e3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='ed5f0798'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='ee0744fc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='2e67d715' size-in-bits='32' id='ee3187c5'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <function-type size-in-bits='32' id='ef48369b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='efa46d99'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='3b4676f4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='21042e4a' size-in-bits='32' id='f0a0ff54'/>
    <pointer-type-def type-id='6b6501bd' size-in-bits='32' id='f1191df9'/>
    <function-type size-in-bits='32' id='f341e414'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='a1390ee9' size-in-bits='32' id='f39f8bbd'/>
    <pointer-type-def type-id='3fa8e199' size-in-bits='32' id='f4bbad8d'/>
    <function-type size-in-bits='32' id='f4d3e94e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='f5043860'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='6292c81e'/>
    </function-type>
    <pointer-type-def type-id='c355496b' size-in-bits='32' id='f569444f'/>
    <qualified-type-def type-id='b7b5d51d' const='yes' id='f62c522d'/>
    <function-type size-in-bits='32' id='f6de0a0a'>
