<abi-corpus version='2.1' architecture='elf-arm' soname='libmediandk.so'>
  <elf-needed>
    <dependency name='android.hardware.graphics.bufferqueue@1.0.so'/>
    <dependency name='android.hidl.token@1.0-utils.so'/>
    <dependency name='libandroid_runtime_lazy.so'/>
    <dependency name='libbase.so'/>
    <dependency name='libdatasource.so'/>
    <dependency name='libmedia.so'/>
    <dependency name='libmediadrm.so'/>
    <dependency name='libmedia_omx.so'/>
    <dependency name='libmedia_jni_utils.so'/>
    <dependency name='libstagefright.so'/>
    <dependency name='libstagefright_foundation.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libnativewindow.so'/>
    <dependency name='libhidlbase.so'/>
    <dependency name='libgui.so'/>
    <dependency name='libui.so'/>
    <dependency name='libmediandk_utils.so'/>
    <dependency name='android.hardware.drm-V1-ndk.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AImageReader_acquireLatestImage' version='LIBMEDIANDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='AMEDIAFORMAT_KEY_SAR_WIDTH' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_SEI' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_SLICE_HEIGHT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_SLOW_MOTION_MARKERS' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_STRIDE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TARGET_TIME' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TEMPORAL_LAYERING' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_COUNT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_ID' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TEXT_FORMAT_DATA' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_AV1C' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_HEVC' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_THUMBNAIL_HEIGHT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_THUMBNAIL_TIME' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_THUMBNAIL_WIDTH' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TILE_HEIGHT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TILE_WIDTH' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TIME_US' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TITLE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TRACK_ID' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_TRACK_INDEX' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_VALID_SAMPLES' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_WIDTH' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_XMP_OFFSET' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_XMP_SIZE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_YEAR' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='infinite' id='1fdc7fa6'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <class-decl name='AHardwareBuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d45f31e'/>
    <class-decl name='AImage' size-in-bits='448' is-struct='yes' visibility='default' id='efcea311'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mReader' type-id='4b901eeb' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='mFormat' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mUsage' type-id='c3b7ba7d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='mBuffer' type-id='779df1e9' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='mLockedBuffer' type-id='7ba774a6' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='mTimestamp' type-id='f07b7694' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='mWidth' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='mHeight' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='mNumPlanes' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='mIsClosed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='mLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AImage' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7f64b4d9' is-artificial='yes'/>
          <parameter type-id='86ce2998'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='779df1e9'/>
          <parameter type-id='9da381c4'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='3ff5601b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~AImage' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7f64b4d9' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AImageCropRect' size-in-bits='128' is-struct='yes' visibility='default' id='7f7a21fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='top' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bottom' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AImageReader' is-struct='yes' visibility='default' id='64f1b8aa'>
      <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca1a'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='kWhatBufferRemoved' value='0'/>
          <enumerator name='kWhatImageAvailable' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='CallbackHandler' size-in-bits='448' visibility='default' id='646db3a7'>
          <base-class access='public' layout-offset-in-bits='0' type-id='64606595'/>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='mReader' type-id='86ce2998' visibility='default'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='CallbackHandler' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='860bddbf' is-artificial='yes'/>
              <parameter type-id='86ce2998'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='FrameListener' size-in-bits='256' is-struct='yes' visibility='default' id='2c180b3f'>
          <base-class access='public' layout-offset-in-bits='0' type-id='5966fe8d'/>
          <data-member access='private' layout-offset-in-bits='32'>
            <var-decl name='mListener' type-id='f2842f91' visibility='default'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='96'>
            <var-decl name='mReader' type-id='f352e66f' visibility='default'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='160'>
            <var-decl name='mLock' type-id='406f4753' visibility='default'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='FrameListener' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='1246ff17' is-artificial='yes'/>
              <parameter type-id='86ce2998'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='BufferRemovedListener' size-in-bits='256' is-struct='yes' visibility='default' id='8b0554fc'>
          <base-class access='public' layout-offset-in-bits='0' type-id='ce828df7'/>
          <data-member access='private' layout-offset-in-bits='32'>
            <var-decl name='mListener' type-id='1019e3ca' visibility='default'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='96'>
            <var-decl name='mReader' type-id='f352e66f' visibility='default'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='160'>
            <var-decl name='mLock' type-id='406f4753' visibility='default'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='BufferRemovedListener' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='1d6635fa' is-artificial='yes'/>
              <parameter type-id='86ce2998'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kCallbackFpKey' type-id='80f4b756' mangled-name='_ZN12AImageReader14kCallbackFpKeyE' visibility='default'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kContextKey' type-id='80f4b756' mangled-name='_ZN12AImageReader11kContextKeyE' visibility='default'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kGraphicBufferKey' type-id='80f4b756' mangled-name='_ZN12AImageReader17kGraphicBufferKeyE' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mHandler' type-id='90d9b053' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='mCbLooper' type-id='5fbf0404' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='mBuffers' type-id='fe3d4356' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='mWidth' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='mHeight' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='mFormat' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='mUsage' type-id='c3b7ba7d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='mMaxImages' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='mNumPlanes' type-id='922df12b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='mFrameListener' type-id='8c89e54b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='480'>
        <var-decl name='mBufferRemovedListener' type-id='7c0c616e' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='mHalFormat' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='544'>
        <var-decl name='mHalDataSpace' type-id='6196fb6a' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='mHalUsage' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='mProducer' type-id='9d2f093d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='672'>
        <var-decl name='mSurface' type-id='f87395f7' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='mBufferItemConsumer' type-id='8ef9ed91' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='736'>
        <var-decl name='mWindow' type-id='fc02f45b' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='mWindowHandle' type-id='d6183f40' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='800'>
        <var-decl name='mAcquiredImages' type-id='9c55411c' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='864'>
        <var-decl name='mIsOpen' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='mLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AImageReader' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='86ce2998' is-artificial='yes'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='3ff5601b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='0'>
        <function-decl name='~AImageReader' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='86ce2998' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AImageReader_BufferRemovedListener' size-in-bits='64' is-struct='yes' visibility='default' id='e412be03'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onBufferRemoved' type-id='d884d6c9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AImageReader_ImageListener' size-in-bits='64' is-struct='yes' visibility='default' id='1aa88244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onImageAvailable' type-id='30cec2c6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCodec' size-in-bits='608' is-struct='yes' visibility='default' id='e582d26a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mCodec' type-id='c59f6c00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mLooper' type-id='5fbf0404' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mHandler' type-id='4ffcdbb7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mActivityNotification' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mGeneration' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mRequestedActivityNotification' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mCallback' type-id='927f265f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mCallbackUserData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mAsyncNotify' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mAsyncCallbackLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mAsyncCallback' type-id='75ec1ac2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mAsyncCallbackUserData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='mFrameRenderedNotify' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mFrameRenderedCallbackLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='mFrameRenderedCallback' type-id='6e7445d0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='mFrameRenderedCallbackUserData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCodecBufferInfo' size-in-bits='192' is-struct='yes' visibility='default' id='5a377cc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='size' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='presentationTimeUs' type-id='9da381c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCodecCryptoInfo' size-in-bits='448' is-struct='yes' visibility='default' id='72200e73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numsubsamples' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='key' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='iv' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mode' type-id='cb8ce096' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pattern' type-id='e36979af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='clearbytes' type-id='78c01427' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='encryptedbytes' type-id='78c01427' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCodecOnAsyncNotifyCallback' size-in-bits='128' is-struct='yes' visibility='default' id='1ddfa4b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='onAsyncInputAvailable' type-id='7337a56f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onAsyncOutputAvailable' type-id='15b64de8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='onAsyncFormatChanged' type-id='1ad4eaa1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='onAsyncError' type-id='ea41e5fe' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCrypto' size-in-bits='32' is-struct='yes' visibility='default' id='45fc6539'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mCrypto' type-id='fb567094' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaDataSource' size-in-bits='224' is-struct='yes' visibility='default' id='622f5dd5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='userdata' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='readAt' type-id='f9998ddd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='getSize' type-id='171f0f31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='close' type-id='ff3b42d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='getAvailableSize' type-id='9984480a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mImpl' type-id='3e411281' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mFlags' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaDrm' size-in-bits='960' is-struct='yes' visibility='default' id='25082c7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mDrm' type-id='04810e42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mIds' type-id='bd474af3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mQueryResults' type-id='2236983b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mKeyRequest' type-id='75c74f24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mDefaultUrl' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mkeyRequestType' type-id='48294b8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='mProvisionRequest' type-id='75c74f24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mProvisionUrl' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='mPropertyString' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mPropertyByteArray' type-id='75c74f24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='mSecureStops' type-id='bd474af3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='mListener' type-id='e6881728' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaDrmKeyStatus' size-in-bits='96' is-struct='yes' visibility='default' id='5a341c9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keyId' type-id='fd431bd8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='keyType' type-id='e810d7cf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaDrmKeyValuePair' size-in-bits='64' is-struct='yes' visibility='default' id='2a2999e9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mKey' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mValue' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaExtractor' size-in-bits='64' is-struct='yes' visibility='default' id='66585c10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mImpl' type-id='41728969' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mPsshBuf' type-id='8213f55d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaFormat' size-in-bits='224' is-struct='yes' visibility='default' id='eb8cac6b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mFormat' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mDebug' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mStringCache' type-id='2236983b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaMuxer' size-in-bits='32' is-struct='yes' visibility='default' id='68b7df85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mImpl' type-id='93f5453e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ANativeWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d637dbf'/>
    <class-decl name='ARect' size-in-bits='128' is-struct='yes' visibility='default' id='c9ee9172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='top' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bottom' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='CDataSource' size-in-bits='160' is-struct='yes' visibility='default' id='98799747'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='readAt' type-id='70e2cf58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='getSize' type-id='340d2857' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='9886b1f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='getUri' type-id='44f069c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='handle' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='CodecHandler' size-in-bits='448' visibility='default' id='c07cb5cb'>
      <base-class access='public' layout-offset-in-bits='0' type-id='64606595'/>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='mCodec' type-id='d6a33e98' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='CodecHandler' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8d03b16b' is-artificial='yes'/>
          <parameter type-id='d6a33e98'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='DrmListener' size-in-bits='224' is-struct='yes' visibility='default' id='7bcb42ae'>
      <base-class access='public' layout-offset-in-bits='288' is-virtual='yes' type-id='5a20c16f'/>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='mObj' type-id='3de0002d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mEventListener' type-id='5f16d02e' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='mExpirationUpdateListener' type-id='22b0d5aa' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='mKeysChangeListener' type-id='e9ca4612' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='DrmListener' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8c3b9314' is-artificial='yes'/>
          <parameter type-id='3de0002d'/>
          <parameter type-id='5f16d02e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DrmListener' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8c3b9314' is-artificial='yes'/>
          <parameter type-id='3de0002d'/>
          <parameter type-id='22b0d5aa'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DrmListener' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8c3b9314' is-artificial='yes'/>
          <parameter type-id='3de0002d'/>
          <parameter type-id='e9ca4612'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='NdkDataSource' size-in-bits='192' is-struct='yes' visibility='default' id='86d6f7b9'>
      <base-class access='public' layout-offset-in-bits='0' type-id='08de3ccd'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='mDataSource' type-id='efa63d55' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='NdkDataSource' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='e8a74fc1' is-artificial='yes'/>
          <parameter type-id='efa63d55'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='0'>
        <function-decl name='~NdkDataSource' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='e8a74fc1' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PsshInfo' is-struct='yes' visibility='default' is-declaration-only='yes' id='567ded7b'/>
    <class-decl name='android_cta861_3_metadata' size-in-bits='64' is-struct='yes' visibility='default' id='7520e830'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='maxContentLightLevel' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='maxFrameAverageLightLevel' type-id='a6c45d85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='android_smpte2086_metadata' size-in-bits='320' is-struct='yes' visibility='default' id='ba8bd8c0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='displayPrimaryRed' type-id='0095f3ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='displayPrimaryGreen' type-id='0095f3ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='displayPrimaryBlue' type-id='0095f3ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='whitePoint' type-id='0095f3ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='maxLuminance' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='minLuminance' type-id='a6c45d85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='android_xy_color' size-in-bits='64' is-struct='yes' visibility='default' id='0095f3ea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='a6c45d85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='native_handle' size-in-bits='96' is-struct='yes' visibility='default' id='3181ea79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='numFds' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numInts' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='data' type-id='1fdc7fa6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='00bc5b46' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encryptBlocks' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='skipBlocks' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='92fa54c8' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='bbb76264' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='9f7200cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='length' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='AMediaDrmEventType' id='54a1c1c6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='EVENT_PROVISION_REQUIRED' value='1'/>
      <enumerator name='EVENT_KEY_REQUIRED' value='2'/>
      <enumerator name='EVENT_KEY_EXPIRED' value='3'/>
      <enumerator name='EVENT_VENDOR_DEFINED' value='4'/>
      <enumerator name='EVENT_SESSION_RECLAIMED' value='5'/>
    </enum-decl>
    <enum-decl name='AMediaDrmKeyRequestType' id='6005c0f6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='KEY_REQUEST_TYPE_INITIAL' value='0'/>
      <enumerator name='KEY_REQUEST_TYPE_RENEWAL' value='1'/>
      <enumerator name='KEY_REQUEST_TYPE_RELEASE' value='2'/>
      <enumerator name='KEY_REQUEST_TYPE_NONE' value='3'/>
      <enumerator name='KEY_REQUEST_TYPE_UPDATE' value='4'/>
    </enum-decl>
    <enum-decl name='AMediaDrmKeyType' id='18ba2a59'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='KEY_TYPE_STREAMING' value='1'/>
      <enumerator name='KEY_TYPE_OFFLINE' value='2'/>
      <enumerator name='KEY_TYPE_RELEASE' value='3'/>
    </enum-decl>
    <enum-decl name='AMediaKeyStatusType' id='031917a6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='KEY_STATUS_TYPE_USABLE' value='0'/>
      <enumerator name='KEY_STATUS_TYPE_EXPIRED' value='1'/>
      <enumerator name='KEY_STATUS_TYPE_OUTPUTNOTALLOWED' value='2'/>
      <enumerator name='KEY_STATUS_TYPE_STATUSPENDING' value='3'/>
      <enumerator name='KEY_STATUS_TYPE_INTERNALERROR' value='4'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='14011b62' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_CLEAR' value='0'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_AES_CTR' value='1'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_AES_WV' value='2'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_AES_CBC' value='3'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='58cf06da' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIAMUXER_OUTPUT_FORMAT_MPEG_4' value='0'/>
      <enumerator name='AMEDIAMUXER_OUTPUT_FORMAT_WEBM' value='1'/>
      <enumerator name='AMEDIAMUXER_OUTPUT_FORMAT_THREE_GPP' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='c04b7afb' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIAEXTRACTOR_SEEK_PREVIOUS_SYNC' value='0'/>
      <enumerator name='AMEDIAEXTRACTOR_SEEK_NEXT_SYNC' value='1'/>
      <enumerator name='AMEDIAEXTRACTOR_SEEK_CLOSEST_SYNC' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='d3fca860' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIA_OK' value='0'/>
      <enumerator name='AMEDIACODEC_ERROR_INSUFFICIENT_RESOURCE' value='1100'/>
      <enumerator name='AMEDIACODEC_ERROR_RECLAIMED' value='1101'/>
      <enumerator name='AMEDIA_ERROR_BASE' value='-10000'/>
      <enumerator name='AMEDIA_ERROR_UNKNOWN' value='-10000'/>
      <enumerator name='AMEDIA_ERROR_MALFORMED' value='-10001'/>
      <enumerator name='AMEDIA_ERROR_UNSUPPORTED' value='-10002'/>
      <enumerator name='AMEDIA_ERROR_INVALID_OBJECT' value='-10003'/>
      <enumerator name='AMEDIA_ERROR_INVALID_PARAMETER' value='-10004'/>
      <enumerator name='AMEDIA_ERROR_INVALID_OPERATION' value='-10005'/>
      <enumerator name='AMEDIA_ERROR_END_OF_STREAM' value='-10006'/>
      <enumerator name='AMEDIA_ERROR_IO' value='-10007'/>
      <enumerator name='AMEDIA_ERROR_WOULD_BLOCK' value='-10008'/>
      <enumerator name='AMEDIA_DRM_ERROR_BASE' value='-20000'/>
      <enumerator name='AMEDIA_DRM_NOT_PROVISIONED' value='-20001'/>
      <enumerator name='AMEDIA_DRM_RESOURCE_BUSY' value='-20002'/>
      <enumerator name='AMEDIA_DRM_DEVICE_REVOKED' value='-20003'/>
      <enumerator name='AMEDIA_DRM_SHORT_BUFFER' value='-20004'/>
      <enumerator name='AMEDIA_DRM_SESSION_NOT_OPENED' value='-20005'/>
      <enumerator name='AMEDIA_DRM_TAMPER_DETECTED' value='-20006'/>
      <enumerator name='AMEDIA_DRM_VERIFY_FAILED' value='-20007'/>
      <enumerator name='AMEDIA_DRM_NEED_KEY' value='-20008'/>
      <enumerator name='AMEDIA_DRM_LICENSE_EXPIRED' value='-20009'/>
      <enumerator name='AMEDIA_IMGREADER_ERROR_BASE' value='-30000'/>
      <enumerator name='AMEDIA_IMGREADER_NO_BUFFER_AVAILABLE' value='-30001'/>
      <enumerator name='AMEDIA_IMGREADER_MAX_IMAGES_ACQUIRED' value='-30002'/>
      <enumerator name='AMEDIA_IMGREADER_CANNOT_LOCK_IMAGE' value='-30003'/>
      <enumerator name='AMEDIA_IMGREADER_CANNOT_UNLOCK_IMAGE' value='-30004'/>
      <enumerator name='AMEDIA_IMGREADER_IMAGE_NOT_LOCKED' value='-30005'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='e7ca786d' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HAL_DATASPACE_UNKNOWN' value='0'/>
      <enumerator name='HAL_DATASPACE_ARBITRARY' value='1'/>
      <enumerator name='HAL_DATASPACE_STANDARD_SHIFT' value='16'/>
      <enumerator name='HAL_DATASPACE_STANDARD_MASK' value='4128768'/>
      <enumerator name='HAL_DATASPACE_STANDARD_UNSPECIFIED' value='0'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT709' value='65536'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT601_625' value='131072'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT601_625_UNADJUSTED' value='196608'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT601_525' value='262144'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT601_525_UNADJUSTED' value='327680'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT2020' value='393216'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT2020_CONSTANT_LUMINANCE' value='458752'/>
      <enumerator name='HAL_DATASPACE_STANDARD_BT470M' value='524288'/>
      <enumerator name='HAL_DATASPACE_STANDARD_FILM' value='589824'/>
      <enumerator name='HAL_DATASPACE_STANDARD_DCI_P3' value='655360'/>
      <enumerator name='HAL_DATASPACE_STANDARD_ADOBE_RGB' value='720896'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_SHIFT' value='22'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_MASK' value='130023424'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_UNSPECIFIED' value='0'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_LINEAR' value='4194304'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_SRGB' value='8388608'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_SMPTE_170M' value='12582912'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_GAMMA2_2' value='16777216'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_GAMMA2_6' value='20971520'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_GAMMA2_8' value='25165824'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_ST2084' value='29360128'/>
      <enumerator name='HAL_DATASPACE_TRANSFER_HLG' value='33554432'/>
      <enumerator name='HAL_DATASPACE_RANGE_SHIFT' value='27'/>
      <enumerator name='HAL_DATASPACE_RANGE_MASK' value='939524096'/>
      <enumerator name='HAL_DATASPACE_RANGE_UNSPECIFIED' value='0'/>
      <enumerator name='HAL_DATASPACE_RANGE_FULL' value='134217728'/>
      <enumerator name='HAL_DATASPACE_RANGE_LIMITED' value='268435456'/>
      <enumerator name='HAL_DATASPACE_RANGE_EXTENDED' value='402653184'/>
      <enumerator name='HAL_DATASPACE_SRGB_LINEAR' value='512'/>
      <enumerator name='HAL_DATASPACE_V0_SRGB_LINEAR' value='138477568'/>
      <enumerator name='HAL_DATASPACE_V0_SCRGB_LINEAR' value='406913024'/>
      <enumerator name='HAL_DATASPACE_SRGB' value='513'/>
      <enumerator name='HAL_DATASPACE_V0_SRGB' value='142671872'/>
      <enumerator name='HAL_DATASPACE_V0_SCRGB' value='411107328'/>
      <enumerator name='HAL_DATASPACE_JFIF' value='257'/>
      <enumerator name='HAL_DATASPACE_V0_JFIF' value='146931712'/>
      <enumerator name='HAL_DATASPACE_BT601_625' value='258'/>
      <enumerator name='HAL_DATASPACE_V0_BT601_625' value='281149440'/>
      <enumerator name='HAL_DATASPACE_BT601_525' value='259'/>
      <enumerator name='HAL_DATASPACE_V0_BT601_525' value='281280512'/>
      <enumerator name='HAL_DATASPACE_BT709' value='260'/>
      <enumerator name='HAL_DATASPACE_V0_BT709' value='281083904'/>
      <enumerator name='HAL_DATASPACE_DCI_P3_LINEAR' value='139067392'/>
      <enumerator name='HAL_DATASPACE_DCI_P3' value='155844608'/>
      <enumerator name='HAL_DATASPACE_DISPLAY_P3_LINEAR' value='139067392'/>
      <enumerator name='HAL_DATASPACE_DISPLAY_P3' value='143261696'/>
      <enumerator name='HAL_DATASPACE_ADOBE_RGB' value='151715840'/>
      <enumerator name='HAL_DATASPACE_BT2020_LINEAR' value='138805248'/>
      <enumerator name='HAL_DATASPACE_BT2020' value='147193856'/>
      <enumerator name='HAL_DATASPACE_BT2020_PQ' value='163971072'/>
      <enumerator name='HAL_DATASPACE_DEPTH' value='4096'/>
      <enumerator name='HAL_DATASPACE_SENSOR' value='4097'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='f46baf0b' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIAMUXER_APPEND_IGNORE_LAST_VIDEO_GOP' value='0'/>
      <enumerator name='AMEDIAMUXER_APPEND_TO_EXISTING_DATA' value='1'/>
    </enum-decl>
    <function-decl name='AImageReader_acquireLatestImage' mangled-name='AImageReader_acquireLatestImage' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_acquireLatestImage@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <parameter type-id='7e88da89' name='image'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_acquireLatestImageAsync' mangled-name='AImageReader_acquireLatestImageAsync' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_acquireLatestImageAsync@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <parameter type-id='7e88da89' name='image'/>
      <parameter type-id='7292109c' name='acquireFenceFd'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_acquireNextImage' mangled-name='AImageReader_acquireNextImage' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_acquireNextImage@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <parameter type-id='7e88da89' name='image'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_acquireNextImageAsync' mangled-name='AImageReader_acquireNextImageAsync' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_acquireNextImageAsync@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <parameter type-id='7e88da89' name='image'/>
      <parameter type-id='7292109c' name='acquireFenceFd'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_delete' mangled-name='AImageReader_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_delete@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AImageReader_getFormat' mangled-name='AImageReader_getFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_getFormat@@LIBMEDIANDK'>
      <parameter type-id='42374637' name='reader'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_getHeight' mangled-name='AImageReader_getHeight' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_getHeight@@LIBMEDIANDK'>
      <parameter type-id='42374637' name='reader'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_getMaxImages' mangled-name='AImageReader_getMaxImages' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_getMaxImages@@LIBMEDIANDK'>
      <parameter type-id='42374637' name='reader'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_getWidth' mangled-name='AImageReader_getWidth' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_getWidth@@LIBMEDIANDK'>
      <parameter type-id='42374637' name='reader'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_getWindow' mangled-name='AImageReader_getWindow' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_getWindow@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <parameter type-id='a1c8a297' name='window'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_new' mangled-name='AImageReader_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_new@@LIBMEDIANDK'>
      <parameter type-id='3ff5601b' name='width'/>
      <parameter type-id='3ff5601b' name='height'/>
      <parameter type-id='3ff5601b' name='format'/>
      <parameter type-id='3ff5601b' name='maxImages'/>
      <parameter type-id='e88ba336' name='reader'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_newWithUsage' mangled-name='AImageReader_newWithUsage' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_newWithUsage@@LIBMEDIANDK'>
      <parameter type-id='3ff5601b' name='width'/>
      <parameter type-id='3ff5601b' name='height'/>
      <parameter type-id='3ff5601b' name='format'/>
      <parameter type-id='9c313c2d' name='usage'/>
      <parameter type-id='3ff5601b' name='maxImages'/>
      <parameter type-id='e88ba336' name='reader'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_setBufferRemovedListener' mangled-name='AImageReader_setBufferRemovedListener' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_setBufferRemovedListener@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <parameter type-id='9e17e3c3' name='listener'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImageReader_setImageListener' mangled-name='AImageReader_setImageListener' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageReader_setImageListener@@LIBMEDIANDK'>
      <parameter type-id='86ce2998' name='reader'/>
      <parameter type-id='285013a2' name='listener'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_delete' mangled-name='AImage_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_delete@@LIBMEDIANDK'>
      <parameter type-id='7f64b4d9' name='image'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AImage_deleteAsync' mangled-name='AImage_deleteAsync' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_deleteAsync@@LIBMEDIANDK'>
      <parameter type-id='7f64b4d9' name='image'/>
      <parameter type-id='95e97e5e' name='releaseFenceFd'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AImage_getCropRect' mangled-name='AImage_getCropRect' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getCropRect@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='b8b93b1d' name='rect'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getFormat' mangled-name='AImage_getFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getFormat@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getHardwareBuffer' mangled-name='AImage_getHardwareBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getHardwareBuffer@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='2cb5879a' name='buffer'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getHeight' mangled-name='AImage_getHeight' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getHeight@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getNumberOfPlanes' mangled-name='AImage_getNumberOfPlanes' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getNumberOfPlanes@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getPlaneData' mangled-name='AImage_getPlaneData' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getPlaneData@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='95e97e5e' name='planeIdx'/>
      <parameter type-id='d8774064' name='data'/>
      <parameter type-id='7292109c' name='dataLength'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getPlanePixelStride' mangled-name='AImage_getPlanePixelStride' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getPlanePixelStride@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='95e97e5e' name='planeIdx'/>
      <parameter type-id='4aafb922' name='pixelStride'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getPlaneRowStride' mangled-name='AImage_getPlaneRowStride' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getPlaneRowStride@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='95e97e5e' name='planeIdx'/>
      <parameter type-id='4aafb922' name='pixelStride'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getTimestamp' mangled-name='AImage_getTimestamp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getTimestamp@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='cb785ebf' name='timestampNs'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AImage_getWidth' mangled-name='AImage_getWidth' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImage_getWidth@@LIBMEDIANDK'>
      <parameter type-id='7f390442' name='image'/>
      <parameter type-id='4aafb922' name='width'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecActionCode_isRecoverable' mangled-name='AMediaCodecActionCode_isRecoverable' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecActionCode_isRecoverable@@LIBMEDIANDK'>
      <parameter type-id='3ff5601b' name='actionCode'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaCodecActionCode_isTransient' mangled-name='AMediaCodecActionCode_isTransient' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecActionCode_isTransient@@LIBMEDIANDK'>
      <parameter type-id='3ff5601b' name='actionCode'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_delete' mangled-name='AMediaCodecCryptoInfo_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_delete@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='info'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getClearBytes' mangled-name='AMediaCodecCryptoInfo_getClearBytes' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getClearBytes@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='78c01427' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getEncryptedBytes' mangled-name='AMediaCodecCryptoInfo_getEncryptedBytes' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getEncryptedBytes@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='78c01427' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getIV' mangled-name='AMediaCodecCryptoInfo_getIV' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getIV@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='ae3e8ca6' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getKey' mangled-name='AMediaCodecCryptoInfo_getKey' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getKey@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='ae3e8ca6' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getMode' mangled-name='AMediaCodecCryptoInfo_getMode' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getMode@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <return type-id='cb8ce096'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getNumSubSamples' mangled-name='AMediaCodecCryptoInfo_getNumSubSamples' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getNumSubSamples@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_new' mangled-name='AMediaCodecCryptoInfo_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_new@@LIBMEDIANDK'>
      <parameter type-id='95e97e5e' name='numsubsamples'/>
      <parameter type-id='ae3e8ca6' name='key'/>
      <parameter type-id='ae3e8ca6' name='iv'/>
      <parameter type-id='cb8ce096' name='mode'/>
      <parameter type-id='78c01427' name='clearbytes'/>
      <parameter type-id='78c01427' name='encryptedbytes'/>
      <return type-id='83027323'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_setPattern' mangled-name='AMediaCodecCryptoInfo_setPattern' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_setPattern@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='info'/>
      <parameter type-id='37198c7c' name='pattern'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaCodec_configure' mangled-name='AMediaCodec_configure' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_configure@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='4762cd34' name='format'/>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='c5c780c1' name='crypto'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_createCodecByName' mangled-name='AMediaCodec_createCodecByName' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createCodecByName@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='d6a33e98'/>
    </function-decl>
    <function-decl name='AMediaCodec_createDecoderByType' mangled-name='AMediaCodec_createDecoderByType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createDecoderByType@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='d6a33e98'/>
    </function-decl>
    <function-decl name='AMediaCodec_createEncoderByType' mangled-name='AMediaCodec_createEncoderByType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createEncoderByType@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='d6a33e98'/>
    </function-decl>
    <function-decl name='AMediaCodec_createInputSurface' mangled-name='AMediaCodec_createInputSurface' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createInputSurface@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='a1c8a297' name='surface'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_createPersistentInputSurface' mangled-name='AMediaCodec_createPersistentInputSurface' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createPersistentInputSurface@@LIBMEDIANDK'>
      <parameter type-id='a1c8a297' name='surface'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_delete' mangled-name='AMediaCodec_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_delete@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_dequeueInputBuffer' mangled-name='AMediaCodec_dequeueInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_dequeueInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='9da381c4' name='timeoutUs'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaCodec_dequeueOutputBuffer' mangled-name='AMediaCodec_dequeueOutputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_dequeueOutputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='7e84cc8e' name='info'/>
      <parameter type-id='9da381c4' name='timeoutUs'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaCodec_flush' mangled-name='AMediaCodec_flush' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_flush@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_getBufferFormat' mangled-name='AMediaCodec_getBufferFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getBufferFormat@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='index'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaCodec_getInputBuffer' mangled-name='AMediaCodec_getInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='78c01427' name='out_size'/>
      <return type-id='ae3e8ca6'/>
    </function-decl>
    <function-decl name='AMediaCodec_getInputFormat' mangled-name='AMediaCodec_getInputFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getInputFormat@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaCodec_getName' mangled-name='AMediaCodec_getName' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getName@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='9b23c9ad' name='out_name'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_getOutputBuffer' mangled-name='AMediaCodec_getOutputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getOutputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='78c01427' name='out_size'/>
      <return type-id='ae3e8ca6'/>
    </function-decl>
    <function-decl name='AMediaCodec_getOutputFormat' mangled-name='AMediaCodec_getOutputFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getOutputFormat@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaCodec_queueInputBuffer' mangled-name='AMediaCodec_queueInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_queueInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='ad707ada' name='offset'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='9c313c2d' name='time'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_queueSecureInputBuffer' mangled-name='AMediaCodec_queueSecureInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_queueSecureInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='codec'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='ad707ada' name='offset'/>
      <parameter type-id='83027323' name='crypto'/>
      <parameter type-id='9c313c2d' name='time'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_releaseCrypto' mangled-name='AMediaCodec_releaseCrypto' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_releaseCrypto@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_releaseName' mangled-name='AMediaCodec_releaseName' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_releaseName@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='26a90f95' name='name'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaCodec_releaseOutputBuffer' mangled-name='AMediaCodec_releaseOutputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_releaseOutputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='c894953d' name='render'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_releaseOutputBufferAtTime' mangled-name='AMediaCodec_releaseOutputBufferAtTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_releaseOutputBufferAtTime@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='9da381c4' name='timestampNs'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_setAsyncNotifyCallback' mangled-name='AMediaCodec_setAsyncNotifyCallback' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_setAsyncNotifyCallback@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='75ec1ac2' name='callback'/>
      <parameter type-id='eaa32e2f' name='userdata'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_setInputSurface' mangled-name='AMediaCodec_setInputSurface' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_setInputSurface@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_setOutputSurface' mangled-name='AMediaCodec_setOutputSurface' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_setOutputSurface@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_setParameters' mangled-name='AMediaCodec_setParameters' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_setParameters@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='4762cd34' name='params'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_signalEndOfInputStream' mangled-name='AMediaCodec_signalEndOfInputStream' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_signalEndOfInputStream@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_start' mangled-name='AMediaCodec_start' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_start@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_stop' mangled-name='AMediaCodec_stop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_stop@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCrypto_delete' mangled-name='AMediaCrypto_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_delete@@LIBMEDIANDK'>
      <parameter type-id='c5c780c1' name='crypto'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaCrypto_isCryptoSchemeSupported' mangled-name='AMediaCrypto_isCryptoSchemeSupported' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_isCryptoSchemeSupported@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaCrypto_new' mangled-name='AMediaCrypto_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_new@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <parameter type-id='b59d7dce' name='datasize'/>
      <return type-id='c5c780c1'/>
    </function-decl>
    <function-decl name='AMediaCrypto_requiresSecureDecoderComponent' mangled-name='AMediaCrypto_requiresSecureDecoderComponent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_requiresSecureDecoderComponent@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='mime'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaDataSource_close' mangled-name='AMediaDataSource_close' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_close@@LIBMEDIANDK'>
      <parameter type-id='efa63d55' name='mSource'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDataSource_delete' mangled-name='AMediaDataSource_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_delete@@LIBMEDIANDK'>
      <parameter type-id='efa63d55' name='mSource'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDataSource_new' mangled-name='AMediaDataSource_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_new@@LIBMEDIANDK'>
      <return type-id='efa63d55'/>
    </function-decl>
    <function-decl name='AMediaDataSource_newUri' mangled-name='AMediaDataSource_newUri' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_newUri@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='uri'/>
      <parameter type-id='95e97e5e' name='numheaders'/>
      <parameter type-id='13956559' name='key_values'/>
      <return type-id='efa63d55'/>
    </function-decl>
    <function-decl name='AMediaDataSource_setClose' mangled-name='AMediaDataSource_setClose' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_setClose@@LIBMEDIANDK'>
      <parameter type-id='efa63d55' name='mSource'/>
      <parameter type-id='ff3b42d8' name='close'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDataSource_setGetAvailableSize' mangled-name='AMediaDataSource_setGetAvailableSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_setGetAvailableSize@@LIBMEDIANDK'>
      <parameter type-id='efa63d55' name='mSource'/>
      <parameter type-id='9984480a' name='getAvailableSize'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDataSource_setGetSize' mangled-name='AMediaDataSource_setGetSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_setGetSize@@LIBMEDIANDK'>
      <parameter type-id='efa63d55' name='mSource'/>
      <parameter type-id='171f0f31' name='getSize'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDataSource_setReadAt' mangled-name='AMediaDataSource_setReadAt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_setReadAt@@LIBMEDIANDK'>
      <parameter type-id='efa63d55' name='mSource'/>
      <parameter type-id='f9998ddd' name='readAt'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDataSource_setUserdata' mangled-name='AMediaDataSource_setUserdata' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDataSource_setUserdata@@LIBMEDIANDK'>
      <parameter type-id='efa63d55' name='mSource'/>
      <parameter type-id='eaa32e2f' name='userdata'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDrm_closeSession' mangled-name='AMediaDrm_closeSession' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_closeSession@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_createByUUID' mangled-name='AMediaDrm_createByUUID' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_createByUUID@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <return type-id='3de0002d'/>
    </function-decl>
    <function-decl name='AMediaDrm_decrypt' mangled-name='AMediaDrm_decrypt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_decrypt@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='cipherAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='ae3e8ca6' name='iv'/>
      <parameter type-id='9f7200cf' name='input'/>
      <parameter type-id='ae3e8ca6' name='output'/>
      <parameter type-id='b59d7dce' name='dataSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_encrypt' mangled-name='AMediaDrm_encrypt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_encrypt@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='cipherAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='ae3e8ca6' name='iv'/>
      <parameter type-id='9f7200cf' name='input'/>
      <parameter type-id='ae3e8ca6' name='output'/>
      <parameter type-id='b59d7dce' name='dataSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getKeyRequest' mangled-name='AMediaDrm_getKeyRequest' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getKeyRequest@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='e8ea3838' name='scope'/>
      <parameter type-id='9f7200cf' name='init'/>
      <parameter type-id='b59d7dce' name='initSize'/>
      <parameter type-id='80f4b756' name='mimeType'/>
      <parameter type-id='d269cc45' name='keyType'/>
      <parameter type-id='db1c60d8' name='optionalParameters'/>
      <parameter type-id='b59d7dce' name='numOptionalParameters'/>
      <parameter type-id='e577687f' name='keyRequest'/>
      <parameter type-id='78c01427' name='keyRequestSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getPropertyByteArray' mangled-name='AMediaDrm_getPropertyByteArray' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getPropertyByteArray@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='1154b432' name='propertyValue'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getPropertyString' mangled-name='AMediaDrm_getPropertyString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getPropertyString@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='7d3cd834' name='propertyValue'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getProvisionRequest' mangled-name='AMediaDrm_getProvisionRequest' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getProvisionRequest@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='e577687f' name='provisionRequest'/>
      <parameter type-id='78c01427' name='provisionRequestSize'/>
      <parameter type-id='7d3cd834' name='serverUrl'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getSecureStops' mangled-name='AMediaDrm_getSecureStops' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getSecureStops@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='4f7fa9b6' name='secureStops'/>
      <parameter type-id='78c01427' name='numSecureStops'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_isCryptoSchemeSupported' mangled-name='AMediaDrm_isCryptoSchemeSupported' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_isCryptoSchemeSupported@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <parameter type-id='80f4b756' name='mimeType'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaDrm_openSession' mangled-name='AMediaDrm_openSession' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_openSession@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='3b9154e0' name='sessionId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_provideKeyResponse' mangled-name='AMediaDrm_provideKeyResponse' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_provideKeyResponse@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='e8ea3838' name='scope'/>
      <parameter type-id='9f7200cf' name='response'/>
      <parameter type-id='b59d7dce' name='responseSize'/>
      <parameter type-id='992377e9' name='keySetId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_provideProvisionResponse' mangled-name='AMediaDrm_provideProvisionResponse' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_provideProvisionResponse@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='9f7200cf' name='response'/>
      <parameter type-id='b59d7dce' name='responseSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_queryKeyStatus' mangled-name='AMediaDrm_queryKeyStatus' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_queryKeyStatus@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='e7e0920d' name='keyValuePairs'/>
      <parameter type-id='78c01427' name='numPairs'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_release' mangled-name='AMediaDrm_release' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_release@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDrm_releaseSecureStops' mangled-name='AMediaDrm_releaseSecureStops' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_releaseSecureStops@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='0eef552b' name='ssRelease'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_removeKeys' mangled-name='AMediaDrm_removeKeys' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_removeKeys@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_restoreKeys' mangled-name='AMediaDrm_restoreKeys' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_restoreKeys@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='5acf19a4' name='keySetId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setOnEventListener' mangled-name='AMediaDrm_setOnEventListener' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setOnEventListener@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='5f16d02e' name='listener'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setOnExpirationUpdateListener' mangled-name='AMediaDrm_setOnExpirationUpdateListener' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setOnExpirationUpdateListener@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='22b0d5aa' name='listener'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setOnKeysChangeListener' mangled-name='AMediaDrm_setOnKeysChangeListener' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setOnKeysChangeListener@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='e9ca4612' name='listener'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setPropertyByteArray' mangled-name='AMediaDrm_setPropertyByteArray' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setPropertyByteArray@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='9f7200cf' name='value'/>
      <parameter type-id='b59d7dce' name='valueSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setPropertyString' mangled-name='AMediaDrm_setPropertyString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setPropertyString@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='80f4b756' name='value'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_sign' mangled-name='AMediaDrm_sign' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_sign@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='macAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='ae3e8ca6' name='message'/>
      <parameter type-id='b59d7dce' name='messageSize'/>
      <parameter type-id='ae3e8ca6' name='signature'/>
      <parameter type-id='78c01427' name='signatureSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_verify' mangled-name='AMediaDrm_verify' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_verify@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='macAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='9f7200cf' name='message'/>
      <parameter type-id='b59d7dce' name='messageSize'/>
      <parameter type-id='9f7200cf' name='signature'/>
      <parameter type-id='b59d7dce' name='signatureSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_advance' mangled-name='AMediaExtractor_advance' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_advance@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaExtractor_delete' mangled-name='AMediaExtractor_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_delete@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getCachedDuration' mangled-name='AMediaExtractor_getCachedDuration' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getCachedDuration@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getFileFormat' mangled-name='AMediaExtractor_getFileFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getFileFormat@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getPsshInfo' mangled-name='AMediaExtractor_getPsshInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getPsshInfo@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='ex'/>
      <return type-id='48753e7b'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleCryptoInfo' mangled-name='AMediaExtractor_getSampleCryptoInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleCryptoInfo@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='ex'/>
      <return type-id='83027323'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleFlags' mangled-name='AMediaExtractor_getSampleFlags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleFlags@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleFormat' mangled-name='AMediaExtractor_getSampleFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleFormat@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='ex'/>
      <parameter type-id='29a0c04b' name='fmt'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleSize' mangled-name='AMediaExtractor_getSampleSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleSize@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleTime' mangled-name='AMediaExtractor_getSampleTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleTime@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleTrackIndex' mangled-name='AMediaExtractor_getSampleTrackIndex' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleTrackIndex@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getTrackCount' mangled-name='AMediaExtractor_getTrackCount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getTrackCount@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getTrackFormat' mangled-name='AMediaExtractor_getTrackFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getTrackFormat@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaExtractor_new' mangled-name='AMediaExtractor_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_new@@LIBMEDIANDK'>
      <return type-id='cc75e8f6'/>
    </function-decl>
    <function-decl name='AMediaExtractor_readSampleData' mangled-name='AMediaExtractor_readSampleData' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_readSampleData@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='ae3e8ca6' name='buffer'/>
      <parameter type-id='b59d7dce' name='capacity'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaExtractor_seekTo' mangled-name='AMediaExtractor_seekTo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_seekTo@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='ex'/>
      <parameter type-id='9da381c4' name='seekPosUs'/>
      <parameter type-id='1c26b687' name='mode'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_selectTrack' mangled-name='AMediaExtractor_selectTrack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_selectTrack@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_setDataSource' mangled-name='AMediaExtractor_setDataSource' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_setDataSource@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='80f4b756' name='location'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_setDataSourceCustom' mangled-name='AMediaExtractor_setDataSourceCustom' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_setDataSourceCustom@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='efa63d55' name='src'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_setDataSourceFd' mangled-name='AMediaExtractor_setDataSourceFd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_setDataSourceFd@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='05d4c620' name='offset'/>
      <parameter type-id='05d4c620' name='length'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_unselectTrack' mangled-name='AMediaExtractor_unselectTrack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_unselectTrack@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaFormat_clear' mangled-name='AMediaFormat_clear' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_clear@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_copy' mangled-name='AMediaFormat_copy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_copy@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='to'/>
      <parameter type-id='29a0c04b' name='from'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaFormat_delete' mangled-name='AMediaFormat_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_delete@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaFormat_getBuffer' mangled-name='AMediaFormat_getBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getBuffer@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='63e171df' name='data'/>
      <parameter type-id='78c01427' name='outsize'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getDouble' mangled-name='AMediaFormat_getDouble' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getDouble@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='7408d286' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getFloat' mangled-name='AMediaFormat_getFloat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getFloat@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='361f7a7d' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getInt32' mangled-name='AMediaFormat_getInt32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getInt32@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4aafb922' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getInt64' mangled-name='AMediaFormat_getInt64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getInt64@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='cb785ebf' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getRect' mangled-name='AMediaFormat_getRect' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getRect@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4aafb922' name='left'/>
      <parameter type-id='4aafb922' name='top'/>
      <parameter type-id='4aafb922' name='right'/>
      <parameter type-id='4aafb922' name='bottom'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getSize' mangled-name='AMediaFormat_getSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getSize@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='78c01427' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getString' mangled-name='AMediaFormat_getString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getString@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='mData'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='7d3cd834' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_new' mangled-name='AMediaFormat_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_new@@LIBMEDIANDK'>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaFormat_setBuffer' mangled-name='AMediaFormat_setBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setBuffer@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setDouble' mangled-name='AMediaFormat_setDouble' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setDouble@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='a0eb0f08' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setFloat' mangled-name='AMediaFormat_setFloat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setFloat@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='a6c45d85' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setInt32' mangled-name='AMediaFormat_setInt32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setInt32@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='3ff5601b' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setInt64' mangled-name='AMediaFormat_setInt64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setInt64@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='9da381c4' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setRect' mangled-name='AMediaFormat_setRect' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setRect@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='3ff5601b' name='left'/>
      <parameter type-id='3ff5601b' name='top'/>
      <parameter type-id='3ff5601b' name='right'/>
      <parameter type-id='3ff5601b' name='bottom'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setSize' mangled-name='AMediaFormat_setSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setSize@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='b59d7dce' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setString' mangled-name='AMediaFormat_setString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setString@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_toString' mangled-name='AMediaFormat_toString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_toString@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='mData'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='AMediaMuxer_addTrack' mangled-name='AMediaMuxer_addTrack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_addTrack@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='4762cd34' name='format'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaMuxer_append' mangled-name='AMediaMuxer_append' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_append@@LIBMEDIANDK'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='621ea7ff' name='mode'/>
      <return type-id='373b05c5'/>
    </function-decl>
    <function-decl name='AMediaMuxer_delete' mangled-name='AMediaMuxer_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_delete@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_getTrackCount' mangled-name='AMediaMuxer_getTrackCount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_getTrackCount@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaMuxer_getTrackFormat' mangled-name='AMediaMuxer_getTrackFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_getTrackFormat@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaMuxer_new' mangled-name='AMediaMuxer_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_new@@LIBMEDIANDK'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='3cea8d1e' name='format'/>
      <return type-id='373b05c5'/>
    </function-decl>
    <function-decl name='AMediaMuxer_setLocation' mangled-name='AMediaMuxer_setLocation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_setLocation@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='a6c45d85' name='latitude'/>
      <parameter type-id='a6c45d85' name='longtitude'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_setOrientationHint' mangled-name='AMediaMuxer_setOrientationHint' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_setOrientationHint@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='95e97e5e' name='degrees'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_start' mangled-name='AMediaMuxer_start' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_start@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_stop' mangled-name='AMediaMuxer_stop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_stop@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_writeSampleData' mangled-name='AMediaMuxer_writeSampleData' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_writeSampleData@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='b59d7dce' name='trackIdx'/>
      <parameter type-id='9f7200cf' name='data'/>
      <parameter type-id='73f80ab3' name='info'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-type size-in-bits='32' id='19357910'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='86ce2998'/>
      <parameter type-id='cdc60214'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='1fb355d5'>
      <parameter type-id='3de0002d'/>
      <parameter type-id='92d29827'/>
      <parameter type-id='2c14ef72'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9f7200cf'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2017cf73'>
      <parameter type-id='3de0002d'/>
      <parameter type-id='92d29827'/>
      <parameter type-id='95234477'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='c894953d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='207d6275'>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='354f7eb9'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='24c55490'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='3ff5601b'/>
      <parameter type-id='7e84cc8e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='314e6a09'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='8f92235e'/>
    </function-type>
    <function-type size-in-bits='32' id='4d44d617'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='32' id='6d57b281'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='94cc7d21'>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='9a7a081f'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='05d4c620'/>
      <return type-id='79a0948f'/>
    </function-type>
    <function-type size-in-bits='32' id='ad755a89'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='3ff5601b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='ad881969'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='29a0c04b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c00bdd9f'>
      <parameter type-id='3de0002d'/>
      <parameter type-id='92d29827'/>
      <parameter type-id='9da381c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='ca0a2c8d'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='c085b0c4'/>
      <parameter type-id='3ff5601b'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d36f6217'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='86ce2998'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='dff7b096'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='05d4c620'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-type>
    <function-type size-in-bits='32' id='e381aaec'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='79a0948f'/>
    </function-type>
    <function-type size-in-bits='32' id='f64adb0b'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b8263143'/>
      <return type-id='6e9756f6'/>
    </function-type>
    <function-type size-in-bits='32' id='fbe8b8bf'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9da381c4'/>
      <parameter type-id='9da381c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='7ae24efa' size-in-bits='32' id='04190168'/>
    <pointer-type-def type-id='90d9b053' size-in-bits='32' id='06f87e83'/>
    <pointer-type-def type-id='9c55411c' size-in-bits='32' id='074e9c4a'/>
    <pointer-type-def type-id='c67b5099' size-in-bits='32' id='09f09c51'/>
    <pointer-type-def type-id='6abbfd23' size-in-bits='32' id='0eef552b'/>
    <pointer-type-def type-id='16c807a9' size-in-bits='32' id='0f16bf51'/>
    <pointer-type-def type-id='fe3d4356' size-in-bits='32' id='1058341c'/>
    <pointer-type-def type-id='da59db1a' size-in-bits='32' id='1136a867'/>
    <pointer-type-def type-id='d0a6d3f1' size-in-bits='32' id='1154b432'/>
    <pointer-type-def type-id='b98fecc4' size-in-bits='32' id='1164e682'/>
    <pointer-type-def type-id='2c180b3f' size-in-bits='32' id='1246ff17'/>
    <pointer-type-def type-id='b99c00c9' size-in-bits='32' id='13956559'/>
    <pointer-type-def type-id='5a20c16f' size-in-bits='32' id='15f18b87'/>
    <pointer-type-def type-id='9981a92b' size-in-bits='32' id='163017cb'/>
    <pointer-type-def type-id='e6881728' size-in-bits='32' id='171c354e'/>
    <pointer-type-def type-id='c59f6c00' size-in-bits='32' id='1a1ccc06'/>
    <pointer-type-def type-id='0bd5aa84' size-in-bits='32' id='1b0ba912'/>
    <pointer-type-def type-id='8b0554fc' size-in-bits='32' id='1d6635fa'/>
    <pointer-type-def type-id='24c55490' size-in-bits='32' id='1ec29ba2'/>
    <pointer-type-def type-id='d790effa' size-in-bits='32' id='1f49ca58'/>
    <pointer-type-def type-id='0e20bb94' size-in-bits='32' id='262a6002'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <pointer-type-def type-id='f2842f91' size-in-bits='32' id='285013a2'/>
    <pointer-type-def type-id='7860f206' size-in-bits='32' id='29a0c04b'/>
    <pointer-type-def type-id='cdc60214' size-in-bits='32' id='2cb5879a'/>
    <pointer-type-def type-id='e4d21382' size-in-bits='32' id='2f5283c0'/>
    <pointer-type-def type-id='30d9048a' size-in-bits='32' id='30c178f8'/>
    <pointer-type-def type-id='ad11d894' size-in-bits='32' id='3118331a'/>
    <pointer-type-def type-id='0e12036a' size-in-bits='32' id='33f74d48'/>
    <pointer-type-def type-id='f64adb0b' size-in-bits='32' id='340d2857'/>
    <pointer-type-def type-id='c00bdd9f' size-in-bits='32' id='34117163'/>
    <pointer-type-def type-id='3e411281' size-in-bits='32' id='349bf2f9'/>
    <pointer-type-def type-id='65089ae0' size-in-bits='32' id='34a53a06'/>
    <pointer-type-def type-id='ea86de29' size-in-bits='32' id='354f7eb9'/>
    <pointer-type-def type-id='93f5453e' size-in-bits='32' id='359a6cd4'/>
    <pointer-type-def type-id='b7823502' size-in-bits='32' id='35a5b0b0'/>
    <pointer-type-def type-id='a6c45d85' size-in-bits='32' id='361f7a7d'/>
    <pointer-type-def type-id='e36979af' size-in-bits='32' id='37198c7c'/>
    <pointer-type-def type-id='01f11092' size-in-bits='32' id='373b05c5'/>
    <pointer-type-def type-id='584ccf3d' size-in-bits='32' id='38cd3f9d'/>
    <pointer-type-def type-id='9a7a081f' size-in-bits='32' id='3a0c3aa3'/>
    <pointer-type-def type-id='84004c8f' size-in-bits='32' id='3a368097'/>
    <pointer-type-def type-id='941be827' size-in-bits='32' id='3b9154e0'/>
    <pointer-type-def type-id='fbe8b8bf' size-in-bits='32' id='3bb65f3b'/>
    <pointer-type-def type-id='a464d9b6' size-in-bits='32' id='3de0002d'/>
    <pointer-type-def type-id='207d6275' size-in-bits='32' id='3ea32c19'/>
    <pointer-type-def type-id='715dc94d' size-in-bits='32' id='3f58104d'/>
    <pointer-type-def type-id='fd376fcf' size-in-bits='32' id='40a3d947'/>
    <pointer-type-def type-id='f2a21f67' size-in-bits='32' id='42374637'/>
    <pointer-type-def type-id='4d44d617' size-in-bits='32' id='44f069c3'/>
    <pointer-type-def type-id='47040e56' size-in-bits='32' id='4762cd34'/>
    <pointer-type-def type-id='75dc43de' size-in-bits='32' id='48753e7b'/>
    <pointer-type-def type-id='7ba774a6' size-in-bits='32' id='4a06da1c'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='32' id='4aafb922'/>
    <pointer-type-def type-id='a5af26d7' size-in-bits='32' id='4cbde4df'/>
    <pointer-type-def type-id='ff1f0153' size-in-bits='32' id='4f7fa9b6'/>
    <pointer-type-def type-id='406f4753' size-in-bits='32' id='5a5e1f63'/>
    <pointer-type-def type-id='92241666' size-in-bits='32' id='5acf19a4'/>
    <pointer-type-def type-id='6154d891' size-in-bits='32' id='5d982d79'/>
    <pointer-type-def type-id='6b3899b7' size-in-bits='32' id='5f4ef4af'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <pointer-type-def type-id='d5b8afe1' size-in-bits='32' id='64e46a69'/>
    <pointer-type-def type-id='e9e33a1f' size-in-bits='32' id='68a89e77'/>
    <pointer-type-def type-id='46974d21' size-in-bits='32' id='68fabc69'/>
    <pointer-type-def type-id='2422c4fd' size-in-bits='32' id='6b30f7fd'/>
    <pointer-type-def type-id='dff7b096' size-in-bits='32' id='70e2cf58'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='32' id='7292109c'/>
    <pointer-type-def type-id='ae1a064b' size-in-bits='32' id='73f80ab3'/>
    <pointer-type-def type-id='a0eb0f08' size-in-bits='32' id='7408d286'/>
    <pointer-type-def type-id='bc6f38a0' size-in-bits='32' id='74a200d6'/>
    <pointer-type-def type-id='4b9d3492' size-in-bits='32' id='7613b793'/>
    <pointer-type-def type-id='6d57b281' size-in-bits='32' id='76bff34d'/>
    <pointer-type-def type-id='612358e1' size-in-bits='32' id='779df1e9'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='32' id='78c01427'/>
    <pointer-type-def type-id='42876cb5' size-in-bits='32' id='78e03335'/>
    <pointer-type-def type-id='ec176cd1' size-in-bits='32' id='7cfca439'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='32' id='7d3cd834'/>
    <pointer-type-def type-id='889c0c5b' size-in-bits='32' id='7e84cc8e'/>
    <pointer-type-def type-id='7f64b4d9' size-in-bits='32' id='7e88da89'/>
    <pointer-type-def type-id='7b339381' size-in-bits='32' id='7ee07309'/>
    <pointer-type-def type-id='6edf1bdc' size-in-bits='32' id='7f390442'/>
    <pointer-type-def type-id='efcea311' size-in-bits='32' id='7f64b4d9'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <pointer-type-def type-id='d9946db8' size-in-bits='32' id='83027323'/>
    <pointer-type-def type-id='646db3a7' size-in-bits='32' id='860bddbf'/>
    <pointer-type-def type-id='64f1b8aa' size-in-bits='32' id='86ce2998'/>
    <pointer-type-def type-id='7bcb42ae' size-in-bits='32' id='8c3b9314'/>
    <pointer-type-def type-id='c07cb5cb' size-in-bits='32' id='8d03b16b'/>
    <pointer-type-def type-id='bd474af3' size-in-bits='32' id='90c51dc3'/>
    <pointer-type-def type-id='98799747' size-in-bits='32' id='90d0c4af'/>
    <pointer-type-def type-id='a0b07bb7' size-in-bits='32' id='92d29827'/>
    <pointer-type-def type-id='2941e198' size-in-bits='32' id='93d9663e'/>
    <pointer-type-def type-id='b05cdcb7' size-in-bits='32' id='94829ddf'/>
    <pointer-type-def type-id='060e1027' size-in-bits='32' id='95234477'/>
    <pointer-type-def type-id='4d637dbf' size-in-bits='32' id='96ae8d47'/>
    <pointer-type-def type-id='8e900ba9' size-in-bits='32' id='97b48b31'/>
    <pointer-type-def type-id='c071b10e' size-in-bits='32' id='9874ac24'/>
    <pointer-type-def type-id='314e6a09' size-in-bits='32' id='9886b1f5'/>
    <pointer-type-def type-id='de6480b6' size-in-bits='32' id='992377e9'/>
    <pointer-type-def type-id='085367bf' size-in-bits='32' id='998ffee7'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='32' id='9b23c9ad'/>
    <pointer-type-def type-id='19357910' size-in-bits='32' id='9b6bc6c2'/>
    <pointer-type-def type-id='4d159548' size-in-bits='32' id='9bca647e'/>
    <pointer-type-def type-id='d7feb058' size-in-bits='32' id='9cc6fd8e'/>
    <pointer-type-def type-id='94cc7d21' size-in-bits='32' id='9d86b205'/>
    <pointer-type-def type-id='1019e3ca' size-in-bits='32' id='9e17e3c3'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='32' id='9f7200cf'/>
    <pointer-type-def type-id='6460c12a' size-in-bits='32' id='a1abad78'/>
    <pointer-type-def type-id='96ae8d47' size-in-bits='32' id='a1c8a297'/>
    <pointer-type-def type-id='00070fe6' size-in-bits='32' id='a28bbcbc'/>
    <pointer-type-def type-id='a058ae3c' size-in-bits='32' id='a678eb7a'/>
    <pointer-type-def type-id='f751e8e5' size-in-bits='32' id='a9986e45'/>
    <pointer-type-def type-id='e381aaec' size-in-bits='32' id='adaae416'/>
    <pointer-type-def type-id='75c74f24' size-in-bits='32' id='adab0622'/>
    <pointer-type-def type-id='e9ddea86' size-in-bits='32' id='ae2251ac'/>
    <pointer-type-def type-id='b96825af' size-in-bits='32' id='ae3e8ca6'/>
    <pointer-type-def type-id='1fb355d5' size-in-bits='32' id='b196dfc9'/>
    <pointer-type-def type-id='ad881969' size-in-bits='32' id='b1eb312d'/>
    <pointer-type-def type-id='cc518f2c' size-in-bits='32' id='b6f9962a'/>
    <pointer-type-def type-id='7c0c616e' size-in-bits='32' id='b7022084'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='32' id='b7f9d8e6'/>
    <pointer-type-def type-id='8213f55d' size-in-bits='32' id='b804143d'/>
    <pointer-type-def type-id='05d4c620' size-in-bits='32' id='b8263143'/>
    <pointer-type-def type-id='23c2b794' size-in-bits='32' id='b881c232'/>
    <pointer-type-def type-id='dab61760' size-in-bits='32' id='b8b93b1d'/>
    <pointer-type-def type-id='c95bdf95' size-in-bits='32' id='baa139ad'/>
    <pointer-type-def type-id='dec1fbb2' size-in-bits='32' id='bad27710'/>
    <pointer-type-def type-id='64606595' size-in-bits='32' id='bafcf955'/>
    <pointer-type-def type-id='bb6ea6e5' size-in-bits='32' id='bdee8d35'/>
    <pointer-type-def type-id='8ef9ed91' size-in-bits='32' id='bf1d8849'/>
    <pointer-type-def type-id='5fbf0404' size-in-bits='32' id='bfd7e242'/>
    <pointer-type-def type-id='28ac9f25' size-in-bits='32' id='c0b42655'/>
    <pointer-type-def type-id='07da9dcb' size-in-bits='32' id='c10e4dfb'/>
    <pointer-type-def type-id='9d2f093d' size-in-bits='32' id='c15f802d'/>
    <pointer-type-def type-id='ca0a2c8d' size-in-bits='32' id='c1e11669'/>
    <pointer-type-def type-id='41728969' size-in-bits='32' id='c2c2b841'/>
    <pointer-type-def type-id='2017cf73' size-in-bits='32' id='c325452f'/>
    <pointer-type-def type-id='ad755a89' size-in-bits='32' id='c39b454d'/>
    <pointer-type-def type-id='d36f6217' size-in-bits='32' id='c3d79fcb'/>
    <pointer-type-def type-id='b492b5f4' size-in-bits='32' id='c5c780c1'/>
    <pointer-type-def type-id='fb567094' size-in-bits='32' id='c6d2d6b2'/>
    <pointer-type-def type-id='5e71d2a6' size-in-bits='32' id='caf1984c'/>
    <pointer-type-def type-id='9da381c4' size-in-bits='32' id='cb785ebf'/>
    <pointer-type-def type-id='4ffcdbb7' size-in-bits='32' id='cbdc0a3f'/>
    <pointer-type-def type-id='d9f17f9f' size-in-bits='32' id='cc2c09ef'/>
    <pointer-type-def type-id='1bc40a3f' size-in-bits='32' id='cc75e8f6'/>
    <pointer-type-def type-id='7a58eebd' size-in-bits='32' id='cdc60214'/>
    <pointer-type-def type-id='f1c99104' size-in-bits='32' id='ce4f8b6a'/>
    <pointer-type-def type-id='002ac4a6' size-in-bits='32' id='cf536864'/>
    <pointer-type-def type-id='08de3ccd' size-in-bits='32' id='d288820d'/>
    <pointer-type-def type-id='ae098004' size-in-bits='32' id='d42e47b2'/>
    <pointer-type-def type-id='40cec2e5' size-in-bits='32' id='d6183f40'/>
    <pointer-type-def type-id='8d7f3d19' size-in-bits='32' id='d6a33e98'/>
    <pointer-type-def type-id='ae3e8ca6' size-in-bits='32' id='d8774064'/>
    <pointer-type-def type-id='58d228f7' size-in-bits='32' id='da6a86df'/>
    <pointer-type-def type-id='ef8802e2' size-in-bits='32' id='db1c60d8'/>
    <pointer-type-def type-id='f87395f7' size-in-bits='32' id='dbc1bcef'/>
    <pointer-type-def type-id='04810e42' size-in-bits='32' id='e1a13110'/>
    <pointer-type-def type-id='f783287d' size-in-bits='32' id='e1c103ed'/>
    <pointer-type-def type-id='9f7200cf' size-in-bits='32' id='e577687f'/>
    <pointer-type-def type-id='8da74890' size-in-bits='32' id='e5b6b376'/>
    <pointer-type-def type-id='01ff0772' size-in-bits='32' id='e7e0920d'/>
    <pointer-type-def type-id='86ce2998' size-in-bits='32' id='e88ba336'/>
    <pointer-type-def type-id='86d6f7b9' size-in-bits='32' id='e8a74fc1'/>
    <pointer-type-def type-id='16dee9c2' size-in-bits='32' id='e8ea3838'/>
    <pointer-type-def type-id='69cf5b58' size-in-bits='32' id='e8fe63ee'/>
    <pointer-type-def type-id='fc02f45b' size-in-bits='32' id='e9e3aedb'/>
    <pointer-type-def type-id='b24794a9' size-in-bits='32' id='e9f802d1'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <pointer-type-def type-id='ab4b368f' size-in-bits='32' id='eb96a877'/>
    <pointer-type-def type-id='9f1a73b6' size-in-bits='32' id='edbf172c'/>
    <pointer-type-def type-id='2236983b' size-in-bits='32' id='eed56f2b'/>
    <pointer-type-def type-id='e3e82724' size-in-bits='32' id='efa63d55'/>
    <pointer-type-def type-id='29ae0fd8' size-in-bits='32' id='f4d6afde'/>
    <pointer-type-def type-id='7dd446db' size-in-bits='32' id='f83d180b'/>
    <pointer-type-def type-id='8c89e54b' size-in-bits='32' id='fc340f5b'/>
    <pointer-type-def type-id='2328d49c' size-in-bits='32' id='fd7aecba'/>
    <qualified-type-def type-id='9c55411c' const='yes' id='03a1bbaf'/>
    <qualified-type-def type-id='1e4b646e' const='yes' id='041e3cde'/>
    <qualified-type-def type-id='7b339381' const='yes' id='0474a0a4'/>
    <qualified-type-def type-id='2f5283c0' const='yes' id='05f8e793'/>
    <qualified-type-def type-id='5f3c1b08' const='yes' id='0606da18'/>
    <qualified-type-def type-id='5d06feb7' const='yes' id='060e1027'/>
    <qualified-type-def type-id='61c54ac4' const='yes' id='0807e274'/>
    <qualified-type-def type-id='90d9b053' const='yes' id='100091d6'/>
    <qualified-type-def type-id='58b97fd4' const='yes' id='1571a484'/>
    <qualified-type-def type-id='08de3ccd' const='yes' id='16043df6'/>
    <qualified-type-def type-id='c4d0cb92' const='yes' id='16dee9c2'/>
    <qualified-type-def type-id='2b07a017' const='yes' id='1b0f5007'/>
    <qualified-type-def type-id='e6881728' const='yes' id='1c9857c9'/>
    <qualified-type-def type-id='00f5ef57' const='yes' id='1e3bd547'/>
    <qualified-type-def type-id='fe3d4356' const='yes' id='1f5e66bf'/>
    <qualified-type-def type-id='f0981eeb' const='yes' id='20f5f452'/>
    <qualified-type-def type-id='00070fe6' const='yes' id='288f8fc3'/>
    <qualified-type-def type-id='5908344c' const='yes' id='295c2e3c'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <qualified-type-def type-id='b05cdcb7' const='yes' id='2b7def6e'/>
    <qualified-type-def type-id='fd376fcf' const='yes' id='2e96e5aa'/>
    <qualified-type-def type-id='4ffcdbb7' const='yes' id='3908b1f0'/>
    <qualified-type-def type-id='01cb490c' const='yes' id='3c1ae9bc'/>
    <qualified-type-def type-id='b4109b6f' const='yes' id='3c1d762e'/>
    <qualified-type-def type-id='7860f206' const='yes' id='47040e56'/>
    <qualified-type-def type-id='ff9f3788' const='yes' id='4a6f0418'/>
    <qualified-type-def type-id='65089ae0' const='yes' id='4a865ffb'/>
    <qualified-type-def type-id='b98fecc4' const='yes' id='4b901eeb'/>
    <qualified-type-def type-id='cb49a619' const='yes' id='4eb937a6'/>
    <qualified-type-def type-id='6b3899b7' const='yes' id='56ab9948'/>
    <qualified-type-def type-id='4d159548' const='yes' id='584de2ab'/>
    <qualified-type-def type-id='28ac9f25' const='yes' id='5ce3d078'/>
    <qualified-type-def type-id='c59f6c00' const='yes' id='5e2f2399'/>
    <qualified-type-def type-id='f87395f7' const='yes' id='5faa5468'/>
    <qualified-type-def type-id='c071b10e' const='yes' id='63da15ad'/>
    <qualified-type-def type-id='a5af26d7' const='yes' id='6666899e'/>
    <qualified-type-def type-id='ff1f0153' const='yes' id='6abbfd23'/>
    <qualified-type-def type-id='fffd8fcc' const='yes' id='6edf1bdc'/>
    <qualified-type-def type-id='9f1a73b6' const='yes' id='72d580cf'/>
    <qualified-type-def type-id='bacf3393' const='yes' id='745c9152'/>
    <qualified-type-def type-id='75c74f24' const='yes' id='7cd2b135'/>
    <qualified-type-def type-id='0e20bb94' const='yes' id='8abd7579'/>
    <qualified-type-def type-id='93f5453e' const='yes' id='8c42dfaf'/>
    <qualified-type-def type-id='1b473c64' const='yes' id='8d18a205'/>
    <qualified-type-def type-id='f783287d' const='yes' id='8fb586a6'/>
    <qualified-type-def type-id='07b3d238' const='yes' id='921569c8'/>
    <qualified-type-def type-id='de6480b6' const='yes' id='92241666'/>
    <qualified-type-def type-id='3ff5601b' const='yes' id='922df12b'/>
    <qualified-type-def type-id='25e73793' const='yes' id='94acdc63'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <qualified-type-def type-id='8213f55d' const='yes' id='9e54bf82'/>
    <qualified-type-def type-id='941be827' const='yes' id='a0b07bb7'/>
    <qualified-type-def type-id='fc02f45b' const='yes' id='a2b74f72'/>
    <qualified-type-def type-id='ae098004' const='yes' id='a34554c3'/>
    <qualified-type-def type-id='406f4753' const='yes' id='a3f5ae0e'/>
    <qualified-type-def type-id='8ef9ed91' const='yes' id='a77cd334'/>
    <qualified-type-def type-id='64606595' const='yes' id='a8b69e1e'/>
    <qualified-type-def type-id='84004c8f' const='yes' id='ad11d894'/>
    <qualified-type-def type-id='889c0c5b' const='yes' id='ae1a064b'/>
    <qualified-type-def type-id='24661bb0' const='yes' id='b004d6c0'/>
    <qualified-type-def type-id='29ae0fd8' const='yes' id='b0313d15'/>
    <qualified-type-def type-id='cf536864' const='yes' id='b0327aaf'/>
    <qualified-type-def type-id='80f4b756' const='yes' id='b99c00c9'/>
    <qualified-type-def type-id='04810e42' const='yes' id='bacf7787'/>
    <qualified-type-def type-id='5fbf0404' const='yes' id='bcd6c637'/>
    <qualified-type-def type-id='8c89e54b' const='yes' id='bd8ca3e6'/>
    <qualified-type-def type-id='584ccf3d' const='yes' id='c0532236'/>
    <qualified-type-def type-id='9c313c2d' const='yes' id='c3b7ba7d'/>
    <qualified-type-def type-id='5a20c16f' const='yes' id='c7efac24'/>
    <qualified-type-def type-id='d790effa' const='yes' id='c95bdf95'/>
    <qualified-type-def type-id='2941e198' const='yes' id='cf5e94b1'/>
    <qualified-type-def type-id='46974d21' const='yes' id='cfab143c'/>
    <qualified-type-def type-id='fb567094' const='yes' id='d04a5857'/>
    <qualified-type-def type-id='b59d7dce' const='yes' id='d0fa5dde'/>
    <qualified-type-def type-id='7c0c616e' const='yes' id='d692910f'/>
    <qualified-type-def type-id='0bd5aa84' const='yes' id='d7c11d13'/>
    <qualified-type-def type-id='1f49ca58' const='yes' id='d8d2c1eb'/>
    <qualified-type-def type-id='8da74890' const='yes' id='d9f17f9f'/>
    <qualified-type-def type-id='9d2f093d' const='yes' id='de2f4d68'/>
    <qualified-type-def type-id='27a982e0' const='yes' id='df7bd730'/>
    <qualified-type-def type-id='41728969' const='yes' id='e5c158a4'/>
    <qualified-type-def type-id='0ac886ac' const='yes' id='e6e8d161'/>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
    <qualified-type-def type-id='3e411281' const='yes' id='ec456c68'/>
    <qualified-type-def type-id='085367bf' const='yes' id='ecb69576'/>
    <qualified-type-def type-id='bd474af3' const='yes' id='ef421bd6'/>
    <qualified-type-def type-id='01ff0772' const='yes' id='ef8802e2'/>
    <qualified-type-def type-id='9da381c4' const='yes' id='f07b7694'/>
    <qualified-type-def type-id='ab4b368f' const='yes' id='f1c99104'/>
    <qualified-type-def type-id='7f64b4d9' const='yes' id='f2498bf6'/>
    <qualified-type-def type-id='38858417' const='yes' id='f2a21f67'/>
    <qualified-type-def type-id='d7feb058' const='yes' id='f352e66f'/>
    <qualified-type-def type-id='779df1e9' const='yes' id='fc2e7486'/>
    <reference-type-def kind='lvalue' type-id='5e2f2399' size-in-bits='32' id='033545ad'/>
    <reference-type-def kind='lvalue' type-id='cfab143c' size-in-bits='32' id='0450a4ee'/>
    <reference-type-def kind='lvalue' type-id='cf5e94b1' size-in-bits='32' id='08e3e9b5'/>
    <reference-type-def kind='lvalue' type-id='24661bb0' size-in-bits='32' id='105a94ff'/>
    <reference-type-def kind='lvalue' type-id='de2f4d68' size-in-bits='32' id='1276b1ca'/>
    <reference-type-def kind='lvalue' type-id='d790effa' size-in-bits='32' id='1b49c40c'/>
    <reference-type-def kind='lvalue' type-id='05f8e793' size-in-bits='32' id='1bd4c1ef'/>
    <reference-type-def kind='rvalue' type-id='90d9b053' size-in-bits='32' id='1e4ca953'/>
    <reference-type-def kind='rvalue' type-id='d790effa' size-in-bits='32' id='1f1fce1e'/>
    <reference-type-def kind='rvalue' type-id='41728969' size-in-bits='32' id='1f7def29'/>
    <reference-type-def kind='lvalue' type-id='d8d2c1eb' size-in-bits='32' id='20c715b7'/>
    <reference-type-def kind='lvalue' type-id='100091d6' size-in-bits='32' id='20e5bcd0'/>
    <reference-type-def kind='rvalue' type-id='fb567094' size-in-bits='32' id='21f1a808'/>
    <reference-type-def kind='rvalue' type-id='b05cdcb7' size-in-bits='32' id='22a84077'/>
    <reference-type-def kind='rvalue' type-id='7ba774a6' size-in-bits='32' id='22d31aca'/>
    <reference-type-def kind='lvalue' type-id='bd8ca3e6' size-in-bits='32' id='2465c740'/>
    <reference-type-def kind='lvalue' type-id='ad11d894' size-in-bits='32' id='25182036'/>
    <reference-type-def kind='rvalue' type-id='584ccf3d' size-in-bits='32' id='25fd3e4d'/>
    <reference-type-def kind='rvalue' type-id='a5af26d7' size-in-bits='32' id='27f90577'/>
    <reference-type-def kind='lvalue' type-id='4a865ffb' size-in-bits='32' id='2e88e8e7'/>
    <reference-type-def kind='lvalue' type-id='e5c158a4' size-in-bits='32' id='315e54a6'/>
    <reference-type-def kind='lvalue' type-id='295c2e3c' size-in-bits='32' id='361c92ee'/>
    <reference-type-def kind='lvalue' type-id='3c1ae9bc' size-in-bits='32' id='385dbd6e'/>
    <reference-type-def kind='rvalue' type-id='e6881728' size-in-bits='32' id='395e35ac'/>
    <reference-type-def kind='lvalue' type-id='f2498bf6' size-in-bits='32' id='39c71870'/>
    <reference-type-def kind='lvalue' type-id='ec456c68' size-in-bits='32' id='3f497eca'/>
    <reference-type-def kind='lvalue' type-id='03a1bbaf' size-in-bits='32' id='409a38ab'/>
    <reference-type-def kind='lvalue' type-id='8d18a205' size-in-bits='32' id='40c73d19'/>
    <reference-type-def kind='lvalue' type-id='ea86de29' size-in-bits='32' id='414f919d'/>
    <reference-type-def kind='lvalue' type-id='a3f5ae0e' size-in-bits='32' id='43c128f8'/>
    <reference-type-def kind='rvalue' type-id='8213f55d' size-in-bits='32' id='494e5aed'/>
    <reference-type-def kind='lvalue' type-id='94acdc63' size-in-bits='32' id='511ec09f'/>
    <reference-type-def kind='rvalue' type-id='93f5453e' size-in-bits='32' id='53fb6be2'/>
    <reference-type-def kind='lvalue' type-id='f352e66f' size-in-bits='32' id='548084eb'/>
    <reference-type-def kind='lvalue' type-id='d04a5857' size-in-bits='32' id='560939e3'/>
    <reference-type-def kind='lvalue' type-id='8c42dfaf' size-in-bits='32' id='5645e4ab'/>
    <reference-type-def kind='lvalue' type-id='bcd6c637' size-in-bits='32' id='5719ccc3'/>
    <reference-type-def kind='rvalue' type-id='f87395f7' size-in-bits='32' id='5b0626a7'/>
    <reference-type-def kind='lvalue' type-id='1571a484' size-in-bits='32' id='63e62b06'/>
    <reference-type-def kind='lvalue' type-id='2f5283c0' size-in-bits='32' id='64e5a312'/>
    <reference-type-def kind='lvalue' type-id='406f4753' size-in-bits='32' id='665e3247'/>
    <reference-type-def kind='lvalue' type-id='4a6f0418' size-in-bits='32' id='6ac3ad9a'/>
    <reference-type-def kind='lvalue' type-id='4eb937a6' size-in-bits='32' id='6d925e80'/>
    <reference-type-def kind='lvalue' type-id='041e3cde' size-in-bits='32' id='7399fa68'/>
    <reference-type-def kind='lvalue' type-id='46974d21' size-in-bits='32' id='74facf4d'/>
    <reference-type-def kind='lvalue' type-id='16043df6' size-in-bits='32' id='78ad4e70'/>
    <reference-type-def kind='lvalue' type-id='a2b74f72' size-in-bits='32' id='7a91e13c'/>
    <reference-type-def kind='lvalue' type-id='0474a0a4' size-in-bits='32' id='8598aca6'/>
    <reference-type-def kind='lvalue' type-id='7b339381' size-in-bits='32' id='8ae085ed'/>
    <reference-type-def kind='rvalue' type-id='fc02f45b' size-in-bits='32' id='8e62820b'/>
    <reference-type-def kind='lvalue' type-id='584de2ab' size-in-bits='32' id='8f9ba3f7'/>
    <reference-type-def kind='lvalue' type-id='b0313d15' size-in-bits='32' id='90835749'/>
    <reference-type-def kind='lvalue' type-id='7cd2b135' size-in-bits='32' id='92acc0e9'/>
    <reference-type-def kind='lvalue' type-id='ef421bd6' size-in-bits='32' id='9511fad0'/>
    <reference-type-def kind='rvalue' type-id='b98fecc4' size-in-bits='32' id='95e0f138'/>
    <reference-type-def kind='lvalue' type-id='5ce3d078' size-in-bits='32' id='98a103fa'/>
    <reference-type-def kind='lvalue' type-id='fc2e7486' size-in-bits='32' id='9d2197e0'/>
    <reference-type-def kind='lvalue' type-id='3908b1f0' size-in-bits='32' id='9eaff3e2'/>
    <reference-type-def kind='lvalue' type-id='745c9152' size-in-bits='32' id='a1b8f99c'/>
    <reference-type-def kind='lvalue' type-id='cf536864' size-in-bits='32' id='a24d1fe6'/>
    <reference-type-def kind='lvalue' type-id='07b3d238' size-in-bits='32' id='a8f017e7'/>
    <reference-type-def kind='lvalue' type-id='3c1d762e' size-in-bits='32' id='aa60ce98'/>
    <reference-type-def kind='rvalue' type-id='f783287d' size-in-bits='32' id='adbbacfd'/>
    <reference-type-def kind='lvalue' type-id='c95bdf95' size-in-bits='32' id='aea126c9'/>
    <reference-type-def kind='lvalue' type-id='72d580cf' size-in-bits='32' id='af19eecb'/>
    <reference-type-def kind='rvalue' type-id='3e411281' size-in-bits='32' id='b09d6a21'/>
    <reference-type-def kind='lvalue' type-id='bacf7787' size-in-bits='32' id='b5995273'/>
    <reference-type-def kind='lvalue' type-id='1b0f5007' size-in-bits='32' id='ba1b23f3'/>
    <reference-type-def kind='rvalue' type-id='7c0c616e' size-in-bits='32' id='ba3b49f2'/>
    <reference-type-def kind='lvalue' type-id='8fb586a6' size-in-bits='32' id='bac2bb80'/>
    <reference-type-def kind='lvalue' type-id='0606da18' size-in-bits='32' id='bac98f9a'/>
    <reference-type-def kind='lvalue' type-id='63da15ad' size-in-bits='32' id='bb4fe9d1'/>
    <reference-type-def kind='lvalue' type-id='a77cd334' size-in-bits='32' id='bb804556'/>
    <reference-type-def kind='lvalue' type-id='288f8fc3' size-in-bits='32' id='beff857f'/>
    <reference-type-def kind='lvalue' type-id='1f49ca58' size-in-bits='32' id='bf29c45a'/>
    <reference-type-def kind='lvalue' type-id='2b7def6e' size-in-bits='32' id='bf3fae58'/>
    <reference-type-def kind='lvalue' type-id='c7efac24' size-in-bits='32' id='c04bc726'/>
    <reference-type-def kind='lvalue' type-id='4b901eeb' size-in-bits='32' id='c0e07cb7'/>
    <reference-type-def kind='rvalue' type-id='27a982e0' size-in-bits='32' id='c26d9fd3'/>
    <reference-type-def kind='lvalue' type-id='002ac4a6' size-in-bits='32' id='c3535580'/>
    <reference-type-def kind='lvalue' type-id='28ac9f25' size-in-bits='32' id='c4b42ca1'/>
    <reference-type-def kind='lvalue' type-id='8abd7579' size-in-bits='32' id='c73fc48d'/>
    <reference-type-def kind='lvalue' type-id='e6e8d161' size-in-bits='32' id='c78172c5'/>
    <reference-type-def kind='rvalue' type-id='0e20bb94' size-in-bits='32' id='c8bf35b8'/>
    <reference-type-def kind='rvalue' type-id='8ef9ed91' size-in-bits='32' id='ca9b1251'/>
    <reference-type-def kind='rvalue' type-id='c59f6c00' size-in-bits='32' id='cb72bb24'/>
    <reference-type-def kind='lvalue' type-id='a8b69e1e' size-in-bits='32' id='cf7b1228'/>
    <reference-type-def kind='lvalue' type-id='c0532236' size-in-bits='32' id='d2de9f30'/>
    <reference-type-def kind='rvalue' type-id='29ae0fd8' size-in-bits='32' id='d5ed265c'/>
    <reference-type-def kind='lvalue' type-id='d7c11d13' size-in-bits='32' id='da00fa6f'/>
    <reference-type-def kind='lvalue' type-id='56ab9948' size-in-bits='32' id='de22882a'/>
    <reference-type-def kind='rvalue' type-id='8c89e54b' size-in-bits='32' id='e2ea6b8b'/>
    <reference-type-def kind='lvalue' type-id='9e54bf82' size-in-bits='32' id='e369af2c'/>
    <reference-type-def kind='lvalue' type-id='2e96e5aa' size-in-bits='32' id='e38b5b64'/>
    <reference-type-def kind='rvalue' type-id='4ffcdbb7' size-in-bits='32' id='e46e4057'/>
    <reference-type-def kind='lvalue' type-id='921569c8' size-in-bits='32' id='e5b5c1aa'/>
    <reference-type-def kind='lvalue' type-id='df7bd730' size-in-bits='32' id='e5f397a2'/>
    <reference-type-def kind='rvalue' type-id='04810e42' size-in-bits='32' id='e6ddc396'/>
    <reference-type-def kind='lvalue' type-id='5faa5468' size-in-bits='32' id='e722b6ca'/>
    <reference-type-def kind='lvalue' type-id='b0327aaf' size-in-bits='32' id='e876e5ab'/>
    <reference-type-def kind='lvalue' type-id='a34554c3' size-in-bits='32' id='eb24a47f'/>
    <reference-type-def kind='lvalue' type-id='6666899e' size-in-bits='32' id='eb6acca8'/>
    <reference-type-def kind='rvalue' type-id='9f1a73b6' size-in-bits='32' id='eddb3afa'/>
    <reference-type-def kind='lvalue' type-id='d692910f' size-in-bits='32' id='f1ba838b'/>
    <reference-type-def kind='lvalue' type-id='1c9857c9' size-in-bits='32' id='f2d26d3d'/>
    <reference-type-def kind='lvalue' type-id='ecb69576' size-in-bits='32' id='f36d0cf0'/>
    <reference-type-def kind='rvalue' type-id='9d2f093d' size-in-bits='32' id='f43945bd'/>
    <reference-type-def kind='rvalue' type-id='5fbf0404' size-in-bits='32' id='f4e34078'/>
    <reference-type-def kind='lvalue' type-id='0807e274' size-in-bits='32' id='f6694716'/>
    <reference-type-def kind='lvalue' type-id='1f5e66bf' size-in-bits='32' id='fa9b82db'/>
    <reference-type-def kind='lvalue' type-id='b004d6c0' size-in-bits='32' id='fd9e4c12'/>
    <reference-type-def kind='rvalue' type-id='085367bf' size-in-bits='32' id='fe90be3f'/>
    <reference-type-def kind='rvalue' type-id='5f3c1b08' size-in-bits='32' id='fef2702b'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='32' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='0d77e947'/>
    <type-decl name='void' id='48b5725f'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <typedef-decl name='AHardwareBuffer' type-id='4d45f31e' id='7a58eebd'/>
    <typedef-decl name='AImage' type-id='efcea311' id='fffd8fcc'/>
    <typedef-decl name='AImageCropRect' type-id='7f7a21fd' id='dab61760'/>
    <typedef-decl name='AImageReader' type-id='64f1b8aa' id='38858417'/>
    <typedef-decl name='AImageReader_BufferRemovedCallback' type-id='9b6bc6c2' id='d884d6c9'/>
    <typedef-decl name='AImageReader_BufferRemovedListener' type-id='e412be03' id='1019e3ca'/>
    <typedef-decl name='AImageReader_ImageCallback' type-id='c3d79fcb' id='30cec2c6'/>
    <typedef-decl name='AImageReader_ImageListener' type-id='1aa88244' id='f2842f91'/>
    <typedef-decl name='AMediaCodec' type-id='e582d26a' id='8d7f3d19'/>
    <typedef-decl name='AMediaCodecBufferInfo' type-id='5a377cc8' id='889c0c5b'/>
    <typedef-decl name='AMediaCodecCryptoInfo' type-id='72200e73' id='d9946db8'/>
    <typedef-decl name='AMediaCodecOnAsyncError' type-id='c1e11669' id='ea41e5fe'/>
    <typedef-decl name='AMediaCodecOnAsyncFormatChanged' type-id='b1eb312d' id='1ad4eaa1'/>
    <typedef-decl name='AMediaCodecOnAsyncInputAvailable' type-id='c39b454d' id='7337a56f'/>
    <typedef-decl name='AMediaCodecOnAsyncNotifyCallback' type-id='1ddfa4b7' id='75ec1ac2'/>
    <typedef-decl name='AMediaCodecOnAsyncOutputAvailable' type-id='1ec29ba2' id='15b64de8'/>
    <typedef-decl name='AMediaCodecOnFrameRendered' type-id='3bb65f3b' id='6e7445d0'/>
    <typedef-decl name='AMediaCrypto' type-id='45fc6539' id='b492b5f4'/>
    <typedef-decl name='AMediaDataSource' type-id='622f5dd5' id='e3e82724'/>
    <typedef-decl name='AMediaDataSourceClose' type-id='b7f9d8e6' id='ff3b42d8'/>
    <typedef-decl name='AMediaDataSourceGetAvailableSize' type-id='3a0c3aa3' id='9984480a'/>
    <typedef-decl name='AMediaDataSourceGetSize' type-id='adaae416' id='171f0f31'/>
    <typedef-decl name='AMediaDataSourceReadAt' type-id='70e2cf58' id='f9998ddd'/>
    <typedef-decl name='AMediaDrm' type-id='25082c7d' id='a464d9b6'/>
    <typedef-decl name='AMediaDrmByteArray' type-id='bbb76264' id='d0a6d3f1'/>
    <typedef-decl name='AMediaDrmEventListener' type-id='b196dfc9' id='5f16d02e'/>
    <typedef-decl name='AMediaDrmEventType' type-id='54a1c1c6' id='2c14ef72'/>
    <typedef-decl name='AMediaDrmExpirationUpdateListener' type-id='34117163' id='22b0d5aa'/>
    <typedef-decl name='AMediaDrmKeyId' type-id='d0a6d3f1' id='fd431bd8'/>
    <typedef-decl name='AMediaDrmKeyRequestType' type-id='6005c0f6' id='48294b8a'/>
    <typedef-decl name='AMediaDrmKeySetId' type-id='d0a6d3f1' id='de6480b6'/>
    <typedef-decl name='AMediaDrmKeyStatus' type-id='5a341c9e' id='5d06feb7'/>
    <typedef-decl name='AMediaDrmKeyStatusType' type-id='031917a6' id='e810d7cf'/>
    <typedef-decl name='AMediaDrmKeyType' type-id='18ba2a59' id='d269cc45'/>
    <typedef-decl name='AMediaDrmKeyValue' type-id='2a2999e9' id='01ff0772'/>
    <typedef-decl name='AMediaDrmKeysChangeListener' type-id='c325452f' id='e9ca4612'/>
    <typedef-decl name='AMediaDrmScope' type-id='d0a6d3f1' id='c4d0cb92'/>
    <typedef-decl name='AMediaDrmSecureStop' type-id='d0a6d3f1' id='ff1f0153'/>
    <typedef-decl name='AMediaDrmSessionId' type-id='d0a6d3f1' id='941be827'/>
    <typedef-decl name='AMediaExtractor' type-id='66585c10' id='1bc40a3f'/>
    <typedef-decl name='AMediaFormat' type-id='eb8cac6b' id='7860f206'/>
    <typedef-decl name='AMediaMuxer' type-id='68b7df85' id='01f11092'/>
    <typedef-decl name='AppendMode' type-id='f46baf0b' id='621ea7ff'/>
    <typedef-decl name='OnCodecEvent' type-id='76bff34d' id='927f265f'/>
    <typedef-decl name='OutputFormat' type-id='58cf06da' id='3cea8d1e'/>
    <typedef-decl name='PsshInfo' type-id='567ded7b' id='75dc43de'/>
    <typedef-decl name='SeekMode' type-id='c04b7afb' id='1c26b687'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' id='0c9942d2'/>
    <typedef-decl name='__kernel_loff_t' type-id='1eb56b1e' id='537a730e'/>
    <typedef-decl name='__kernel_long_t' type-id='bd54fe1a' id='6a11bd61'/>
    <typedef-decl name='__kernel_off_t' type-id='6a11bd61' id='8dda407a'/>
    <typedef-decl name='__kernel_ssize_t' type-id='95e97e5e' id='b6b3ebaf'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='0d77e947' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='android_dataspace' type-id='7b0dc681' id='6196fb6a'/>
    <typedef-decl name='android_dataspace_t' type-id='e7ca786d' id='7b0dc681'/>
    <typedef-decl name='cryptoinfo_mode_t' type-id='14011b62' id='cb8ce096'/>
    <typedef-decl name='cryptoinfo_pattern_t' type-id='00bc5b46' id='e36979af'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <typedef-decl name='loff_t' type-id='537a730e' id='69bf7bee'/>
    <typedef-decl name='media_status_t' type-id='d3fca860' id='c085b0c4'/>
    <typedef-decl name='native_handle_t' type-id='3181ea79' id='40cec2e5'/>
    <typedef-decl name='nsecs_t' type-id='9da381c4' id='00f5ef57'/>
    <typedef-decl name='off64_t' type-id='69bf7bee' id='05d4c620'/>
    <typedef-decl name='off_t' type-id='8dda407a' id='ad707ada'/>
    <typedef-decl name='pthread_mutex_t' type-id='92fa54c8' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='ssize_t' type-id='b6b3ebaf' id='79a0948f'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='weakref_type' type-id='114d3ce2' id='4b9d3492'/>
    <var-decl name='AMEDIACODEC_KEY_HDR10_PLUS_INFO' type-id='80f4b756' mangled-name='AMEDIACODEC_KEY_HDR10_PLUS_INFO' visibility='default' elf-symbol-id='AMEDIACODEC_KEY_HDR10_PLUS_INFO@@LIBMEDIANDK'/>
    <var-decl name='AMEDIACODEC_KEY_LOW_LATENCY' type-id='80f4b756' mangled-name='AMEDIACODEC_KEY_LOW_LATENCY' visibility='default' elf-symbol-id='AMEDIACODEC_KEY_LOW_LATENCY@@LIBMEDIANDK'/>
    <var-decl name='AMEDIACODEC_KEY_OFFSET_TIME' type-id='80f4b756' mangled-name='AMEDIACODEC_KEY_OFFSET_TIME' visibility='default' elf-symbol-id='AMEDIACODEC_KEY_OFFSET_TIME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIACODEC_KEY_REQUEST_SYNC_FRAME' type-id='80f4b756' mangled-name='AMEDIACODEC_KEY_REQUEST_SYNC_FRAME' visibility='default' elf-symbol-id='AMEDIACODEC_KEY_REQUEST_SYNC_FRAME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIACODEC_KEY_SUSPEND' type-id='80f4b756' mangled-name='AMEDIACODEC_KEY_SUSPEND' visibility='default' elf-symbol-id='AMEDIACODEC_KEY_SUSPEND@@LIBMEDIANDK'/>
    <var-decl name='AMEDIACODEC_KEY_SUSPEND_TIME' type-id='80f4b756' mangled-name='AMEDIACODEC_KEY_SUSPEND_TIME' visibility='default' elf-symbol-id='AMEDIACODEC_KEY_SUSPEND_TIME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIACODEC_KEY_VIDEO_BITRATE' type-id='80f4b756' mangled-name='AMEDIACODEC_KEY_VIDEO_BITRATE' visibility='default' elf-symbol-id='AMEDIACODEC_KEY_VIDEO_BITRATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_DRC_ATTENUATION_FACTOR' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_DRC_ATTENUATION_FACTOR' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_DRC_ATTENUATION_FACTOR@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_DRC_BOOST_FACTOR' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_DRC_BOOST_FACTOR' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_DRC_BOOST_FACTOR@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_DRC_HEAVY_COMPRESSION' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_DRC_HEAVY_COMPRESSION' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_DRC_HEAVY_COMPRESSION@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_DRC_TARGET_REFERENCE_LEVEL' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_DRC_TARGET_REFERENCE_LEVEL' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_DRC_TARGET_REFERENCE_LEVEL@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_ENCODED_TARGET_LEVEL' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_ENCODED_TARGET_LEVEL' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_ENCODED_TARGET_LEVEL@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_MAX_OUTPUT_CHANNEL_COUNT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_MAX_OUTPUT_CHANNEL_COUNT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_MAX_OUTPUT_CHANNEL_COUNT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_PROFILE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_PROFILE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_PROFILE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_SBR_MODE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_SBR_MODE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_SBR_MODE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ALBUM' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ALBUM' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ALBUM@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ALBUMART' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ALBUMART' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ALBUMART@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ALBUMARTIST' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ALBUMARTIST' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ALBUMARTIST@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ARTIST' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ARTIST' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ARTIST@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AUDIO_PRESENTATION_INFO' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AUDIO_PRESENTATION_INFO' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AUDIO_PRESENTATION_INFO@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AUDIO_SESSION_ID' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AUDIO_SESSION_ID' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AUDIO_SESSION_ID@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_AUTHOR' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AUTHOR' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AUTHOR@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_BITRATE_MODE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_BITRATE_MODE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_BITRATE_MODE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_BITS_PER_SAMPLE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_BITS_PER_SAMPLE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_BITS_PER_SAMPLE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_BIT_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_BIT_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_BIT_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CAPTURE_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CAPTURE_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CAPTURE_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CDTRACKNUMBER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CDTRACKNUMBER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CDTRACKNUMBER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CHANNEL_COUNT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CHANNEL_COUNT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CHANNEL_COUNT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CHANNEL_MASK' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CHANNEL_MASK' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CHANNEL_MASK@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COLOR_FORMAT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COLOR_FORMAT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COLOR_FORMAT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COLOR_RANGE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COLOR_RANGE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COLOR_RANGE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COLOR_STANDARD' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COLOR_STANDARD' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COLOR_STANDARD@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COLOR_TRANSFER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COLOR_TRANSFER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COLOR_TRANSFER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COMPILATION' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COMPILATION' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COMPILATION@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COMPLEXITY' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COMPLEXITY' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COMPLEXITY@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COMPOSER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COMPOSER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COMPOSER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CREATE_INPUT_SURFACE_SUSPENDED' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CREATE_INPUT_SURFACE_SUSPENDED' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CREATE_INPUT_SURFACE_SUSPENDED@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_DEFAULT_IV_SIZE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_DEFAULT_IV_SIZE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_DEFAULT_IV_SIZE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_ENCRYPTED_BYTE_BLOCK' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_ENCRYPTED_BYTE_BLOCK' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_ENCRYPTED_BYTE_BLOCK@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_ENCRYPTED_SIZES' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_ENCRYPTED_SIZES' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_ENCRYPTED_SIZES@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_IV' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_IV' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_IV@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_KEY' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_KEY' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_KEY@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_MODE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_MODE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_MODE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_PLAIN_SIZES' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_PLAIN_SIZES' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_PLAIN_SIZES@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CRYPTO_SKIP_BYTE_BLOCK' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CRYPTO_SKIP_BYTE_BLOCK' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CRYPTO_SKIP_BYTE_BLOCK@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CSD' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CSD' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CSD@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CSD_0' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CSD_0' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CSD_0@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CSD_1' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CSD_1' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CSD_1@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CSD_2' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CSD_2' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CSD_2@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CSD_AVC' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CSD_AVC' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CSD_AVC@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CSD_HEVC' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CSD_HEVC' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CSD_HEVC@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_D263' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_D263' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_D263@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_DATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_DATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_DATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_DISCNUMBER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_DISCNUMBER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_DISCNUMBER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_DISPLAY_CROP' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_DISPLAY_CROP' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_DISPLAY_CROP@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_DISPLAY_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_DISPLAY_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_DISPLAY_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_DISPLAY_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_DISPLAY_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_DISPLAY_WIDTH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_DURATION' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_DURATION' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_DURATION@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ENCODER_DELAY' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ENCODER_DELAY' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ENCODER_DELAY@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ENCODER_PADDING' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ENCODER_PADDING' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ENCODER_PADDING@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ESDS' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ESDS' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ESDS@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_EXIF_OFFSET' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_EXIF_OFFSET' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_EXIF_OFFSET@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_EXIF_SIZE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_EXIF_SIZE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_EXIF_SIZE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_FLAC_COMPRESSION_LEVEL' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_FLAC_COMPRESSION_LEVEL' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_FLAC_COMPRESSION_LEVEL@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_FRAME_COUNT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_FRAME_COUNT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_FRAME_COUNT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_FRAME_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_FRAME_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_FRAME_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_GENRE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_GENRE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_GENRE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_GRID_COLUMNS' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_GRID_COLUMNS' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_GRID_COLUMNS@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_GRID_ROWS' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_GRID_ROWS' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_GRID_ROWS@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_HAPTIC_CHANNEL_COUNT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_HAPTIC_CHANNEL_COUNT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_HAPTIC_CHANNEL_COUNT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_HDR10_PLUS_INFO' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_HDR10_PLUS_INFO' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_HDR10_PLUS_INFO@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_HDR_STATIC_INFO' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_HDR_STATIC_INFO' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_HDR_STATIC_INFO@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ICC_PROFILE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ICC_PROFILE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ICC_PROFILE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_INTRA_REFRESH_PERIOD' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_INTRA_REFRESH_PERIOD' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_INTRA_REFRESH_PERIOD@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_ADTS' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_ADTS' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_ADTS@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_AUTOSELECT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_AUTOSELECT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_AUTOSELECT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_DEFAULT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_DEFAULT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_DEFAULT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_FORCED_SUBTITLE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_FORCED_SUBTITLE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_FORCED_SUBTITLE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_SYNC_FRAME' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_SYNC_FRAME' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_SYNC_FRAME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_I_FRAME_INTERVAL' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_I_FRAME_INTERVAL' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_I_FRAME_INTERVAL@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LANGUAGE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LANGUAGE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LANGUAGE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LAST_SAMPLE_INDEX_IN_CHUNK' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LAST_SAMPLE_INDEX_IN_CHUNK' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LAST_SAMPLE_INDEX_IN_CHUNK@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LATENCY' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LATENCY' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LATENCY@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LEVEL' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LEVEL' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LEVEL@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LOCATION' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LOCATION' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LOCATION@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LOOP' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LOOP' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LOOP@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LOW_LATENCY' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LOW_LATENCY' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LOW_LATENCY@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LYRICIST' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LYRICIST' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LYRICIST@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MANUFACTURER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MANUFACTURER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MANUFACTURER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_BIT_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_BIT_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_BIT_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_FPS_TO_ENCODER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_FPS_TO_ENCODER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_FPS_TO_ENCODER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_INPUT_SIZE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_INPUT_SIZE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_INPUT_SIZE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_PTS_GAP_TO_ENCODER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_PTS_GAP_TO_ENCODER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_PTS_GAP_TO_ENCODER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_WIDTH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MIME' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MIME' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MIME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MPEG2_STREAM_HEADER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MPEG2_STREAM_HEADER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MPEG2_STREAM_HEADER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MPEG_USER_DATA' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MPEG_USER_DATA' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MPEG_USER_DATA@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_OPERATING_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_OPERATING_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_OPERATING_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_PCM_BIG_ENDIAN' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_PCM_BIG_ENDIAN' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_PCM_BIG_ENDIAN@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_PCM_ENCODING' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_PCM_ENCODING' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_PCM_ENCODING@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_PRIORITY' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_PRIORITY' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_PRIORITY@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_PROFILE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_PROFILE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_PROFILE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_PSSH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_PSSH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_PSSH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_PUSH_BLANK_BUFFERS_ON_STOP' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_PUSH_BLANK_BUFFERS_ON_STOP' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_PUSH_BLANK_BUFFERS_ON_STOP@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_REPEAT_PREVIOUS_FRAME_AFTER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_REPEAT_PREVIOUS_FRAME_AFTER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_REPEAT_PREVIOUS_FRAME_AFTER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_ROTATION' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_ROTATION' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_ROTATION@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SAMPLE_FILE_OFFSET' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SAMPLE_FILE_OFFSET' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SAMPLE_FILE_OFFSET@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SAMPLE_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SAMPLE_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SAMPLE_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SAMPLE_TIME_BEFORE_APPEND' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SAMPLE_TIME_BEFORE_APPEND' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SAMPLE_TIME_BEFORE_APPEND@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SAR_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SAR_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SAR_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SAR_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SAR_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SAR_WIDTH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SEI' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SEI' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SEI@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SLICE_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SLICE_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SLICE_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SLOW_MOTION_MARKERS' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SLOW_MOTION_MARKERS' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SLOW_MOTION_MARKERS@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_STRIDE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_STRIDE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_STRIDE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TARGET_TIME' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TARGET_TIME' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TARGET_TIME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TEMPORAL_LAYERING' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TEMPORAL_LAYERING' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TEMPORAL_LAYERING@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_COUNT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_COUNT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_COUNT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_ID' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_ID' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TEMPORAL_LAYER_ID@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TEXT_FORMAT_DATA' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TEXT_FORMAT_DATA' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TEXT_FORMAT_DATA@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_AV1C' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_AV1C' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_AV1C@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_HEVC' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_HEVC' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_THUMBNAIL_CSD_HEVC@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_THUMBNAIL_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_THUMBNAIL_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_THUMBNAIL_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_THUMBNAIL_TIME' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_THUMBNAIL_TIME' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_THUMBNAIL_TIME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_THUMBNAIL_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_THUMBNAIL_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_THUMBNAIL_WIDTH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TILE_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TILE_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TILE_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TILE_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TILE_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TILE_WIDTH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TIME_US' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TIME_US' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TIME_US@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TITLE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TITLE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TITLE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TRACK_ID' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TRACK_ID' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TRACK_ID@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_TRACK_INDEX' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_TRACK_INDEX' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_TRACK_INDEX@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_VALID_SAMPLES' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_VALID_SAMPLES' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_VALID_SAMPLES@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_WIDTH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_XMP_OFFSET' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_XMP_OFFSET' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_XMP_OFFSET@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_XMP_SIZE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_XMP_SIZE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_XMP_SIZE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_YEAR' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_YEAR' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_YEAR@@LIBMEDIANDK'/>
    <namespace-decl name='android'>
      <class-decl name='ABuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='c67b5099'/>
      <class-decl name='AData&lt;int, long long, unsigned int, float, double, android::AMessage::Rect, android::AString, void *, android::sp&lt;android::AMessage&gt;, android::sp&lt;android::ABuffer&gt;, android::sp&lt;android::RefBase&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='fa1964c5'>
        <member-type access='public'>
          <class-decl name='flagger&lt;unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='a6874e6b'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='f0981eeb' id='983ef37e'/>
            </member-type>
            <data-member access='private' static='yes'>
              <var-decl name='count' type-id='20f5f452' visibility='default'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='mask' type-id='20f5f452' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='Strict&lt;unsigned int&gt;' type-id='30d9048a' id='8cb9750b'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='Basic' type-id='8cb9750b' id='69c36994'/>
        </member-type>
        <member-type access='public'>
          <class-decl name='Custom&lt;android::AData&lt;int, long long, unsigned int, float, double, android::AMessage::Rect, android::AString, void *, android::sp&lt;android::AMessage&gt;, android::sp&lt;android::ABuffer&gt;, android::sp&lt;android::RefBase&gt; &gt;::flagger&lt;unsigned int&gt; &gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='30d9048a'>
            <member-function access='public' destructor='yes'>
              <function-decl name='~Custom' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='30c178f8' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='num_types' type-id='d0fa5dde' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='AHandler' size-in-bits='448' is-struct='yes' visibility='default' id='64606595'>
        <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mID' type-id='bd26b9e3' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='mLooper' type-id='4d159548' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='160'>
          <var-decl name='mVerboseStats' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mMessageCounter' type-id='9c313c2d' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='mMessages' type-id='07da9dcb' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='AHandler' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bafcf955' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='AHandler' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bafcf955' is-artificial='yes'/>
            <parameter type-id='cf7b1228'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='ALooper' is-struct='yes' visibility='default' is-declaration-only='yes' id='6460c12a'>
        <member-type access='public'>
          <typedef-decl name='handler_id' type-id='3ff5601b' id='bd26b9e3'/>
        </member-type>
      </class-decl>
      <class-decl name='AMessage' is-struct='yes' visibility='default' is-declaration-only='yes' id='0e12036a'>
        <member-type access='public'>
          <enum-decl name='Type' id='3f4a1601'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='kTypeInt32' value='0'/>
            <enumerator name='kTypeInt64' value='1'/>
            <enumerator name='kTypeSize' value='2'/>
            <enumerator name='kTypeFloat' value='3'/>
            <enumerator name='kTypeDouble' value='4'/>
            <enumerator name='kTypePointer' value='5'/>
            <enumerator name='kTypeString' value='6'/>
            <enumerator name='kTypeObject' value='7'/>
            <enumerator name='kTypeMessage' value='8'/>
            <enumerator name='kTypeRect' value='9'/>
            <enumerator name='kTypeBuffer' value='10'/>
          </enum-decl>
        </member-type>
        <member-type access='public'>
          <class-decl name='Rect' size-in-bits='128' is-struct='yes' visibility='default' id='86c6d40c'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mLeft' type-id='3ff5601b' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='mTop' type-id='3ff5601b' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='mRight' type-id='3ff5601b' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='96'>
              <var-decl name='mBottom' type-id='3ff5601b' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='ItemData' type-id='69c36994' id='685fe30e'/>
        </member-type>
      </class-decl>
      <class-decl name='BufferItem' visibility='default' is-declaration-only='yes' id='612358e1'/>
      <class-decl name='BufferItemConsumer' visibility='default' is-declaration-only='yes' id='2422c4fd'>
        <member-type access='public'>
          <class-decl name='BufferFreedListener' size-in-bits='96' is-struct='yes' visibility='default' id='ce828df7'>
            <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='CompositorTiming' size-in-bits='192' is-struct='yes' visibility='default' id='612fb09b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='deadline' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='interval' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='presentLatency' type-id='00f5ef57' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='ConsumerBase' visibility='default' is-declaration-only='yes' id='55a3d9e9'>
        <member-type access='public'>
          <class-decl name='FrameAvailableListener' size-in-bits='96' is-struct='yes' visibility='default' id='5966fe8d'>
            <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='CpuConsumer' visibility='default' is-declaration-only='yes' id='73537512'>
        <member-type access='public'>
          <class-decl name='LockedBuffer' size-in-bits='768' is-struct='yes' visibility='default' id='e4d21382'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='data' type-id='ae3e8ca6' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='width' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='height' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='96'>
              <var-decl name='format' type-id='2ef73066' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='stride' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='160'>
              <var-decl name='crop' type-id='c071b10e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='288'>
              <var-decl name='transform' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='scalingMode' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='384'>
              <var-decl name='timestamp' type-id='9da381c4' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='448'>
              <var-decl name='dataSpace' type-id='6196fb6a' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='512'>
              <var-decl name='frameNumber' type-id='9c313c2d' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='576'>
              <var-decl name='flexFormat' type-id='2ef73066' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='608'>
              <var-decl name='dataCb' type-id='ae3e8ca6' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='640'>
              <var-decl name='dataCr' type-id='ae3e8ca6' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='672'>
              <var-decl name='chromaStride' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='704'>
              <var-decl name='chromaStep' type-id='8f92235e' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='LockedBuffer' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='2f5283c0' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='DataSource' size-in-bits='128' visibility='default' id='08de3ccd'>
        <base-class access='public' layout-offset-in-bits='0' type-id='65089ae0'/>
        <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mWrapper' type-id='90d0c4af' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='DataSource' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d288820d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='DataSource' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d288820d' is-artificial='yes'/>
            <parameter type-id='78ad4e70'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' destructor='yes' vtable-offset='0'>
          <function-decl name='~DataSource' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d288820d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='DataSourceBase' size-in-bits='32' visibility='default' id='65089ae0'>
        <member-function access='public' constructor='yes'>
          <function-decl name='DataSourceBase' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='34a53a06' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='DataSourceBase' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='34a53a06' is-artificial='yes'/>
            <parameter type-id='2e88e8e7'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' destructor='yes' vtable-offset='0'>
          <function-decl name='~DataSourceBase' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='34a53a06' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Fence' visibility='default' is-declaration-only='yes' id='8e900ba9'>
        <member-function access='public' constructor='yes'>
          <function-decl name='Fence' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='97b48b31' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='FenceTime' visibility='default' is-declaration-only='yes' id='8d83c520'>
        <member-type access='public'>
          <class-decl name='Snapshot' size-in-bits='128' is-struct='yes' visibility='default' id='29ae0fd8'>
            <base-class access='public' layout-offset-in-bits='0' type-id='44637e97'/>
            <member-type access='public'>
              <enum-decl name='State' id='027b799a'>
                <underlying-type type-id='9cac1fee'/>
                <enumerator name='EMPTY' value='0'/>
                <enumerator name='FENCE' value='1'/>
                <enumerator name='SIGNAL_TIME' value='2'/>
              </enum-decl>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='state' type-id='027b799a' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='fence' type-id='f783287d' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='signalTime' type-id='00f5ef57' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='Snapshot' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='f4d6afde' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Snapshot' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='f4d6afde' is-artificial='yes'/>
                <parameter type-id='bac2bb80'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Snapshot' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='f4d6afde' is-artificial='yes'/>
                <parameter type-id='00f5ef57'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Snapshot' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='f4d6afde' is-artificial='yes'/>
                <parameter type-id='d5ed265c'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Snapshot' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='f4d6afde' is-artificial='yes'/>
                <parameter type-id='90835749'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='Flattenable&lt;android::FenceTime::Snapshot&gt;' size-in-bits='8' visibility='default' id='44637e97'/>
      <class-decl name='Flattenable&lt;android::FrameEventHistoryDelta&gt;' size-in-bits='8' visibility='default' id='f7756522'/>
      <class-decl name='Flattenable&lt;android::FrameEventsDelta&gt;' size-in-bits='8' visibility='default' id='4d11ed4b'/>
      <class-decl name='Flattenable&lt;android::IGraphicBufferProducer::QueueBufferInput&gt;' size-in-bits='8' visibility='default' id='674d4afb'/>
      <class-decl name='Flattenable&lt;android::IGraphicBufferProducer::QueueBufferOutput&gt;' size-in-bits='8' visibility='default' id='511b8012'/>
      <class-decl name='FloatRect' size-in-bits='128' visibility='default' id='2941e198'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='left' type-id='a6c45d85' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='top' type-id='a6c45d85' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='right' type-id='a6c45d85' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='bottom' type-id='a6c45d85' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='FloatRect' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='93d9663e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='FloatRect' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='93d9663e' is-artificial='yes'/>
            <parameter type-id='a6c45d85'/>
            <parameter type-id='a6c45d85'/>
            <parameter type-id='a6c45d85'/>
            <parameter type-id='a6c45d85'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='FrameEventDirtyFields' visibility='default' is-declaration-only='yes' id='1b473c64'/>
      <class-decl name='FrameEventHistoryDelta' size-in-bits='320' visibility='default' id='584ccf3d'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f7756522'/>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mDeltas' type-id='085367bf' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='mCompositorTiming' type-id='612fb09b' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='FrameEventHistoryDelta' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='38cd3f9d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='FrameEventHistoryDelta' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='38cd3f9d' is-artificial='yes'/>
            <parameter type-id='25fd3e4d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='FrameEventHistoryDelta' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='38cd3f9d' is-artificial='yes'/>
            <parameter type-id='d2de9f30'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='FrameEvents' size-in-bits='832' is-struct='yes' visibility='default' id='0ac886ac'>
        <data-member access='public' static='yes'>
          <var-decl name='EVENT_COUNT' type-id='d0fa5dde' visibility='default'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TIMESTAMP_PENDING' type-id='1e3bd547' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='valid' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='connectId' type-id='95e97e5e' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='frameNumber' type-id='9c313c2d' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='addPostCompositeCalled' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='136'>
          <var-decl name='addReleaseCalled' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='postedTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='requestedPresentTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='latchTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='firstRefreshStartTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='lastRefreshStartTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='dequeueReadyTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='acquireFence' type-id='9f1a73b6' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='gpuCompositionDoneFence' type-id='9f1a73b6' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='displayPresentFence' type-id='9f1a73b6' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='releaseFence' type-id='9f1a73b6' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='FrameEventsDelta' size-in-bits='960' visibility='default' id='d790effa'>
        <base-class access='public' layout-offset-in-bits='0' type-id='4d11ed4b'/>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mIndex' type-id='b59d7dce' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mFrameNumber' type-id='9c313c2d' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='mAddPostCompositeCalled' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='136'>
          <var-decl name='mAddReleaseCalled' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mPostedTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='mRequestedPresentTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='mLatchTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='mFirstRefreshStartTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='mLastRefreshStartTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <var-decl name='mDequeueReadyTime' type-id='00f5ef57' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='576'>
          <var-decl name='mGpuCompositionDoneFence' type-id='29ae0fd8' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='704'>
          <var-decl name='mDisplayPresentFence' type-id='29ae0fd8' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='832'>
          <var-decl name='mReleaseFence' type-id='29ae0fd8' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='FrameEventsDelta' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1f49ca58' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='FrameEventsDelta' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1f49ca58' is-artificial='yes'/>
            <parameter type-id='b59d7dce'/>
            <parameter type-id='c78172c5'/>
            <parameter type-id='40c73d19'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='FrameEventsDelta' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1f49ca58' is-artificial='yes'/>
            <parameter type-id='1f1fce1e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='FrameEventsDelta' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1f49ca58' is-artificial='yes'/>
            <parameter type-id='aea126c9'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='HdrMetadata' size-in-bits='512' is-struct='yes' visibility='default' id='6164fbd7'>
        <base-class access='public' layout-offset-in-bits='0' type-id='5f1c4286'/>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='validTypes' type-id='8f92235e' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='smpte2086' type-id='ba8bd8c0' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='352'>
          <var-decl name='cta8613' type-id='7520e830' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='hdr10plus' type-id='b05cdcb7' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='ICrypto' is-struct='yes' visibility='default' is-declaration-only='yes' id='7ae24efa'/>
      <class-decl name='IDrm' is-struct='yes' visibility='default' is-declaration-only='yes' id='bc6f38a0'/>
      <class-decl name='IDrmClient' size-in-bits='96' visibility='default' id='5a20c16f'>
        <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
        <member-function access='protected' constructor='yes'>
          <function-decl name='IDrmClient' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='15f18b87' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='IDrmClient' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='15f18b87' is-artificial='yes'/>
            <parameter type-id='c04bc726'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IDrmClient' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='15f18b87' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IGraphicBufferProducer' visibility='default' is-declaration-only='yes' id='b24794a9'>
        <member-type access='public'>
          <class-decl name='QueueBufferInput' size-in-bits='1664' is-struct='yes' visibility='default' id='b7823502'>
            <base-class access='public' layout-offset-in-bits='0' type-id='674d4afb'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='timestamp' type-id='9da381c4' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='isAutoTimestamp' type-id='95e97e5e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='96'>
              <var-decl name='dataSpace' type-id='6196fb6a' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='crop' type-id='c071b10e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='scalingMode' type-id='95e97e5e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='288'>
              <var-decl name='transform' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='stickyTransform' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='352'>
              <var-decl name='fence' type-id='f783287d' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='384'>
              <var-decl name='surfaceDamage' type-id='6cff73f4' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='1056'>
              <var-decl name='getFrameTimestamps' type-id='c894953d' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='1088'>
              <var-decl name='slot' type-id='95e97e5e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='1120'>
              <var-decl name='hdrMetadata' type-id='6164fbd7' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='QueueBufferInput' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='35a5b0b0' is-artificial='yes'/>
                <parameter type-id='6d925e80'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='QueueBufferInput' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='35a5b0b0' is-artificial='yes'/>
                <parameter type-id='9da381c4'/>
                <parameter type-id='c894953d'/>
                <parameter type-id='6196fb6a'/>
                <parameter type-id='bb4fe9d1'/>
                <parameter type-id='95e97e5e'/>
                <parameter type-id='8f92235e'/>
                <parameter type-id='bac2bb80'/>
                <parameter type-id='8f92235e'/>
                <parameter type-id='c894953d'/>
                <parameter type-id='95e97e5e'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='QueueBufferInput' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='35a5b0b0' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <class-decl name='QueueBufferOutput' size-in-bits='640' is-struct='yes' visibility='default' id='a5af26d7'>
            <base-class access='public' layout-offset-in-bits='0' type-id='511b8012'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='width' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='height' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='transformHint' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='96'>
              <var-decl name='numPendingBuffers' type-id='8f92235e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='nextFrameNumber' type-id='9c313c2d' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='frameTimestamps' type-id='584ccf3d' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='512'>
              <var-decl name='bufferReplaced' type-id='c894953d' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='544'>
              <var-decl name='maxBufferCount' type-id='95e97e5e' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='576'>
              <var-decl name='result' type-id='6e9756f6' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='QueueBufferOutput' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='4cbde4df' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='QueueBufferOutput' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='4cbde4df' is-artificial='yes'/>
                <parameter type-id='27f90577'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='QueueBufferOutput' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='4cbde4df' is-artificial='yes'/>
                <parameter type-id='eb6acca8'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <enum-decl name='DisconnectMode' id='1202cff3'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='Api' value='0'/>
            <enumerator name='AllLocal' value='1'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='KeyedVector&lt;android::String8, android::String8&gt;' size-in-bits='160' visibility='default' id='2236983b'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mVector' type-id='0bd5aa84' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='KeyedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed56f2b' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='KeyedVector&lt;unsigned int, unsigned int&gt;' size-in-bits='160' visibility='default' id='07da9dcb'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mVector' type-id='ae098004' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='KeyedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c10e4dfb' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='LightFlattenable&lt;android::HdrMetadata&gt;' size-in-bits='8' visibility='default' id='5f1c4286'/>
      <class-decl name='LightFlattenable&lt;android::Point&gt;' size-in-bits='8' visibility='default' id='0a8cf1b5'/>
      <class-decl name='LightFlattenable&lt;android::Rect&gt;' size-in-bits='8' visibility='default' id='f2086b13'/>
      <class-decl name='LightFlattenablePod&lt;android::Point&gt;' size-in-bits='8' visibility='default' id='fc89bf2e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='0a8cf1b5'/>
      </class-decl>
      <class-decl name='LightFlattenablePod&lt;android::Rect&gt;' size-in-bits='8' visibility='default' id='0222005a'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f2086b13'/>
      </class-decl>
      <class-decl name='List&lt;AImage *&gt;' size-in-bits='64' visibility='default' id='9c55411c'>
        <member-type access='protected'>
          <class-decl name='_Node' size-in-bits='96' visibility='default' id='715dc94d'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mVal' type-id='7f64b4d9' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='32'>
              <var-decl name='mpPrev' type-id='3f58104d' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='64'>
              <var-decl name='mpNext' type-id='3f58104d' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='3f58104d' is-artificial='yes'/>
                <parameter type-id='39c71870'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='3f58104d' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='NON_CONST_ITERATOR&lt;AImage *&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='45a2b9ba'>
            <member-type access='public'>
              <typedef-decl name='NodePtr' type-id='3f58104d' id='4f3c603d'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='Type' type-id='7f64b4d9' id='d1c8d409'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;AImage *, android::List&lt;AImage *&gt;::NON_CONST_ITERATOR&gt;' size-in-bits='32' visibility='default' id='5e71d2a6'>
            <member-type access='private'>
              <typedef-decl name='_Iter' type-id='5e71d2a6' id='ff9f3788'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_NodePtr' type-id='4f3c603d' id='d00eee4c'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_Type' type-id='d1c8d409' id='2f66e716'/>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mpNode' type-id='d00eee4c' visibility='default'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='caf1984c' is-artificial='yes'/>
                <parameter type-id='d00eee4c'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='caf1984c' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='caf1984c' is-artificial='yes'/>
                <parameter type-id='6ac3ad9a'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='caf1984c' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='5e71d2a6' id='1026b0e5'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='89cf8f02' id='f5745325'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;AImage *, android::List&lt;AImage *&gt;::CONST_ITERATOR&gt;' visibility='default' is-declaration-only='yes' id='89cf8f02'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mpMiddle' type-id='3f58104d' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='074e9c4a' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='074e9c4a' is-artificial='yes'/>
            <parameter type-id='409a38ab'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='074e9c4a' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='List&lt;android::BufferItem *&gt;' size-in-bits='64' visibility='default' id='fe3d4356'>
        <member-type access='protected'>
          <class-decl name='_Node' size-in-bits='96' visibility='default' id='e9e33a1f'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mVal' type-id='779df1e9' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='32'>
              <var-decl name='mpPrev' type-id='68a89e77' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='64'>
              <var-decl name='mpNext' type-id='68a89e77' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='68a89e77' is-artificial='yes'/>
                <parameter type-id='9d2197e0'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='68a89e77' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='NON_CONST_ITERATOR&lt;android::BufferItem *&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='cf7a2a32'>
            <member-type access='public'>
              <typedef-decl name='NodePtr' type-id='68a89e77' id='0e5c0ba1'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='Type' type-id='779df1e9' id='7853b4ad'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;android::BufferItem *, android::List&lt;android::BufferItem *&gt;::NON_CONST_ITERATOR&gt;' size-in-bits='32' visibility='default' id='dec1fbb2'>
            <member-type access='private'>
              <typedef-decl name='_Iter' type-id='dec1fbb2' id='1e4b646e'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_NodePtr' type-id='0e5c0ba1' id='0a675f66'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_Type' type-id='7853b4ad' id='bacad398'/>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mpNode' type-id='0a675f66' visibility='default'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='bad27710' is-artificial='yes'/>
                <parameter type-id='0a675f66'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='bad27710' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='bad27710' is-artificial='yes'/>
                <parameter type-id='7399fa68'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='bad27710' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='dec1fbb2' id='c79ebd15'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='403792be' id='a44a1e35'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;android::BufferItem *, android::List&lt;android::BufferItem *&gt;::CONST_ITERATOR&gt;' visibility='default' is-declaration-only='yes' id='403792be'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mpMiddle' type-id='68a89e77' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1058341c' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1058341c' is-artificial='yes'/>
            <parameter type-id='fa9b82db'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1058341c' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='List&lt;android::Vector&lt;unsigned char&gt; &gt;' size-in-bits='64' visibility='default' id='bd474af3'>
        <member-type access='protected'>
          <class-decl name='_Node' size-in-bits='224' visibility='default' id='8da74890'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mVal' type-id='75c74f24' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='160'>
              <var-decl name='mpPrev' type-id='e5b6b376' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='192'>
              <var-decl name='mpNext' type-id='e5b6b376' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='e5b6b376' is-artificial='yes'/>
                <parameter type-id='92acc0e9'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='e5b6b376' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='CONST_ITERATOR&lt;android::Vector&lt;unsigned char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='efcacb5c'>
            <member-type access='public'>
              <typedef-decl name='NodePtr' type-id='cc2c09ef' id='37724b67'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='Type' type-id='7cd2b135' id='0504e4e3'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='NON_CONST_ITERATOR&lt;android::Vector&lt;unsigned char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='b189d1a8'>
            <member-type access='public'>
              <typedef-decl name='NodePtr' type-id='e5b6b376' id='26c12703'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='Type' type-id='75c74f24' id='1e952d0f'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;android::Vector&lt;unsigned char&gt;, android::List&lt;android::Vector&lt;unsigned char&gt; &gt;::CONST_ITERATOR&gt;' size-in-bits='32' visibility='default' id='58d228f7'>
            <member-type access='private'>
              <typedef-decl name='_Iter' type-id='58d228f7' id='25e73793'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_NodePtr' type-id='37724b67' id='233089dd'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_Type' type-id='0504e4e3' id='c5b21be9'/>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mpNode' type-id='233089dd' visibility='default'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <parameter type-id='233089dd'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <parameter type-id='511ec09f'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;android::Vector&lt;unsigned char&gt;, android::List&lt;android::Vector&lt;unsigned char&gt; &gt;::NON_CONST_ITERATOR&gt;' size-in-bits='32' visibility='default' id='9981a92b'>
            <member-type access='private'>
              <typedef-decl name='_Iter' type-id='9981a92b' id='2b07a017'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_NodePtr' type-id='26c12703' id='72300c71'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_Type' type-id='1e952d0f' id='2272fe9d'/>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mpNode' type-id='72300c71' visibility='default'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <parameter type-id='72300c71'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <parameter type-id='ba1b23f3'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='9981a92b' id='a659b810'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='58d228f7' id='942a6ae0'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mpMiddle' type-id='e5b6b376' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='90c51dc3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='90c51dc3' is-artificial='yes'/>
            <parameter type-id='9511fad0'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='90c51dc3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='MediaCodec' is-struct='yes' visibility='default' is-declaration-only='yes' id='e9ddea86'/>
      <class-decl name='MediaMuxerBase' is-struct='yes' visibility='default' is-declaration-only='yes' id='cc518f2c'>
        <member-type access='public'>
          <enum-decl name='OutputFormat' id='c7b6f6c1'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='OUTPUT_FORMAT_MPEG_4' value='0'/>
            <enumerator name='OUTPUT_FORMAT_WEBM' value='1'/>
            <enumerator name='OUTPUT_FORMAT_THREE_GPP' value='2'/>
            <enumerator name='OUTPUT_FORMAT_HEIF' value='3'/>
            <enumerator name='OUTPUT_FORMAT_OGG' value='4'/>
            <enumerator name='OUTPUT_FORMAT_LIST_END' value='5'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='Mutex' size-in-bits='32' visibility='default' id='406f4753'>
        <member-type access='public'>
          <class-decl name='Autolock' size-in-bits='32' visibility='default' id='fd376fcf'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mLock' type-id='665e3247' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='665e3247'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='5a5e1f63'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='e38b5b64'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mMutex' type-id='7a6844eb' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='43c128f8'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='NuMediaExtractor' is-struct='yes' visibility='default' is-declaration-only='yes' id='42876cb5'/>
      <class-decl name='Parcel' visibility='default' is-declaration-only='yes' id='cb49a619'/>
      <class-decl name='Point' size-in-bits='64' visibility='default' id='00070fe6'>
        <base-class access='public' layout-offset-in-bits='0' type-id='fc89bf2e'/>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='x' type-id='95e97e5e' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='y' type-id='95e97e5e' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='Point' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a28bbcbc' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Point' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a28bbcbc' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Rect' size-in-bits='128' visibility='default' id='c071b10e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='c9ee9172'/>
        <base-class access='public' layout-offset-in-bits='0' type-id='0222005a'/>
        <data-member access='public' static='yes'>
          <var-decl name='INVALID_RECT' type-id='63da15ad' visibility='default'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='EMPTY_RECT' type-id='63da15ad' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='Rect' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9874ac24' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Rect' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9874ac24' is-artificial='yes'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='3ff5601b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Rect' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9874ac24' is-artificial='yes'/>
            <parameter type-id='beff857f'/>
            <parameter type-id='beff857f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Rect' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9874ac24' is-artificial='yes'/>
            <parameter type-id='08e3e9b5'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Rect' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9874ac24' is-artificial='yes'/>
            <parameter type-id='de22882a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='RefBase' visibility='default' is-declaration-only='yes' id='12f619c0'>
        <member-type access='public'>
          <class-decl name='weakref_type' size-in-bits='8' visibility='default' id='114d3ce2'/>
        </member-type>
      </class-decl>
      <class-decl name='Region' visibility='default' is-declaration-only='yes' id='6cff73f4'/>
      <class-decl name='SortedVector&lt;android::key_value_pair_t&lt;android::String8, android::String8&gt; &gt;' size-in-bits='160' visibility='default' id='0bd5aa84'>
        <base-class access='private' layout-offset-in-bits='0' type-id='77b46eb8'/>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='3a368097' id='313d8bc9'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='3118331a' id='2b62b929'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1b0ba912' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1b0ba912' is-artificial='yes'/>
            <parameter type-id='da00fa6f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1b0ba912' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='SortedVector&lt;android::key_value_pair_t&lt;unsigned int, unsigned int&gt; &gt;' size-in-bits='160' visibility='default' id='ae098004'>
        <base-class access='private' layout-offset-in-bits='0' type-id='77b46eb8'/>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='eb96a877' id='b47e14f9'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='ce4f8b6a' id='19b23fb9'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d42e47b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d42e47b2' is-artificial='yes'/>
            <parameter type-id='eb24a47f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d42e47b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='SortedVector&lt;unsigned char&gt;' visibility='default' is-declaration-only='yes' id='b4109b6f'/>
      <class-decl name='SortedVectorImpl' visibility='default' is-declaration-only='yes' id='77b46eb8'/>
      <class-decl name='String8' visibility='default' is-declaration-only='yes' id='bacf3393'/>
      <class-decl name='Surface' visibility='default' is-declaration-only='yes' id='7dd446db'/>
      <class-decl name='Vector&lt;unsigned char&gt;' size-in-bits='160' visibility='default' id='75c74f24'>
        <base-class access='private' layout-offset-in-bits='0' type-id='86634f01'/>
        <member-type access='private'>
          <typedef-decl name='compar_t' type-id='3ea32c19' id='1710ada2'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='compar_r_t' type-id='9d86b205' id='bd0e6a6b'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='cf536864' id='e03617ff'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='354f7eb9' id='0e8867db'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <parameter type-id='92acc0e9'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <parameter type-id='aa60ce98'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='VectorImpl' visibility='default' is-declaration-only='yes' id='86634f01'>
        <member-type access='private'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca1b'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='HAS_TRIVIAL_CTOR' value='1'/>
            <enumerator name='HAS_TRIVIAL_DTOR' value='2'/>
            <enumerator name='HAS_TRIVIAL_COPY' value='4'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='key_value_pair_t&lt;android::String8, android::String8&gt;' size-in-bits='64' is-struct='yes' visibility='default' id='84004c8f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='key' type-id='bacf3393' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='value' type-id='bacf3393' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <parameter type-id='25182036'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <parameter type-id='a1b8f99c'/>
            <parameter type-id='a1b8f99c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <parameter type-id='a1b8f99c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='key_value_pair_t&lt;unsigned int, unsigned int&gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='ab4b368f'/>
      <class-decl name='sp&lt;AImageReader::BufferRemovedListener&gt;' size-in-bits='32' visibility='default' id='7c0c616e'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='1d6635fa' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b7022084' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b7022084' is-artificial='yes'/>
            <parameter type-id='1d6635fa'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b7022084' is-artificial='yes'/>
            <parameter type-id='f1ba838b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b7022084' is-artificial='yes'/>
            <parameter type-id='ba3b49f2'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b7022084' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;AImageReader::CallbackHandler&gt;' size-in-bits='32' visibility='default' id='90d9b053'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='860bddbf' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='06f87e83' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='06f87e83' is-artificial='yes'/>
            <parameter type-id='860bddbf'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='06f87e83' is-artificial='yes'/>
            <parameter type-id='20e5bcd0'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='06f87e83' is-artificial='yes'/>
            <parameter type-id='1e4ca953'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='06f87e83' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;AImageReader::FrameListener&gt;' size-in-bits='32' visibility='default' id='8c89e54b'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='1246ff17' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='fc340f5b' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='fc340f5b' is-artificial='yes'/>
            <parameter type-id='1246ff17'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='fc340f5b' is-artificial='yes'/>
            <parameter type-id='2465c740'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='fc340f5b' is-artificial='yes'/>
            <parameter type-id='e2ea6b8b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='fc340f5b' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;AImageReader&gt;' size-in-bits='32' visibility='default' id='b98fecc4'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='86ce2998' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1164e682' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1164e682' is-artificial='yes'/>
            <parameter type-id='86ce2998'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1164e682' is-artificial='yes'/>
            <parameter type-id='c0e07cb7'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1164e682' is-artificial='yes'/>
            <parameter type-id='95e0f138'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1164e682' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;ANativeWindow&gt;' size-in-bits='32' visibility='default' id='fc02f45b'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='96ae8d47' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e9e3aedb' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e9e3aedb' is-artificial='yes'/>
            <parameter type-id='96ae8d47'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e9e3aedb' is-artificial='yes'/>
            <parameter type-id='7a91e13c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e9e3aedb' is-artificial='yes'/>
            <parameter type-id='8e62820b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e9e3aedb' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;CodecHandler&gt;' size-in-bits='32' visibility='default' id='4ffcdbb7'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='8d03b16b' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <parameter type-id='8d03b16b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <parameter type-id='9eaff3e2'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <parameter type-id='e46e4057'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;DrmListener&gt;' size-in-bits='32' visibility='default' id='e6881728'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='8c3b9314' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <parameter type-id='8c3b9314'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <parameter type-id='f2d26d3d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <parameter type-id='395e35ac'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::ABuffer&gt;' size-in-bits='32' visibility='default' id='8213f55d'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='09f09c51' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <parameter type-id='09f09c51'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <parameter type-id='e369af2c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <parameter type-id='494e5aed'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::ALooper&gt;' size-in-bits='32' visibility='default' id='5fbf0404'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='a1abad78' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <parameter type-id='a1abad78'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <parameter type-id='5719ccc3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <parameter type-id='f4e34078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::AMessage&gt;' size-in-bits='32' visibility='default' id='0e20bb94'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='33f74d48' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <parameter type-id='33f74d48'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <parameter type-id='c73fc48d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <parameter type-id='c8bf35b8'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::BufferItemConsumer&gt;' size-in-bits='32' visibility='default' id='8ef9ed91'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='6b30f7fd' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bf1d8849' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bf1d8849' is-artificial='yes'/>
            <parameter type-id='6b30f7fd'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bf1d8849' is-artificial='yes'/>
            <parameter type-id='bb804556'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bf1d8849' is-artificial='yes'/>
            <parameter type-id='ca9b1251'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bf1d8849' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::DataSource&gt;' size-in-bits='32' visibility='default' id='3e411281'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='d288820d' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='349bf2f9' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='349bf2f9' is-artificial='yes'/>
            <parameter type-id='d288820d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='349bf2f9' is-artificial='yes'/>
            <parameter type-id='3f497eca'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='349bf2f9' is-artificial='yes'/>
            <parameter type-id='b09d6a21'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='349bf2f9' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp&lt;NdkDataSource&gt;' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='349bf2f9' is-artificial='yes'/>
            <parameter type-id='e8a74fc1'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::Fence&gt;' size-in-bits='32' visibility='default' id='f783287d'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='97b48b31' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c103ed' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c103ed' is-artificial='yes'/>
            <parameter type-id='97b48b31'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c103ed' is-artificial='yes'/>
            <parameter type-id='bac2bb80'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c103ed' is-artificial='yes'/>
            <parameter type-id='adbbacfd'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c103ed' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::ICrypto&gt;' size-in-bits='32' visibility='default' id='fb567094'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='04190168' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <parameter type-id='04190168'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <parameter type-id='560939e3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <parameter type-id='21f1a808'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IDrm&gt;' size-in-bits='32' visibility='default' id='04810e42'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='74a200d6' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <parameter type-id='74a200d6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <parameter type-id='b5995273'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <parameter type-id='e6ddc396'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IGraphicBufferProducer&gt;' size-in-bits='32' visibility='default' id='9d2f093d'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='e9f802d1' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c15f802d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c15f802d' is-artificial='yes'/>
            <parameter type-id='e9f802d1'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c15f802d' is-artificial='yes'/>
            <parameter type-id='1276b1ca'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c15f802d' is-artificial='yes'/>
            <parameter type-id='f43945bd'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c15f802d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::MediaCodec&gt;' size-in-bits='32' visibility='default' id='c59f6c00'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='ae2251ac' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <parameter type-id='ae2251ac'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <parameter type-id='033545ad'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <parameter type-id='cb72bb24'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::MediaMuxerBase&gt;' size-in-bits='32' visibility='default' id='93f5453e'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='b6f9962a' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <parameter type-id='b6f9962a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <parameter type-id='5645e4ab'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <parameter type-id='53fb6be2'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::NuMediaExtractor&gt;' size-in-bits='32' visibility='default' id='41728969'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='78e03335' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <parameter type-id='78e03335'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <parameter type-id='315e54a6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <parameter type-id='1f7def29'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::Surface&gt;' size-in-bits='32' visibility='default' id='f87395f7'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='f83d180b' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='dbc1bcef' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='dbc1bcef' is-artificial='yes'/>
            <parameter type-id='f83d180b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='dbc1bcef' is-artificial='yes'/>
            <parameter type-id='e722b6ca'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='dbc1bcef' is-artificial='yes'/>
            <parameter type-id='5b0626a7'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='dbc1bcef' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='wp&lt;AImageReader&gt;' size-in-bits='64' visibility='default' id='d7feb058'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='86ce2998' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='m_refs' type-id='7613b793' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cc6fd8e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cc6fd8e' is-artificial='yes'/>
            <parameter type-id='86ce2998'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cc6fd8e' is-artificial='yes'/>
            <parameter type-id='548084eb'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cc6fd8e' is-artificial='yes'/>
            <parameter type-id='c0e07cb7'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~wp' visibility='default' binding='global' size-in-bits='32'>
