<abi-corpus version='2.1' architecture='elf-arm' soname='libvulkan.so'>
  <elf-needed>
    <dependency name='android.hardware.configstore@1.0.so'/>
    <dependency name='android.hardware.configstore-utils.so'/>
    <dependency name='libziparchive.so'/>
    <dependency name='libhardware.so'/>
    <dependency name='libsync.so'/>
    <dependency name='libbase.so'/>
    <dependency name='libhidlbase.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libui.so'/>
    <dependency name='libgraphicsenv.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libz.so'/>
    <dependency name='libnativebridge_lazy.so'/>
    <dependency name='libnativeloader_lazy.so'/>
    <dependency name='libnativewindow.so'/>
    <dependency name='libvndksupport.so'/>
    <dependency name='android.hardware.graphics.common@1.0.so'/>
    <dependency name='libSurfaceFlingerProp.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='vkAcquireNextImage2KHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkAcquireNextImageKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='vkGetPhysicalDeviceMemoryProperties' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceMemoryProperties2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDevicePresentRectanglesKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceProperties' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceProperties2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceQueueFamilyProperties' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceQueueFamilyProperties2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceSparseImageFormatProperties' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceSparseImageFormatProperties2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceSurfaceCapabilitiesKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceSurfaceFormatsKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceSurfacePresentModesKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPhysicalDeviceSurfaceSupportKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetPipelineCacheData' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetQueryPoolResults' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetRenderAreaGranularity' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetSemaphoreCounterValue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkGetSwapchainImagesKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkInvalidateMappedMemoryRanges' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkMapMemory' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkMergePipelineCaches' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkQueueBindSparse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkQueuePresentKHR' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkQueueSubmit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkQueueWaitIdle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkResetCommandBuffer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkResetCommandPool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkResetDescriptorPool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkResetEvent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkResetFences' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkResetQueryPool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkSetEvent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkSignalSemaphore' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkTrimCommandPool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkUnmapMemory' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkUpdateDescriptorSetWithTemplate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkUpdateDescriptorSets' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkWaitForFences' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vkWaitSemaphores' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <typedef-decl name='VkDescriptorUpdateTemplate' type-id='9c313c2d' id='004b9055'/>
    <typedef-decl name='VkBufferViewCreateFlags' type-id='c1850196' id='00cef61f'/>
    <class-decl name='VkDescriptorSetLayoutBinding' size-in-bits='160' is-struct='yes' visibility='default' id='00eb5c74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='binding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='descriptorType' type-id='3e0c9bce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='descriptorCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='stageFlags' type-id='a910dd47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pImmutableSamplers' type-id='24a81455' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='4c672ee0' size-in-bits='32' id='00f17e4d'/>
    <class-decl name='VkPresentInfoKHR' size-in-bits='256' is-struct='yes' visibility='default' id='0150b0a8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='waitSemaphoreCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pWaitSemaphores' type-id='26e3b8e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='swapchainCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pSwapchains' type-id='93fe5f5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pImageIndices' type-id='a6798dcc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pResults' type-id='95eab37f' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='737efec4' const='yes' id='01899f94'/>
    <enum-decl name='VkSubpassContents' id='01aeb2b8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_SUBPASS_CONTENTS_INLINE' value='0'/>
      <enumerator name='VK_SUBPASS_CONTENTS_SECONDARY_COMMAND_BUFFERS' value='1'/>
      <enumerator name='VK_SUBPASS_CONTENTS_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='bde2453e' size-in-bits='32' id='03b6ea3b'/>
    <typedef-decl name='VkViewport' type-id='d96672c8' id='0409a5a5'/>
    <class-decl name='VkSpecializationInfo' size-in-bits='128' is-struct='yes' visibility='default' id='04aa29f7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mapEntryCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pMapEntries' type-id='870f94fa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dataSize' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='bf2de83a' size-in-bits='32' id='05445130'/>
    <qualified-type-def type-id='5d2f3f28' const='yes' id='05d40e38'/>
    <typedef-decl name='VkBufferMemoryRequirementsInfo2' type-id='26f1211b' id='05d736ec'/>
    <pointer-type-def type-id='c7244883' size-in-bits='32' id='05deffe6'/>
    <typedef-decl name='VkQueryResultFlags' type-id='c1850196' id='06711a37'/>
    <enum-decl name='VkBlendOp' id='06bac29d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_BLEND_OP_ADD' value='0'/>
      <enumerator name='VK_BLEND_OP_SUBTRACT' value='1'/>
      <enumerator name='VK_BLEND_OP_REVERSE_SUBTRACT' value='2'/>
      <enumerator name='VK_BLEND_OP_MIN' value='3'/>
      <enumerator name='VK_BLEND_OP_MAX' value='4'/>
      <enumerator name='VK_BLEND_OP_ZERO_EXT' value='1000148000'/>
      <enumerator name='VK_BLEND_OP_SRC_EXT' value='1000148001'/>
      <enumerator name='VK_BLEND_OP_DST_EXT' value='1000148002'/>
      <enumerator name='VK_BLEND_OP_SRC_OVER_EXT' value='1000148003'/>
      <enumerator name='VK_BLEND_OP_DST_OVER_EXT' value='1000148004'/>
      <enumerator name='VK_BLEND_OP_SRC_IN_EXT' value='1000148005'/>
      <enumerator name='VK_BLEND_OP_DST_IN_EXT' value='1000148006'/>
      <enumerator name='VK_BLEND_OP_SRC_OUT_EXT' value='1000148007'/>
      <enumerator name='VK_BLEND_OP_DST_OUT_EXT' value='1000148008'/>
      <enumerator name='VK_BLEND_OP_SRC_ATOP_EXT' value='1000148009'/>
      <enumerator name='VK_BLEND_OP_DST_ATOP_EXT' value='1000148010'/>
      <enumerator name='VK_BLEND_OP_XOR_EXT' value='1000148011'/>
      <enumerator name='VK_BLEND_OP_MULTIPLY_EXT' value='1000148012'/>
      <enumerator name='VK_BLEND_OP_SCREEN_EXT' value='1000148013'/>
      <enumerator name='VK_BLEND_OP_OVERLAY_EXT' value='1000148014'/>
      <enumerator name='VK_BLEND_OP_DARKEN_EXT' value='1000148015'/>
      <enumerator name='VK_BLEND_OP_LIGHTEN_EXT' value='1000148016'/>
      <enumerator name='VK_BLEND_OP_COLORDODGE_EXT' value='1000148017'/>
      <enumerator name='VK_BLEND_OP_COLORBURN_EXT' value='1000148018'/>
      <enumerator name='VK_BLEND_OP_HARDLIGHT_EXT' value='1000148019'/>
      <enumerator name='VK_BLEND_OP_SOFTLIGHT_EXT' value='1000148020'/>
      <enumerator name='VK_BLEND_OP_DIFFERENCE_EXT' value='1000148021'/>
      <enumerator name='VK_BLEND_OP_EXCLUSION_EXT' value='1000148022'/>
      <enumerator name='VK_BLEND_OP_INVERT_EXT' value='1000148023'/>
      <enumerator name='VK_BLEND_OP_INVERT_RGB_EXT' value='1000148024'/>
      <enumerator name='VK_BLEND_OP_LINEARDODGE_EXT' value='1000148025'/>
      <enumerator name='VK_BLEND_OP_LINEARBURN_EXT' value='1000148026'/>
      <enumerator name='VK_BLEND_OP_VIVIDLIGHT_EXT' value='1000148027'/>
      <enumerator name='VK_BLEND_OP_LINEARLIGHT_EXT' value='1000148028'/>
      <enumerator name='VK_BLEND_OP_PINLIGHT_EXT' value='1000148029'/>
      <enumerator name='VK_BLEND_OP_HARDMIX_EXT' value='1000148030'/>
      <enumerator name='VK_BLEND_OP_HSL_HUE_EXT' value='1000148031'/>
      <enumerator name='VK_BLEND_OP_HSL_SATURATION_EXT' value='1000148032'/>
      <enumerator name='VK_BLEND_OP_HSL_COLOR_EXT' value='1000148033'/>
      <enumerator name='VK_BLEND_OP_HSL_LUMINOSITY_EXT' value='1000148034'/>
      <enumerator name='VK_BLEND_OP_PLUS_EXT' value='1000148035'/>
      <enumerator name='VK_BLEND_OP_PLUS_CLAMPED_EXT' value='1000148036'/>
      <enumerator name='VK_BLEND_OP_PLUS_CLAMPED_ALPHA_EXT' value='1000148037'/>
      <enumerator name='VK_BLEND_OP_PLUS_DARKER_EXT' value='1000148038'/>
      <enumerator name='VK_BLEND_OP_MINUS_EXT' value='1000148039'/>
      <enumerator name='VK_BLEND_OP_MINUS_CLAMPED_EXT' value='1000148040'/>
      <enumerator name='VK_BLEND_OP_CONTRAST_EXT' value='1000148041'/>
      <enumerator name='VK_BLEND_OP_INVERT_OVG_EXT' value='1000148042'/>
      <enumerator name='VK_BLEND_OP_RED_EXT' value='1000148043'/>
      <enumerator name='VK_BLEND_OP_GREEN_EXT' value='1000148044'/>
      <enumerator name='VK_BLEND_OP_BLUE_EXT' value='1000148045'/>
      <enumerator name='VK_BLEND_OP_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <enum-decl name='VkIndexType' id='06fa6189'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_INDEX_TYPE_UINT16' value='0'/>
      <enumerator name='VK_INDEX_TYPE_UINT32' value='1'/>
      <enumerator name='VK_INDEX_TYPE_NONE_KHR' value='1000165000'/>
      <enumerator name='VK_INDEX_TYPE_UINT8_EXT' value='1000265000'/>
      <enumerator name='VK_INDEX_TYPE_NONE_NV' value='1000165000'/>
      <enumerator name='VK_INDEX_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <qualified-type-def type-id='979402cb' const='yes' id='06fcecfb'/>
    <typedef-decl name='VkVertexInputRate' type-id='9e9dd0f9' id='075054bd'/>
    <class-decl name='VkImageSubresource' size-in-bits='96' is-struct='yes' visibility='default' id='07ba95e3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aspectMask' type-id='241096e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mipLevel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arrayLayer' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkCommandPoolCreateFlags' type-id='c1850196' id='09153291'/>
    <pointer-type-def type-id='35cb7770' size-in-bits='32' id='094ce2ae'/>
    <typedef-decl name='VkInternalAllocationType' type-id='180cbde8' id='0966fa54'/>
    <typedef-decl name='VkPhysicalDeviceMemoryProperties' type-id='4faac63f' id='099fe106'/>
    <enum-decl name='VkAttachmentStoreOp' id='0a73a668'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_ATTACHMENT_STORE_OP_STORE' value='0'/>
      <enumerator name='VK_ATTACHMENT_STORE_OP_DONT_CARE' value='1'/>
      <enumerator name='VK_ATTACHMENT_STORE_OP_NONE_QCOM' value='1000301000'/>
      <enumerator name='VK_ATTACHMENT_STORE_OP_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='24799da4' size-in-bits='32' id='0afaac55'/>
    <pointer-type-def type-id='eb2586f5' size-in-bits='32' id='0b13510d'/>
    <typedef-decl name='PFN_vkReallocationFunction' type-id='9bcae1a1' id='0b231b21'/>
    <class-decl name='VkClearRect' size-in-bits='192' is-struct='yes' visibility='default' id='0b80ef51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rect' type-id='4e73dcf7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='baseArrayLayer' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='layerCount' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkSampleCountFlags' type-id='c1850196' id='0b99c89f'/>
    <pointer-type-def type-id='b49487ec' size-in-bits='32' id='0bd1bcb2'/>
    <pointer-type-def type-id='93fd7c3e' size-in-bits='32' id='0c0a537c'/>
    <class-decl name='VkPhysicalDeviceProperties' size-in-bits='6528' is-struct='yes' visibility='default' id='0c0b6880'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='apiVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='driverVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vendorID' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='deviceID' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='deviceType' type-id='cda1aa64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='deviceName' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='pipelineCacheUUID' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='limits' type-id='6d14f5f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='sparseProperties' type-id='80820589' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkIndexType' type-id='06fa6189' id='0c7798ed'/>
    <typedef-decl name='VkSampler' type-id='9c313c2d' id='0ccf74ad'/>
    <qualified-type-def type-id='7da6fb68' const='yes' id='0ce0e5b8'/>
    <typedef-decl name='VkComponentMapping' type-id='7983296d' id='0d3490fc'/>
    <enum-decl name='VkColorSpaceKHR' id='0d402807'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_COLOR_SPACE_SRGB_NONLINEAR_KHR' value='0'/>
      <enumerator name='VK_COLOR_SPACE_DISPLAY_P3_NONLINEAR_EXT' value='1000104001'/>
      <enumerator name='VK_COLOR_SPACE_EXTENDED_SRGB_LINEAR_EXT' value='1000104002'/>
      <enumerator name='VK_COLOR_SPACE_DISPLAY_P3_LINEAR_EXT' value='1000104003'/>
      <enumerator name='VK_COLOR_SPACE_DCI_P3_NONLINEAR_EXT' value='1000104004'/>
      <enumerator name='VK_COLOR_SPACE_BT709_LINEAR_EXT' value='1000104005'/>
      <enumerator name='VK_COLOR_SPACE_BT709_NONLINEAR_EXT' value='1000104006'/>
      <enumerator name='VK_COLOR_SPACE_BT2020_LINEAR_EXT' value='1000104007'/>
      <enumerator name='VK_COLOR_SPACE_HDR10_ST2084_EXT' value='1000104008'/>
      <enumerator name='VK_COLOR_SPACE_DOLBYVISION_EXT' value='1000104009'/>
      <enumerator name='VK_COLOR_SPACE_HDR10_HLG_EXT' value='1000104010'/>
      <enumerator name='VK_COLOR_SPACE_ADOBERGB_LINEAR_EXT' value='1000104011'/>
      <enumerator name='VK_COLOR_SPACE_ADOBERGB_NONLINEAR_EXT' value='1000104012'/>
      <enumerator name='VK_COLOR_SPACE_PASS_THROUGH_EXT' value='1000104013'/>
      <enumerator name='VK_COLOR_SPACE_EXTENDED_SRGB_NONLINEAR_EXT' value='1000104014'/>
      <enumerator name='VK_COLOR_SPACE_DISPLAY_NATIVE_AMD' value='1000213000'/>
      <enumerator name='VK_COLORSPACE_SRGB_NONLINEAR_KHR' value='0'/>
      <enumerator name='VK_COLOR_SPACE_DCI_P3_LINEAR_EXT' value='1000104003'/>
      <enumerator name='VK_COLOR_SPACE_MAX_ENUM_KHR' value='2147483647'/>
    </enum-decl>
    <qualified-type-def type-id='7db79445' const='yes' id='0d41bd15'/>
    <qualified-type-def type-id='eb219ec4' const='yes' id='0d65ce34'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='0d77e947'/>
    <qualified-type-def type-id='b960935d' const='yes' id='0d9f2f6d'/>
    <typedef-decl name='VkPhysicalDeviceImageFormatInfo2' type-id='62cb5a3d' id='0dc3622c'/>
    <qualified-type-def type-id='2af95a89' const='yes' id='0e357719'/>
    <class-decl name='VkSurfaceCapabilitiesKHR' size-in-bits='416' is-struct='yes' visibility='default' id='0edfcf42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='minImageCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='maxImageCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='currentExtent' type-id='d6df85a9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='minImageExtent' type-id='d6df85a9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='maxImageExtent' type-id='d6df85a9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='maxImageArrayLayers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='supportedTransforms' type-id='b478c344' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='currentTransform' type-id='12d982ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='supportedCompositeAlpha' type-id='1310a87c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='supportedUsageFlags' type-id='10949fe2' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='85f52404' size-in-bits='32' id='0ee7f46a'/>
    <qualified-type-def type-id='4d45f31e' const='yes' id='0eede28d'/>
    <class-decl name='VkPipelineShaderStageCreateInfo' size-in-bits='256' is-struct='yes' visibility='default' id='0f00d8e9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='2e0ba7e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='stage' type-id='660b2bbe' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='module' type-id='508d2306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pName' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pSpecializationInfo' type-id='65d88bd4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkAndroidSurfaceCreateInfoKHR' type-id='8326f11f' id='0f18d23c'/>
    <typedef-decl name='VkAttachmentReference' type-id='2f5800f0' id='0fb0212f'/>
    <typedef-decl name='VkPipelineMultisampleStateCreateFlags' type-id='c1850196' id='0fc0b4b8'/>
    <qualified-type-def type-id='e6b2f84f' const='yes' id='0fca73df'/>
    <typedef-decl name='VkAttachmentStoreOp' type-id='0a73a668' id='0fff4ee4'/>
    <typedef-decl name='VkSwapchainCreateInfoKHR' type-id='edabb2b5' id='106aac28'/>
    <typedef-decl name='VkExternalSemaphoreHandleTypeFlags' type-id='c1850196' id='108303cb'/>
    <typedef-decl name='VkImageUsageFlags' type-id='c1850196' id='10949fe2'/>
    <typedef-decl name='VkPipelineColorBlendStateCreateFlags' type-id='c1850196' id='10e5b1d7'/>
    <array-type-def dimensions='1' type-id='f4a65e4e' size-in-bits='2048' id='114911ce'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <pointer-type-def type-id='887ed618' size-in-bits='32' id='11ab30b6'/>
    <pointer-type-def type-id='59076ec6' size-in-bits='32' id='12b39d84'/>
    <typedef-decl name='VkSurfaceTransformFlagBitsKHR' type-id='70e284d3' id='12d982ef'/>
    <qualified-type-def type-id='d80731c8' const='yes' id='13000478'/>
    <typedef-decl name='VkCompositeAlphaFlagsKHR' type-id='c1850196' id='1310a87c'/>
    <qualified-type-def type-id='d189dc61' const='yes' id='132cddb1'/>
    <pointer-type-def type-id='85a0c094' size-in-bits='32' id='135de1c1'/>
    <pointer-type-def type-id='b99c00c9' size-in-bits='32' id='13956559'/>
    <typedef-decl name='VkFormat' type-id='4a7bb114' id='13aa8748'/>
    <class-decl name='VkSparseImageMemoryBind' size-in-bits='512' is-struct='yes' visibility='default' id='13cd9d8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subresource' type-id='d3439c9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='offset' type-id='cc1743c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='extent' type-id='b0dd0b40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memory' type-id='bd35095e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='memoryOffset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='70443faa' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkBindImageMemoryInfo' size-in-bits='256' is-struct='yes' visibility='default' id='1468407d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='image' type-id='c858cae4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory' type-id='bd35095e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='memoryOffset' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkSpecializationInfo' type-id='04aa29f7' id='14a911c6'/>
    <pointer-type-def type-id='9d4ff65a' size-in-bits='32' id='14e0f250'/>
    <typedef-decl name='VkQueryPoolCreateInfo' type-id='de88f4a8' id='1539ab27'/>
    <array-type-def dimensions='1' type-id='33dbba72' size-in-bits='128' id='1595aa6b'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='508d2306' size-in-bits='32' id='15ae4ac3'/>
    <qualified-type-def type-id='90cc6058' const='yes' id='167f55a8'/>
    <typedef-decl name='VkDependencyFlags' type-id='c1850196' id='169f4e95'/>
    <qualified-type-def type-id='fbdff05b' const='yes' id='16cbd04b'/>
    <typedef-decl name='VkVertexInputBindingDescription' type-id='adf6a475' id='16f4acd2'/>
    <class-decl name='VkMemoryType' size-in-bits='64' is-struct='yes' visibility='default' id='172ec9f1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='propertyFlags' type-id='49b55738' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='heapIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='80c638a8' const='yes' id='17bbfbb8'/>
    <enum-decl name='VkInternalAllocationType' id='180cbde8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_INTERNAL_ALLOCATION_TYPE_EXECUTABLE' value='0'/>
      <enumerator name='VK_INTERNAL_ALLOCATION_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkMemoryRequirements2' type-id='43a28ebd' id='186eb496'/>
    <class-decl name='VkStencilOpState' size-in-bits='224' is-struct='yes' visibility='default' id='1874b216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='failOp' type-id='3813153a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='passOp' type-id='3813153a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depthFailOp' type-id='3813153a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='compareOp' type-id='a23ca649' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='compareMask' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='writeMask' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reference' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkPhysicalDeviceGroupProperties' size-in-bits='1152' is-struct='yes' visibility='default' id='187d58d5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='physicalDeviceCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='physicalDevices' type-id='feb8e3c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='subsetAllocation' type-id='9439f9de' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkDescriptorUpdateTemplateCreateInfo' size-in-bits='448' is-struct='yes' visibility='default' id='188c570c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='8eac5e54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='descriptorUpdateEntryCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pDescriptorUpdateEntries' type-id='68057b3b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='templateType' type-id='92903a9d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='descriptorSetLayout' type-id='1ab35ab0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pipelineBindPoint' type-id='3ce0c7c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pipelineLayout' type-id='9d673803' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='set' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='32' id='18a8f8ab'>
      <parameter type-id='96ae8d47'/>
      <parameter type-id='2326b805'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <qualified-type-def type-id='2f14f678' const='yes' id='18aa2d08'/>
    <class-decl name='VkSamplerYcbcrConversionCreateInfo' size-in-bits='416' is-struct='yes' visibility='default' id='1901625d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='13aa8748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ycbcrModel' type-id='7358d225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ycbcrRange' type-id='730f17cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='components' type-id='0d3490fc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='xChromaOffset' type-id='259d72fe' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='yChromaOffset' type-id='259d72fe' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='chromaFilter' type-id='30c3c859' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='forceExplicitReconstruction' type-id='9439f9de' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='2c9548c0' size-in-bits='32' id='1901c85e'/>
    <pointer-type-def type-id='3255984d' size-in-bits='32' id='1935aa90'/>
    <typedef-decl name='VkImageCopy' type-id='bf42253a' id='199e54c9'/>
    <pointer-type-def type-id='24dc3b39' size-in-bits='32' id='19b0fee9'/>
    <class-decl name='VkSemaphoreWaitInfo' size-in-bits='192' is-struct='yes' visibility='default' id='1a2bd9a9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='f440e1f9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='semaphoreCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pSemaphores' type-id='26e3b8e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pValues' type-id='713a56f5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkDescriptorSetLayout' type-id='9c313c2d' id='1ab35ab0'/>
    <pointer-type-def type-id='efc549c8' size-in-bits='32' id='1af8f29d'/>
    <class-decl name='VkImageMemoryRequirementsInfo2' size-in-bits='128' is-struct='yes' visibility='default' id='1b9935b6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='image' type-id='c858cae4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PFN_vkInternalAllocationNotification' type-id='c405f161' id='1bf0818e'/>
    <class-decl name='VkBindBufferMemoryInfo' size-in-bits='256' is-struct='yes' visibility='default' id='1c423970'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buffer' type-id='97f1b675' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory' type-id='bd35095e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='memoryOffset' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkMemoryType' type-id='172ec9f1' id='1c6a5890'/>
    <class-decl name='VkPhysicalDeviceFeatures' size-in-bits='1760' is-struct='yes' visibility='default' id='1c7eb3b6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='robustBufferAccess' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fullDrawIndexUint32' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='imageCubeArray' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='independentBlend' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='geometryShader' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tessellationShader' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sampleRateShading' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dualSrcBlend' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='logicOp' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='multiDrawIndirect' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drawIndirectFirstInstance' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='depthClamp' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='depthBiasClamp' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='fillModeNonSolid' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='depthBounds' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='wideLines' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='largePoints' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='alphaToOne' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='multiViewport' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='samplerAnisotropy' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='textureCompressionETC2' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='textureCompressionASTC_LDR' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='textureCompressionBC' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='occlusionQueryPrecise' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pipelineStatisticsQuery' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='vertexPipelineStoresAndAtomics' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='fragmentStoresAndAtomics' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='shaderTessellationAndGeometryPointSize' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='shaderImageGatherExtended' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='shaderStorageImageExtendedFormats' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='shaderStorageImageMultisample' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='shaderStorageImageReadWithoutFormat' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='shaderStorageImageWriteWithoutFormat' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='shaderUniformBufferArrayDynamicIndexing' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='shaderSampledImageArrayDynamicIndexing' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='shaderStorageBufferArrayDynamicIndexing' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='shaderStorageImageArrayDynamicIndexing' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='shaderClipDistance' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='shaderCullDistance' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='shaderFloat64' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='shaderInt64' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='shaderInt16' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='shaderResourceResidency' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='shaderResourceMinLod' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='sparseBinding' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='sparseResidencyBuffer' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='sparseResidencyImage2D' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='sparseResidencyImage3D' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='sparseResidency2Samples' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='sparseResidency4Samples' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='sparseResidency8Samples' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='sparseResidency16Samples' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='sparseResidencyAliased' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='variableMultisampleRate' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='inheritedQueries' type-id='9439f9de' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='265feb54' const='yes' id='1cbdf9c4'/>
    <class-decl name='VkExternalMemoryProperties' size-in-bits='96' is-struct='yes' visibility='default' id='1d632383'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='externalMemoryFeatures' type-id='eeb8b612' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='exportFromImportedHandleTypes' type-id='7d9a9cb8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='compatibleHandleTypes' type-id='7d9a9cb8' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='0d41bd15' size-in-bits='32' id='1d7cea2d'/>
    <class-decl name='VkPhysicalDeviceSparseProperties' size-in-bits='160' is-struct='yes' visibility='default' id='1df3d048'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='residencyStandard2DBlockShape' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='residencyStandard2DMultisampleBlockShape' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='residencyStandard3DBlockShape' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='residencyAlignedMipSize' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='residencyNonResidentStrict' type-id='9439f9de' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkMemoryAllocateInfo' type-id='745d355e' id='1e5dc49b'/>
    <typedef-decl name='__intptr_t' type-id='95e97e5e' id='1f01f664'/>
    <typedef-decl name='VkImageType' type-id='3660eff8' id='1f12e1cc'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='infinite' id='1fdc7fa6'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <qualified-type-def type-id='4e73dcf7' const='yes' id='1feffd87'/>
    <typedef-decl name='VkPhysicalDeviceFeatures2' type-id='5f7498cc' id='20105efb'/>
    <pointer-type-def type-id='6192c79e' size-in-bits='32' id='201e8bc4'/>
    <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='128' id='209ef23f'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <class-decl name='VkPipelineVertexInputStateCreateInfo' size-in-bits='224' is-struct='yes' visibility='default' id='2128c873'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='522ffe29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vertexBindingDescriptionCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pVertexBindingDescriptions' type-id='4999f6b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vertexAttributeDescriptionCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pVertexAttributeDescriptions' type-id='caa0db01' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='fa37a67f' const='yes' id='2148aa4f'/>
    <typedef-decl name='VkImageViewCreateInfo' type-id='c2d1f38a' id='214e5875'/>
    <enum-decl name='VkExternalSemaphoreHandleTypeFlagBits' id='2169550e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_FD_BIT' value='1'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_BIT' value='2'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT' value='4'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D12_FENCE_BIT' value='8'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_SYNC_FD_BIT' value='16'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D11_FENCE_BIT' value='8'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_FD_BIT_KHR' value='1'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_BIT_KHR' value='2'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT_KHR' value='4'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D12_FENCE_BIT_KHR' value='8'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_SYNC_FD_BIT_KHR' value='16'/>
      <enumerator name='VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_FLAG_BITS_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='918bf5f6' size-in-bits='32' id='21aab115'/>
    <typedef-decl name='VkPipelineStageFlagBits' type-id='4fc7e30b' id='21fd0daf'/>
    <class-decl name='VkOffset3D' size-in-bits='96' is-struct='yes' visibility='default' id='2207d61e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='d15bbd95' size-in-bits='32' id='2326b805'/>
    <pointer-type-def type-id='e8000afb' size-in-bits='32' id='23bb09eb'/>
    <typedef-decl name='VkSemaphoreWaitInfo' type-id='1a2bd9a9' id='23c44e7e'/>
    <typedef-decl name='VkImageAspectFlags' type-id='c1850196' id='241096e7'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <typedef-decl name='VkCopyDescriptorSet' type-id='a73ee9c2' id='2448def1'/>
    <pointer-type-def type-id='cb386879' size-in-bits='32' id='2453062e'/>
    <typedef-decl name='VkPresentModeKHR' type-id='c270a6c0' id='24799da4'/>
    <pointer-type-def type-id='40498d50' size-in-bits='32' id='24902351'/>
    <pointer-type-def type-id='d3f6e35d' size-in-bits='32' id='24a81455'/>
    <class-decl name='VkSparseImageOpaqueMemoryBindInfo' size-in-bits='128' is-struct='yes' visibility='default' id='24ba217c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='image' type-id='c858cae4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bindCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pBinds' type-id='7c2d954b' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='eda82d49' const='yes' id='24dc3b39'/>
    <qualified-type-def type-id='d3439c9e' const='yes' id='252b538e'/>
    <typedef-decl name='VkChromaLocation' type-id='b99e9f92' id='259d72fe'/>
    <pointer-type-def type-id='32ffbc0f' size-in-bits='32' id='25d2cf6a'/>
    <pointer-type-def type-id='b1e05099' size-in-bits='32' id='25d46ec2'/>
    <typedef-decl name='VkFenceCreateFlags' type-id='c1850196' id='25e5e7ef'/>
    <typedef-decl name='VkFenceCreateInfo' type-id='3c9b0b2b' id='261ddca0'/>
    <pointer-type-def type-id='fc5554c6' size-in-bits='32' id='2654af84'/>
    <typedef-decl name='VkBufferCopy' type-id='a080d2e5' id='265feb54'/>
    <pointer-type-def type-id='88c24ff7' size-in-bits='32' id='26e3b8e7'/>
    <class-decl name='VkBufferMemoryRequirementsInfo2' size-in-bits='128' is-struct='yes' visibility='default' id='26f1211b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buffer' type-id='97f1b675' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='252b538e' size-in-bits='32' id='2734ab2c'/>
    <pointer-type-def type-id='0eede28d' size-in-bits='32' id='277bcce5'/>
    <pointer-type-def type-id='7af5e0f5' size-in-bits='32' id='277c3858'/>
    <pointer-type-def type-id='ddefeeed' size-in-bits='32' id='27b4e345'/>
    <typedef-decl name='VkQueue' type-id='bb9a7b60' id='280cd1f6'/>
    <pointer-type-def type-id='ea3c0d46' size-in-bits='32' id='28892104'/>
    <qualified-type-def type-id='5c4cf30e' const='yes' id='28f4499e'/>
    <class-decl name='VkSubpassDependency' size-in-bits='224' is-struct='yes' visibility='default' id='299827f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srcSubpass' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstSubpass' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srcStageMask' type-id='5b07f658' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dstStageMask' type-id='5b07f658' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srcAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dstAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dependencyFlags' type-id='169f4e95' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkPipelineCacheCreateFlags' type-id='c1850196' id='2998bdd0'/>
    <pointer-type-def type-id='01899f94' size-in-bits='32' id='29a6781a'/>
    <class-decl name='VkDeviceCreateInfo' size-in-bits='320' is-struct='yes' visibility='default' id='29a97c58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='50d689d4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='queueCreateInfoCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pQueueCreateInfos' type-id='a7937ede' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='enabledLayerCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ppEnabledLayerNames' type-id='13956559' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='enabledExtensionCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ppEnabledExtensionNames' type-id='13956559' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pEnabledFeatures' type-id='e61720c3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkFrontFace' type-id='f41b71a3' id='29fbff5f'/>
    <typedef-decl name='VkRenderPassCreateInfo' type-id='b2717de7' id='2a41d7ca'/>
    <typedef-decl name='VkDescriptorImageInfo' type-id='7f821684' id='2aaa8237'/>
    <class-decl name='VkFramebufferCreateInfo' size-in-bits='384' is-struct='yes' visibility='default' id='2ab6f94d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='acd5e1d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='renderPass' type-id='df345276' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='attachmentCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pAttachments' type-id='ec7868c5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='height' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='layers' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='8c4eb061' size-in-bits='32' id='2adf8611'/>
    <typedef-decl name='VkPipelineCache' type-id='9c313c2d' id='2af95a89'/>
    <qualified-type-def type-id='da0e6e25' const='yes' id='2bcac315'/>
    <qualified-type-def type-id='ff1e3bb4' const='yes' id='2c1e2a44'/>
    <typedef-decl name='VkSubpassContents' type-id='01aeb2b8' id='2c7aaccc'/>
    <pointer-type-def type-id='f633aaad' size-in-bits='32' id='2c8c5f52'/>
    <pointer-type-def type-id='28f4499e' size-in-bits='32' id='2c90065c'/>
    <qualified-type-def type-id='1ab35ab0' const='yes' id='2c9548c0'/>
    <pointer-type-def type-id='cdc60214' size-in-bits='32' id='2cb5879a'/>
    <class-decl name='VkApplicationInfo' size-in-bits='224' is-struct='yes' visibility='default' id='2cd102a8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pApplicationName' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='applicationVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pEngineName' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='engineVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='apiVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='1cbdf9c4' size-in-bits='32' id='2d1071aa'/>
    <typedef-decl name='VkComponentSwizzle' type-id='72f1bcc8' id='2d118a7c'/>
    <typedef-decl name='VkExternalBufferProperties' type-id='31c748ba' id='2d621e0b'/>
    <typedef-decl name='VkBufferViewCreateInfo' type-id='60fb7521' id='2da062d0'/>
    <typedef-decl name='VkRenderPassCreateFlags' type-id='c1850196' id='2dfe2d2d'/>
    <typedef-decl name='VkPipelineShaderStageCreateFlags' type-id='c1850196' id='2e0ba7e9'/>
    <typedef-decl name='VkShaderModuleCreateInfo' type-id='cb42b477' id='2e12ba1a'/>
    <pointer-type-def type-id='94403fe7' size-in-bits='32' id='2e246fb7'/>
    <typedef-decl name='VkSparseImageOpaqueMemoryBindInfo' type-id='24ba217c' id='2e4df19f'/>
    <pointer-type-def type-id='c8a16373' size-in-bits='32' id='2f0f651b'/>
    <typedef-decl name='VkSparseImageMemoryBindInfo' type-id='5108939b' id='2f14f678'/>
    <pointer-type-def type-id='2bcac315' size-in-bits='32' id='2f315c2d'/>
    <pointer-type-def type-id='d80731c8' size-in-bits='32' id='2f42e251'/>
    <class-decl name='VkAttachmentReference' size-in-bits='64' is-struct='yes' visibility='default' id='2f5800f0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attachment' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='layout' type-id='dad72c2a' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='31b0e5dc' size-in-bits='32' id='2f7a0242'/>
    <qualified-type-def type-id='5ba47a1c' const='yes' id='2fb28dac'/>
    <pointer-type-def type-id='85fe916a' size-in-bits='32' id='2fbea7c0'/>
    <pointer-type-def type-id='84bc9611' size-in-bits='32' id='2fe07ee1'/>
    <pointer-type-def type-id='4e73dcf7' size-in-bits='32' id='3030c938'/>
    <qualified-type-def type-id='5b1c3d0c' const='yes' id='30734f1c'/>
    <typedef-decl name='VkFilter' type-id='9f5d4195' id='30c3c859'/>
    <pointer-type-def type-id='bed0922d' size-in-bits='32' id='310f036d'/>
    <pointer-type-def type-id='a79c877c' size-in-bits='32' id='31690c62'/>
    <class-decl name='native_handle' size-in-bits='96' is-struct='yes' visibility='default' id='3181ea79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='numFds' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numInts' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='data' type-id='1fdc7fa6' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='05d736ec' const='yes' id='31b0e5dc'/>
    <class-decl name='VkImageSubresourceRange' size-in-bits='160' is-struct='yes' visibility='default' id='31bf8b98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aspectMask' type-id='241096e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='baseMipLevel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='levelCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='baseArrayLayer' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='layerCount' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkExternalBufferProperties' size-in-bits='160' is-struct='yes' visibility='default' id='31c748ba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='externalMemoryProperties' type-id='908e411e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkCommandPool' type-id='9c313c2d' id='31f71d22'/>
    <class-decl name='VkMemoryGetAndroidHardwareBufferInfoANDROID' size-in-bits='128' is-struct='yes' visibility='default' id='3216649b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory' type-id='bd35095e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkFormatProperties2' type-id='82c9fd62' id='3255984d'/>
    <pointer-type-def type-id='9b182dcb' size-in-bits='32' id='32dca1cc'/>
    <typedef-decl name='VkQueueFamilyProperties' type-id='8db0cbec' id='32ffbc0f'/>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='64' id='337c1cdd'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <pointer-type-def type-id='c80d2f6d' size-in-bits='32' id='33c16cc5'/>
    <typedef-decl name='intptr_t' type-id='1f01f664' id='33dbba72'/>
    <enum-decl name='VkStructureType' id='33e97118'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_STRUCTURE_TYPE_APPLICATION_INFO' value='0'/>
      <enumerator name='VK_STRUCTURE_TYPE_INSTANCE_CREATE_INFO' value='1'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_QUEUE_CREATE_INFO' value='2'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_CREATE_INFO' value='3'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBMIT_INFO' value='4'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_ALLOCATE_INFO' value='5'/>
      <enumerator name='VK_STRUCTURE_TYPE_MAPPED_MEMORY_RANGE' value='6'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_SPARSE_INFO' value='7'/>
      <enumerator name='VK_STRUCTURE_TYPE_FENCE_CREATE_INFO' value='8'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_CREATE_INFO' value='9'/>
      <enumerator name='VK_STRUCTURE_TYPE_EVENT_CREATE_INFO' value='10'/>
      <enumerator name='VK_STRUCTURE_TYPE_QUERY_POOL_CREATE_INFO' value='11'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_CREATE_INFO' value='12'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_VIEW_CREATE_INFO' value='13'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_CREATE_INFO' value='14'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_VIEW_CREATE_INFO' value='15'/>
      <enumerator name='VK_STRUCTURE_TYPE_SHADER_MODULE_CREATE_INFO' value='16'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_CACHE_CREATE_INFO' value='17'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_SHADER_STAGE_CREATE_INFO' value='18'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VERTEX_INPUT_STATE_CREATE_INFO' value='19'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_INPUT_ASSEMBLY_STATE_CREATE_INFO' value='20'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_TESSELLATION_STATE_CREATE_INFO' value='21'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_STATE_CREATE_INFO' value='22'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_STATE_CREATE_INFO' value='23'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_MULTISAMPLE_STATE_CREATE_INFO' value='24'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_DEPTH_STENCIL_STATE_CREATE_INFO' value='25'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_COLOR_BLEND_STATE_CREATE_INFO' value='26'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_DYNAMIC_STATE_CREATE_INFO' value='27'/>
      <enumerator name='VK_STRUCTURE_TYPE_GRAPHICS_PIPELINE_CREATE_INFO' value='28'/>
      <enumerator name='VK_STRUCTURE_TYPE_COMPUTE_PIPELINE_CREATE_INFO' value='29'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_LAYOUT_CREATE_INFO' value='30'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_CREATE_INFO' value='31'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_CREATE_INFO' value='32'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_POOL_CREATE_INFO' value='33'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_ALLOCATE_INFO' value='34'/>
      <enumerator name='VK_STRUCTURE_TYPE_WRITE_DESCRIPTOR_SET' value='35'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_DESCRIPTOR_SET' value='36'/>
      <enumerator name='VK_STRUCTURE_TYPE_FRAMEBUFFER_CREATE_INFO' value='37'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_CREATE_INFO' value='38'/>
      <enumerator name='VK_STRUCTURE_TYPE_COMMAND_POOL_CREATE_INFO' value='39'/>
      <enumerator name='VK_STRUCTURE_TYPE_COMMAND_BUFFER_ALLOCATE_INFO' value='40'/>
      <enumerator name='VK_STRUCTURE_TYPE_COMMAND_BUFFER_INHERITANCE_INFO' value='41'/>
      <enumerator name='VK_STRUCTURE_TYPE_COMMAND_BUFFER_BEGIN_INFO' value='42'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_BEGIN_INFO' value='43'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_MEMORY_BARRIER' value='44'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_MEMORY_BARRIER' value='45'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_BARRIER' value='46'/>
      <enumerator name='VK_STRUCTURE_TYPE_LOADER_INSTANCE_CREATE_INFO' value='47'/>
      <enumerator name='VK_STRUCTURE_TYPE_LOADER_DEVICE_CREATE_INFO' value='48'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SUBGROUP_PROPERTIES' value='1000094000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_BUFFER_MEMORY_INFO' value='1000157000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_IMAGE_MEMORY_INFO' value='1000157001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_16BIT_STORAGE_FEATURES' value='1000083000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_DEDICATED_REQUIREMENTS' value='1000127000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_DEDICATED_ALLOCATE_INFO' value='1000127001'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_ALLOCATE_FLAGS_INFO' value='1000060000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_RENDER_PASS_BEGIN_INFO' value='1000060003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_COMMAND_BUFFER_BEGIN_INFO' value='1000060004'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_SUBMIT_INFO' value='1000060005'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_BIND_SPARSE_INFO' value='1000060006'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_BUFFER_MEMORY_DEVICE_GROUP_INFO' value='1000060013'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_IMAGE_MEMORY_DEVICE_GROUP_INFO' value='1000060014'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_GROUP_PROPERTIES' value='1000070000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_DEVICE_CREATE_INFO' value='1000070001'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_MEMORY_REQUIREMENTS_INFO_2' value='1000146000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_MEMORY_REQUIREMENTS_INFO_2' value='1000146001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_SPARSE_MEMORY_REQUIREMENTS_INFO_2' value='1000146002'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_REQUIREMENTS_2' value='1000146003'/>
      <enumerator name='VK_STRUCTURE_TYPE_SPARSE_IMAGE_MEMORY_REQUIREMENTS_2' value='1000146004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FEATURES_2' value='1000059000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PROPERTIES_2' value='1000059001'/>
      <enumerator name='VK_STRUCTURE_TYPE_FORMAT_PROPERTIES_2' value='1000059002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_FORMAT_PROPERTIES_2' value='1000059003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGE_FORMAT_INFO_2' value='1000059004'/>
      <enumerator name='VK_STRUCTURE_TYPE_QUEUE_FAMILY_PROPERTIES_2' value='1000059005'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MEMORY_PROPERTIES_2' value='1000059006'/>
      <enumerator name='VK_STRUCTURE_TYPE_SPARSE_IMAGE_FORMAT_PROPERTIES_2' value='1000059007'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SPARSE_IMAGE_FORMAT_INFO_2' value='1000059008'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_POINT_CLIPPING_PROPERTIES' value='1000117000'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_INPUT_ATTACHMENT_ASPECT_CREATE_INFO' value='1000117001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_VIEW_USAGE_CREATE_INFO' value='1000117002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_TESSELLATION_DOMAIN_ORIGIN_STATE_CREATE_INFO' value='1000117003'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_MULTIVIEW_CREATE_INFO' value='1000053000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_FEATURES' value='1000053001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_PROPERTIES' value='1000053002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VARIABLE_POINTERS_FEATURES' value='1000120000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PROTECTED_SUBMIT_INFO' value='1000145000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PROTECTED_MEMORY_FEATURES' value='1000145001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PROTECTED_MEMORY_PROPERTIES' value='1000145002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_QUEUE_INFO_2' value='1000145003'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_YCBCR_CONVERSION_CREATE_INFO' value='1000156000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_YCBCR_CONVERSION_INFO' value='1000156001'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_IMAGE_PLANE_MEMORY_INFO' value='1000156002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_PLANE_MEMORY_REQUIREMENTS_INFO' value='1000156003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SAMPLER_YCBCR_CONVERSION_FEATURES' value='1000156004'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_YCBCR_CONVERSION_IMAGE_FORMAT_PROPERTIES' value='1000156005'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_UPDATE_TEMPLATE_CREATE_INFO' value='1000085000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_IMAGE_FORMAT_INFO' value='1000071000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_IMAGE_FORMAT_PROPERTIES' value='1000071001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_BUFFER_INFO' value='1000071002'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_BUFFER_PROPERTIES' value='1000071003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_ID_PROPERTIES' value='1000071004'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_BUFFER_CREATE_INFO' value='1000072000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_IMAGE_CREATE_INFO' value='1000072001'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_MEMORY_ALLOCATE_INFO' value='1000072002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_FENCE_INFO' value='1000112000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_FENCE_PROPERTIES' value='1000112001'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_FENCE_CREATE_INFO' value='1000113000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_SEMAPHORE_CREATE_INFO' value='1000077000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_SEMAPHORE_INFO' value='1000076000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_SEMAPHORE_PROPERTIES' value='1000076001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MAINTENANCE_3_PROPERTIES' value='1000168000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_SUPPORT' value='1000168001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_DRAW_PARAMETERS_FEATURES' value='1000063000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VULKAN_1_1_FEATURES' value='49'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VULKAN_1_1_PROPERTIES' value='50'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VULKAN_1_2_FEATURES' value='51'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VULKAN_1_2_PROPERTIES' value='52'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_FORMAT_LIST_CREATE_INFO' value='1000147000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_DESCRIPTION_2' value='1000109000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_REFERENCE_2' value='1000109001'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_DESCRIPTION_2' value='1000109002'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_DEPENDENCY_2' value='1000109003'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_CREATE_INFO_2' value='1000109004'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_BEGIN_INFO' value='1000109005'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_END_INFO' value='1000109006'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_8BIT_STORAGE_FEATURES' value='1000177000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DRIVER_PROPERTIES' value='1000196000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_ATOMIC_INT64_FEATURES' value='1000180000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_FLOAT16_INT8_FEATURES' value='1000082000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FLOAT_CONTROLS_PROPERTIES' value='1000197000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_BINDING_FLAGS_CREATE_INFO' value='1000161000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DESCRIPTOR_INDEXING_FEATURES' value='1000161001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DESCRIPTOR_INDEXING_PROPERTIES' value='1000161002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_VARIABLE_DESCRIPTOR_COUNT_ALLOCATE_INFO' value='1000161003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_VARIABLE_DESCRIPTOR_COUNT_LAYOUT_SUPPORT' value='1000161004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DEPTH_STENCIL_RESOLVE_PROPERTIES' value='1000199000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_DESCRIPTION_DEPTH_STENCIL_RESOLVE' value='1000199001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SCALAR_BLOCK_LAYOUT_FEATURES' value='1000221000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_STENCIL_USAGE_CREATE_INFO' value='1000246000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SAMPLER_FILTER_MINMAX_PROPERTIES' value='1000130000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_REDUCTION_MODE_CREATE_INFO' value='1000130001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VULKAN_MEMORY_MODEL_FEATURES' value='1000211000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGELESS_FRAMEBUFFER_FEATURES' value='1000108000'/>
      <enumerator name='VK_STRUCTURE_TYPE_FRAMEBUFFER_ATTACHMENTS_CREATE_INFO' value='1000108001'/>
      <enumerator name='VK_STRUCTURE_TYPE_FRAMEBUFFER_ATTACHMENT_IMAGE_INFO' value='1000108002'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_ATTACHMENT_BEGIN_INFO' value='1000108003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_UNIFORM_BUFFER_STANDARD_LAYOUT_FEATURES' value='1000253000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_SUBGROUP_EXTENDED_TYPES_FEATURES' value='1000175000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SEPARATE_DEPTH_STENCIL_LAYOUTS_FEATURES' value='1000241000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_REFERENCE_STENCIL_LAYOUT' value='1000241001'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_DESCRIPTION_STENCIL_LAYOUT' value='1000241002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_HOST_QUERY_RESET_FEATURES' value='1000261000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TIMELINE_SEMAPHORE_FEATURES' value='1000207000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TIMELINE_SEMAPHORE_PROPERTIES' value='1000207001'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_TYPE_CREATE_INFO' value='1000207002'/>
      <enumerator name='VK_STRUCTURE_TYPE_TIMELINE_SEMAPHORE_SUBMIT_INFO' value='1000207003'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_WAIT_INFO' value='1000207004'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_SIGNAL_INFO' value='1000207005'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BUFFER_DEVICE_ADDRESS_FEATURES' value='1000257000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_DEVICE_ADDRESS_INFO' value='1000244001'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_OPAQUE_CAPTURE_ADDRESS_CREATE_INFO' value='1000257002'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_OPAQUE_CAPTURE_ADDRESS_ALLOCATE_INFO' value='1000257003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_MEMORY_OPAQUE_CAPTURE_ADDRESS_INFO' value='1000257004'/>
      <enumerator name='VK_STRUCTURE_TYPE_SWAPCHAIN_CREATE_INFO_KHR' value='1000001000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PRESENT_INFO_KHR' value='1000001001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_PRESENT_CAPABILITIES_KHR' value='1000060007'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_SWAPCHAIN_CREATE_INFO_KHR' value='1000060008'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_IMAGE_MEMORY_SWAPCHAIN_INFO_KHR' value='1000060009'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACQUIRE_NEXT_IMAGE_INFO_KHR' value='1000060010'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_PRESENT_INFO_KHR' value='1000060011'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_SWAPCHAIN_CREATE_INFO_KHR' value='1000060012'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_MODE_CREATE_INFO_KHR' value='1000002000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_SURFACE_CREATE_INFO_KHR' value='1000002001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_PRESENT_INFO_KHR' value='1000003000'/>
      <enumerator name='VK_STRUCTURE_TYPE_XLIB_SURFACE_CREATE_INFO_KHR' value='1000004000'/>
      <enumerator name='VK_STRUCTURE_TYPE_XCB_SURFACE_CREATE_INFO_KHR' value='1000005000'/>
      <enumerator name='VK_STRUCTURE_TYPE_WAYLAND_SURFACE_CREATE_INFO_KHR' value='1000006000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ANDROID_SURFACE_CREATE_INFO_KHR' value='1000008000'/>
      <enumerator name='VK_STRUCTURE_TYPE_WIN32_SURFACE_CREATE_INFO_KHR' value='1000009000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_REPORT_CALLBACK_CREATE_INFO_EXT' value='1000011000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_STATE_RASTERIZATION_ORDER_AMD' value='1000018000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_MARKER_OBJECT_NAME_INFO_EXT' value='1000022000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_MARKER_OBJECT_TAG_INFO_EXT' value='1000022001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_MARKER_MARKER_INFO_EXT' value='1000022002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEDICATED_ALLOCATION_IMAGE_CREATE_INFO_NV' value='1000026000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEDICATED_ALLOCATION_BUFFER_CREATE_INFO_NV' value='1000026001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEDICATED_ALLOCATION_MEMORY_ALLOCATE_INFO_NV' value='1000026002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TRANSFORM_FEEDBACK_FEATURES_EXT' value='1000028000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TRANSFORM_FEEDBACK_PROPERTIES_EXT' value='1000028001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_STATE_STREAM_CREATE_INFO_EXT' value='1000028002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_VIEW_HANDLE_INFO_NVX' value='1000030000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_VIEW_ADDRESS_PROPERTIES_NVX' value='1000030001'/>
      <enumerator name='VK_STRUCTURE_TYPE_TEXTURE_LOD_GATHER_FORMAT_PROPERTIES_AMD' value='1000041000'/>
      <enumerator name='VK_STRUCTURE_TYPE_STREAM_DESCRIPTOR_SURFACE_CREATE_INFO_GGP' value='1000049000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_CORNER_SAMPLED_IMAGE_FEATURES_NV' value='1000050000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_IMAGE_CREATE_INFO_NV' value='1000056000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_MEMORY_ALLOCATE_INFO_NV' value='1000056001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_MEMORY_WIN32_HANDLE_INFO_NV' value='1000057000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_MEMORY_WIN32_HANDLE_INFO_NV' value='1000057001'/>
      <enumerator name='VK_STRUCTURE_TYPE_WIN32_KEYED_MUTEX_ACQUIRE_RELEASE_INFO_NV' value='1000058000'/>
      <enumerator name='VK_STRUCTURE_TYPE_VALIDATION_FLAGS_EXT' value='1000061000'/>
      <enumerator name='VK_STRUCTURE_TYPE_VI_SURFACE_CREATE_INFO_NN' value='1000062000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TEXTURE_COMPRESSION_ASTC_HDR_FEATURES_EXT' value='1000066000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_VIEW_ASTC_DECODE_MODE_EXT' value='1000067000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_ASTC_DECODE_FEATURES_EXT' value='1000067001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_MEMORY_WIN32_HANDLE_INFO_KHR' value='1000073000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_MEMORY_WIN32_HANDLE_INFO_KHR' value='1000073001'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_WIN32_HANDLE_PROPERTIES_KHR' value='1000073002'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_GET_WIN32_HANDLE_INFO_KHR' value='1000073003'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_MEMORY_FD_INFO_KHR' value='1000074000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_FD_PROPERTIES_KHR' value='1000074001'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_GET_FD_INFO_KHR' value='1000074002'/>
      <enumerator name='VK_STRUCTURE_TYPE_WIN32_KEYED_MUTEX_ACQUIRE_RELEASE_INFO_KHR' value='1000075000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_SEMAPHORE_WIN32_HANDLE_INFO_KHR' value='1000078000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_SEMAPHORE_WIN32_HANDLE_INFO_KHR' value='1000078001'/>
      <enumerator name='VK_STRUCTURE_TYPE_D3D12_FENCE_SUBMIT_INFO_KHR' value='1000078002'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_GET_WIN32_HANDLE_INFO_KHR' value='1000078003'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_SEMAPHORE_FD_INFO_KHR' value='1000079000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_GET_FD_INFO_KHR' value='1000079001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PUSH_DESCRIPTOR_PROPERTIES_KHR' value='1000080000'/>
      <enumerator name='VK_STRUCTURE_TYPE_COMMAND_BUFFER_INHERITANCE_CONDITIONAL_RENDERING_INFO_EXT' value='1000081000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_CONDITIONAL_RENDERING_FEATURES_EXT' value='1000081001'/>
      <enumerator name='VK_STRUCTURE_TYPE_CONDITIONAL_RENDERING_BEGIN_INFO_EXT' value='1000081002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PRESENT_REGIONS_KHR' value='1000084000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_W_SCALING_STATE_CREATE_INFO_NV' value='1000087000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_CAPABILITIES_2_EXT' value='1000090000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_POWER_INFO_EXT' value='1000091000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_EVENT_INFO_EXT' value='1000091001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_EVENT_INFO_EXT' value='1000091002'/>
      <enumerator name='VK_STRUCTURE_TYPE_SWAPCHAIN_COUNTER_CREATE_INFO_EXT' value='1000091003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PRESENT_TIMES_INFO_GOOGLE' value='1000092000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_PER_VIEW_ATTRIBUTES_PROPERTIES_NVX' value='1000097000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_SWIZZLE_STATE_CREATE_INFO_NV' value='1000098000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DISCARD_RECTANGLE_PROPERTIES_EXT' value='1000099000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_DISCARD_RECTANGLE_STATE_CREATE_INFO_EXT' value='1000099001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_CONSERVATIVE_RASTERIZATION_PROPERTIES_EXT' value='1000101000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_CONSERVATIVE_STATE_CREATE_INFO_EXT' value='1000101001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DEPTH_CLIP_ENABLE_FEATURES_EXT' value='1000102000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_DEPTH_CLIP_STATE_CREATE_INFO_EXT' value='1000102001'/>
      <enumerator name='VK_STRUCTURE_TYPE_HDR_METADATA_EXT' value='1000105000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SHARED_PRESENT_SURFACE_CAPABILITIES_KHR' value='1000111000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_FENCE_WIN32_HANDLE_INFO_KHR' value='1000114000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_FENCE_WIN32_HANDLE_INFO_KHR' value='1000114001'/>
      <enumerator name='VK_STRUCTURE_TYPE_FENCE_GET_WIN32_HANDLE_INFO_KHR' value='1000114002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_FENCE_FD_INFO_KHR' value='1000115000'/>
      <enumerator name='VK_STRUCTURE_TYPE_FENCE_GET_FD_INFO_KHR' value='1000115001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PERFORMANCE_QUERY_FEATURES_KHR' value='1000116000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PERFORMANCE_QUERY_PROPERTIES_KHR' value='1000116001'/>
      <enumerator name='VK_STRUCTURE_TYPE_QUERY_POOL_PERFORMANCE_CREATE_INFO_KHR' value='1000116002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PERFORMANCE_QUERY_SUBMIT_INFO_KHR' value='1000116003'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACQUIRE_PROFILING_LOCK_INFO_KHR' value='1000116004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PERFORMANCE_COUNTER_KHR' value='1000116005'/>
      <enumerator name='VK_STRUCTURE_TYPE_PERFORMANCE_COUNTER_DESCRIPTION_KHR' value='1000116006'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SURFACE_INFO_2_KHR' value='1000119000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_CAPABILITIES_2_KHR' value='1000119001'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_FORMAT_2_KHR' value='1000119002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_PROPERTIES_2_KHR' value='1000121000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_PLANE_PROPERTIES_2_KHR' value='1000121001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_MODE_PROPERTIES_2_KHR' value='1000121002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_PLANE_INFO_2_KHR' value='1000121003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_PLANE_CAPABILITIES_2_KHR' value='1000121004'/>
      <enumerator name='VK_STRUCTURE_TYPE_IOS_SURFACE_CREATE_INFO_MVK' value='1000122000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MACOS_SURFACE_CREATE_INFO_MVK' value='1000123000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_UTILS_OBJECT_NAME_INFO_EXT' value='1000128000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_UTILS_OBJECT_TAG_INFO_EXT' value='1000128001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_UTILS_LABEL_EXT' value='1000128002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_UTILS_MESSENGER_CALLBACK_DATA_EXT' value='1000128003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_UTILS_MESSENGER_CREATE_INFO_EXT' value='1000128004'/>
      <enumerator name='VK_STRUCTURE_TYPE_ANDROID_HARDWARE_BUFFER_USAGE_ANDROID' value='1000129000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ANDROID_HARDWARE_BUFFER_PROPERTIES_ANDROID' value='1000129001'/>
      <enumerator name='VK_STRUCTURE_TYPE_ANDROID_HARDWARE_BUFFER_FORMAT_PROPERTIES_ANDROID' value='1000129002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_ANDROID_HARDWARE_BUFFER_INFO_ANDROID' value='1000129003'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_GET_ANDROID_HARDWARE_BUFFER_INFO_ANDROID' value='1000129004'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_FORMAT_ANDROID' value='1000129005'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_INLINE_UNIFORM_BLOCK_FEATURES_EXT' value='1000138000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_INLINE_UNIFORM_BLOCK_PROPERTIES_EXT' value='1000138001'/>
      <enumerator name='VK_STRUCTURE_TYPE_WRITE_DESCRIPTOR_SET_INLINE_UNIFORM_BLOCK_EXT' value='1000138002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_POOL_INLINE_UNIFORM_BLOCK_CREATE_INFO_EXT' value='1000138003'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLE_LOCATIONS_INFO_EXT' value='1000143000'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_SAMPLE_LOCATIONS_BEGIN_INFO_EXT' value='1000143001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_SAMPLE_LOCATIONS_STATE_CREATE_INFO_EXT' value='1000143002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SAMPLE_LOCATIONS_PROPERTIES_EXT' value='1000143003'/>
      <enumerator name='VK_STRUCTURE_TYPE_MULTISAMPLE_PROPERTIES_EXT' value='1000143004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BLEND_OPERATION_ADVANCED_FEATURES_EXT' value='1000148000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BLEND_OPERATION_ADVANCED_PROPERTIES_EXT' value='1000148001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_COLOR_BLEND_ADVANCED_STATE_CREATE_INFO_EXT' value='1000148002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_COVERAGE_TO_COLOR_STATE_CREATE_INFO_NV' value='1000149000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_ACCELERATION_STRUCTURE_MEMORY_INFO_KHR' value='1000165006'/>
      <enumerator name='VK_STRUCTURE_TYPE_WRITE_DESCRIPTOR_SET_ACCELERATION_STRUCTURE_KHR' value='1000165007'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_BUILD_GEOMETRY_INFO_KHR' value='1000150000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_CREATE_GEOMETRY_TYPE_INFO_KHR' value='1000150001'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_DEVICE_ADDRESS_INFO_KHR' value='1000150002'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_GEOMETRY_AABBS_DATA_KHR' value='1000150003'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_GEOMETRY_INSTANCES_DATA_KHR' value='1000150004'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_GEOMETRY_TRIANGLES_DATA_KHR' value='1000150005'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_GEOMETRY_KHR' value='1000150006'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_MEMORY_REQUIREMENTS_INFO_KHR' value='1000150008'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_VERSION_KHR' value='1000150009'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_ACCELERATION_STRUCTURE_INFO_KHR' value='1000150010'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_ACCELERATION_STRUCTURE_TO_MEMORY_INFO_KHR' value='1000150011'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_MEMORY_TO_ACCELERATION_STRUCTURE_INFO_KHR' value='1000150012'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_RAY_TRACING_FEATURES_KHR' value='1000150013'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_RAY_TRACING_PROPERTIES_KHR' value='1000150014'/>
      <enumerator name='VK_STRUCTURE_TYPE_RAY_TRACING_PIPELINE_CREATE_INFO_KHR' value='1000150015'/>
      <enumerator name='VK_STRUCTURE_TYPE_RAY_TRACING_SHADER_GROUP_CREATE_INFO_KHR' value='1000150016'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_CREATE_INFO_KHR' value='1000150017'/>
      <enumerator name='VK_STRUCTURE_TYPE_RAY_TRACING_PIPELINE_INTERFACE_CREATE_INFO_KHR' value='1000150018'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_COVERAGE_MODULATION_STATE_CREATE_INFO_NV' value='1000152000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_SM_BUILTINS_FEATURES_NV' value='1000154000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_SM_BUILTINS_PROPERTIES_NV' value='1000154001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DRM_FORMAT_MODIFIER_PROPERTIES_LIST_EXT' value='1000158000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGE_DRM_FORMAT_MODIFIER_INFO_EXT' value='1000158002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_DRM_FORMAT_MODIFIER_LIST_CREATE_INFO_EXT' value='1000158003'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_DRM_FORMAT_MODIFIER_EXPLICIT_CREATE_INFO_EXT' value='1000158004'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_DRM_FORMAT_MODIFIER_PROPERTIES_EXT' value='1000158005'/>
      <enumerator name='VK_STRUCTURE_TYPE_VALIDATION_CACHE_CREATE_INFO_EXT' value='1000160000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SHADER_MODULE_VALIDATION_CACHE_CREATE_INFO_EXT' value='1000160001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PORTABILITY_SUBSET_FEATURES_KHR' value='1000163000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PORTABILITY_SUBSET_PROPERTIES_KHR' value='1000163001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_SHADING_RATE_IMAGE_STATE_CREATE_INFO_NV' value='1000164000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADING_RATE_IMAGE_FEATURES_NV' value='1000164001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADING_RATE_IMAGE_PROPERTIES_NV' value='1000164002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_COARSE_SAMPLE_ORDER_STATE_CREATE_INFO_NV' value='1000164005'/>
      <enumerator name='VK_STRUCTURE_TYPE_RAY_TRACING_PIPELINE_CREATE_INFO_NV' value='1000165000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_CREATE_INFO_NV' value='1000165001'/>
      <enumerator name='VK_STRUCTURE_TYPE_GEOMETRY_NV' value='1000165003'/>
      <enumerator name='VK_STRUCTURE_TYPE_GEOMETRY_TRIANGLES_NV' value='1000165004'/>
      <enumerator name='VK_STRUCTURE_TYPE_GEOMETRY_AABB_NV' value='1000165005'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_MEMORY_REQUIREMENTS_INFO_NV' value='1000165008'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_RAY_TRACING_PROPERTIES_NV' value='1000165009'/>
      <enumerator name='VK_STRUCTURE_TYPE_RAY_TRACING_SHADER_GROUP_CREATE_INFO_NV' value='1000165011'/>
      <enumerator name='VK_STRUCTURE_TYPE_ACCELERATION_STRUCTURE_INFO_NV' value='1000165012'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_REPRESENTATIVE_FRAGMENT_TEST_FEATURES_NV' value='1000166000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_REPRESENTATIVE_FRAGMENT_TEST_STATE_CREATE_INFO_NV' value='1000166001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGE_VIEW_IMAGE_FORMAT_INFO_EXT' value='1000170000'/>
      <enumerator name='VK_STRUCTURE_TYPE_FILTER_CUBIC_IMAGE_VIEW_IMAGE_FORMAT_PROPERTIES_EXT' value='1000170001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_QUEUE_GLOBAL_PRIORITY_CREATE_INFO_EXT' value='1000174000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMPORT_MEMORY_HOST_POINTER_INFO_EXT' value='1000178000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_HOST_POINTER_PROPERTIES_EXT' value='1000178001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_MEMORY_HOST_PROPERTIES_EXT' value='1000178002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_CLOCK_FEATURES_KHR' value='1000181000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_COMPILER_CONTROL_CREATE_INFO_AMD' value='1000183000'/>
      <enumerator name='VK_STRUCTURE_TYPE_CALIBRATED_TIMESTAMP_INFO_EXT' value='1000184000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_CORE_PROPERTIES_AMD' value='1000185000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_MEMORY_OVERALLOCATION_CREATE_INFO_AMD' value='1000189000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VERTEX_ATTRIBUTE_DIVISOR_PROPERTIES_EXT' value='1000190000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VERTEX_INPUT_DIVISOR_STATE_CREATE_INFO_EXT' value='1000190001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VERTEX_ATTRIBUTE_DIVISOR_FEATURES_EXT' value='1000190002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PRESENT_FRAME_TOKEN_GGP' value='1000191000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_CREATION_FEEDBACK_CREATE_INFO_EXT' value='1000192000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_COMPUTE_SHADER_DERIVATIVES_FEATURES_NV' value='1000201000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MESH_SHADER_FEATURES_NV' value='1000202000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MESH_SHADER_PROPERTIES_NV' value='1000202001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_SHADER_BARYCENTRIC_FEATURES_NV' value='1000203000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_IMAGE_FOOTPRINT_FEATURES_NV' value='1000204000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_EXCLUSIVE_SCISSOR_STATE_CREATE_INFO_NV' value='1000205000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXCLUSIVE_SCISSOR_FEATURES_NV' value='1000205002'/>
      <enumerator name='VK_STRUCTURE_TYPE_CHECKPOINT_DATA_NV' value='1000206000'/>
      <enumerator name='VK_STRUCTURE_TYPE_QUEUE_FAMILY_CHECKPOINT_PROPERTIES_NV' value='1000206001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_INTEGER_FUNCTIONS_2_FEATURES_INTEL' value='1000209000'/>
      <enumerator name='VK_STRUCTURE_TYPE_QUERY_POOL_PERFORMANCE_QUERY_CREATE_INFO_INTEL' value='1000210000'/>
      <enumerator name='VK_STRUCTURE_TYPE_INITIALIZE_PERFORMANCE_API_INFO_INTEL' value='1000210001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PERFORMANCE_MARKER_INFO_INTEL' value='1000210002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PERFORMANCE_STREAM_MARKER_INFO_INTEL' value='1000210003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PERFORMANCE_OVERRIDE_INFO_INTEL' value='1000210004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PERFORMANCE_CONFIGURATION_ACQUIRE_INFO_INTEL' value='1000210005'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PCI_BUS_INFO_PROPERTIES_EXT' value='1000212000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DISPLAY_NATIVE_HDR_SURFACE_CAPABILITIES_AMD' value='1000213000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SWAPCHAIN_DISPLAY_NATIVE_HDR_CREATE_INFO_AMD' value='1000213001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGEPIPE_SURFACE_CREATE_INFO_FUCHSIA' value='1000214000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_TERMINATE_INVOCATION_FEATURES_KHR' value='1000215000'/>
      <enumerator name='VK_STRUCTURE_TYPE_METAL_SURFACE_CREATE_INFO_EXT' value='1000217000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_DENSITY_MAP_FEATURES_EXT' value='1000218000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_DENSITY_MAP_PROPERTIES_EXT' value='1000218001'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_FRAGMENT_DENSITY_MAP_CREATE_INFO_EXT' value='1000218002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SUBGROUP_SIZE_CONTROL_PROPERTIES_EXT' value='1000225000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_SHADER_STAGE_REQUIRED_SUBGROUP_SIZE_CREATE_INFO_EXT' value='1000225001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SUBGROUP_SIZE_CONTROL_FEATURES_EXT' value='1000225002'/>
      <enumerator name='VK_STRUCTURE_TYPE_FRAGMENT_SHADING_RATE_ATTACHMENT_INFO_KHR' value='1000226000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_FRAGMENT_SHADING_RATE_STATE_CREATE_INFO_KHR' value='1000226001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_SHADING_RATE_PROPERTIES_KHR' value='1000226002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_SHADING_RATE_FEATURES_KHR' value='1000226003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_SHADING_RATE_KHR' value='1000226004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_CORE_PROPERTIES_2_AMD' value='1000227000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_COHERENT_MEMORY_FEATURES_AMD' value='1000229000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_IMAGE_ATOMIC_INT64_FEATURES_EXT' value='1000234000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MEMORY_BUDGET_PROPERTIES_EXT' value='1000237000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MEMORY_PRIORITY_FEATURES_EXT' value='1000238000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_PRIORITY_ALLOCATE_INFO_EXT' value='1000238001'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_PROTECTED_CAPABILITIES_KHR' value='1000239000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DEDICATED_ALLOCATION_IMAGE_ALIASING_FEATURES_NV' value='1000240000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BUFFER_DEVICE_ADDRESS_FEATURES_EXT' value='1000244000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_DEVICE_ADDRESS_CREATE_INFO_EXT' value='1000244002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TOOL_PROPERTIES_EXT' value='1000245000'/>
      <enumerator name='VK_STRUCTURE_TYPE_VALIDATION_FEATURES_EXT' value='1000247000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_COOPERATIVE_MATRIX_FEATURES_NV' value='1000249000'/>
      <enumerator name='VK_STRUCTURE_TYPE_COOPERATIVE_MATRIX_PROPERTIES_NV' value='1000249001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_COOPERATIVE_MATRIX_PROPERTIES_NV' value='1000249002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_COVERAGE_REDUCTION_MODE_FEATURES_NV' value='1000250000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_COVERAGE_REDUCTION_STATE_CREATE_INFO_NV' value='1000250001'/>
      <enumerator name='VK_STRUCTURE_TYPE_FRAMEBUFFER_MIXED_SAMPLES_COMBINATION_NV' value='1000250002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_SHADER_INTERLOCK_FEATURES_EXT' value='1000251000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_YCBCR_IMAGE_ARRAYS_FEATURES_EXT' value='1000252000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_FULL_SCREEN_EXCLUSIVE_INFO_EXT' value='1000255000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_CAPABILITIES_FULL_SCREEN_EXCLUSIVE_EXT' value='1000255002'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_FULL_SCREEN_EXCLUSIVE_WIN32_INFO_EXT' value='1000255001'/>
      <enumerator name='VK_STRUCTURE_TYPE_HEADLESS_SURFACE_CREATE_INFO_EXT' value='1000256000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_LINE_RASTERIZATION_FEATURES_EXT' value='1000259000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_LINE_STATE_CREATE_INFO_EXT' value='1000259001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_LINE_RASTERIZATION_PROPERTIES_EXT' value='1000259002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_ATOMIC_FLOAT_FEATURES_EXT' value='1000260000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_INDEX_TYPE_UINT8_FEATURES_EXT' value='1000265000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTENDED_DYNAMIC_STATE_FEATURES_EXT' value='1000267000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEFERRED_OPERATION_INFO_KHR' value='1000268000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PIPELINE_EXECUTABLE_PROPERTIES_FEATURES_KHR' value='1000269000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_INFO_KHR' value='1000269001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_EXECUTABLE_PROPERTIES_KHR' value='1000269002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_EXECUTABLE_INFO_KHR' value='1000269003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_EXECUTABLE_STATISTIC_KHR' value='1000269004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_EXECUTABLE_INTERNAL_REPRESENTATION_KHR' value='1000269005'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_DEMOTE_TO_HELPER_INVOCATION_FEATURES_EXT' value='1000276000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DEVICE_GENERATED_COMMANDS_PROPERTIES_NV' value='1000277000'/>
      <enumerator name='VK_STRUCTURE_TYPE_GRAPHICS_SHADER_GROUP_CREATE_INFO_NV' value='1000277001'/>
      <enumerator name='VK_STRUCTURE_TYPE_GRAPHICS_PIPELINE_SHADER_GROUPS_CREATE_INFO_NV' value='1000277002'/>
      <enumerator name='VK_STRUCTURE_TYPE_INDIRECT_COMMANDS_LAYOUT_TOKEN_NV' value='1000277003'/>
      <enumerator name='VK_STRUCTURE_TYPE_INDIRECT_COMMANDS_LAYOUT_CREATE_INFO_NV' value='1000277004'/>
      <enumerator name='VK_STRUCTURE_TYPE_GENERATED_COMMANDS_INFO_NV' value='1000277005'/>
      <enumerator name='VK_STRUCTURE_TYPE_GENERATED_COMMANDS_MEMORY_REQUIREMENTS_INFO_NV' value='1000277006'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DEVICE_GENERATED_COMMANDS_FEATURES_NV' value='1000277007'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TEXEL_BUFFER_ALIGNMENT_FEATURES_EXT' value='1000281000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TEXEL_BUFFER_ALIGNMENT_PROPERTIES_EXT' value='1000281001'/>
      <enumerator name='VK_STRUCTURE_TYPE_COMMAND_BUFFER_INHERITANCE_RENDER_PASS_TRANSFORM_INFO_QCOM' value='1000282000'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_TRANSFORM_BEGIN_INFO_QCOM' value='1000282001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DEVICE_MEMORY_REPORT_FEATURES_EXT' value='1000284000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_DEVICE_MEMORY_REPORT_CREATE_INFO_EXT' value='1000284001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_MEMORY_REPORT_CALLBACK_DATA_EXT' value='1000284002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_ROBUSTNESS_2_FEATURES_EXT' value='1000286000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_ROBUSTNESS_2_PROPERTIES_EXT' value='1000286001'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_CUSTOM_BORDER_COLOR_CREATE_INFO_EXT' value='1000287000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_CUSTOM_BORDER_COLOR_PROPERTIES_EXT' value='1000287001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_CUSTOM_BORDER_COLOR_FEATURES_EXT' value='1000287002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_LIBRARY_CREATE_INFO_KHR' value='1000290000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PRIVATE_DATA_FEATURES_EXT' value='1000295000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_PRIVATE_DATA_CREATE_INFO_EXT' value='1000295001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PRIVATE_DATA_SLOT_CREATE_INFO_EXT' value='1000295002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PIPELINE_CREATION_CACHE_CONTROL_FEATURES_EXT' value='1000297000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DIAGNOSTICS_CONFIG_FEATURES_NV' value='1000300000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_DIAGNOSTICS_CONFIG_CREATE_INFO_NV' value='1000300001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_DENSITY_MAP_2_FEATURES_EXT' value='1000332000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FRAGMENT_DENSITY_MAP_2_PROPERTIES_EXT' value='1000332001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGE_ROBUSTNESS_FEATURES_EXT' value='1000335000'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_BUFFER_INFO_2_KHR' value='1000337000'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_IMAGE_INFO_2_KHR' value='1000337001'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_BUFFER_TO_IMAGE_INFO_2_KHR' value='1000337002'/>
      <enumerator name='VK_STRUCTURE_TYPE_COPY_IMAGE_TO_BUFFER_INFO_2_KHR' value='1000337003'/>
      <enumerator name='VK_STRUCTURE_TYPE_BLIT_IMAGE_INFO_2_KHR' value='1000337004'/>
      <enumerator name='VK_STRUCTURE_TYPE_RESOLVE_IMAGE_INFO_2_KHR' value='1000337005'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_COPY_2_KHR' value='1000337006'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_COPY_2_KHR' value='1000337007'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_BLIT_2_KHR' value='1000337008'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_IMAGE_COPY_2_KHR' value='1000337009'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_RESOLVE_2_KHR' value='1000337010'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_4444_FORMATS_FEATURES_EXT' value='1000340000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DIRECTFB_SURFACE_CREATE_INFO_EXT' value='1000346000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VARIABLE_POINTER_FEATURES' value='1000120000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_DRAW_PARAMETER_FEATURES' value='1000063000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEBUG_REPORT_CREATE_INFO_EXT' value='1000011000'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_MULTIVIEW_CREATE_INFO_KHR' value='1000053000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_FEATURES_KHR' value='1000053001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_PROPERTIES_KHR' value='1000053002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FEATURES_2_KHR' value='1000059000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PROPERTIES_2_KHR' value='1000059001'/>
      <enumerator name='VK_STRUCTURE_TYPE_FORMAT_PROPERTIES_2_KHR' value='1000059002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_FORMAT_PROPERTIES_2_KHR' value='1000059003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGE_FORMAT_INFO_2_KHR' value='1000059004'/>
      <enumerator name='VK_STRUCTURE_TYPE_QUEUE_FAMILY_PROPERTIES_2_KHR' value='1000059005'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MEMORY_PROPERTIES_2_KHR' value='1000059006'/>
      <enumerator name='VK_STRUCTURE_TYPE_SPARSE_IMAGE_FORMAT_PROPERTIES_2_KHR' value='1000059007'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SPARSE_IMAGE_FORMAT_INFO_2_KHR' value='1000059008'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_ALLOCATE_FLAGS_INFO_KHR' value='1000060000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_RENDER_PASS_BEGIN_INFO_KHR' value='1000060003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_COMMAND_BUFFER_BEGIN_INFO_KHR' value='1000060004'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_SUBMIT_INFO_KHR' value='1000060005'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_BIND_SPARSE_INFO_KHR' value='1000060006'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_BUFFER_MEMORY_DEVICE_GROUP_INFO_KHR' value='1000060013'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_IMAGE_MEMORY_DEVICE_GROUP_INFO_KHR' value='1000060014'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_GROUP_PROPERTIES_KHR' value='1000070000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_GROUP_DEVICE_CREATE_INFO_KHR' value='1000070001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_IMAGE_FORMAT_INFO_KHR' value='1000071000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_IMAGE_FORMAT_PROPERTIES_KHR' value='1000071001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_BUFFER_INFO_KHR' value='1000071002'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_BUFFER_PROPERTIES_KHR' value='1000071003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_ID_PROPERTIES_KHR' value='1000071004'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_BUFFER_CREATE_INFO_KHR' value='1000072000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_IMAGE_CREATE_INFO_KHR' value='1000072001'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_MEMORY_ALLOCATE_INFO_KHR' value='1000072002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_SEMAPHORE_INFO_KHR' value='1000076000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_SEMAPHORE_PROPERTIES_KHR' value='1000076001'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_SEMAPHORE_CREATE_INFO_KHR' value='1000077000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_FLOAT16_INT8_FEATURES_KHR' value='1000082000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FLOAT16_INT8_FEATURES_KHR' value='1000082000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_16BIT_STORAGE_FEATURES_KHR' value='1000083000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_UPDATE_TEMPLATE_CREATE_INFO_KHR' value='1000085000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SURFACE_CAPABILITIES2_EXT' value='1000090000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGELESS_FRAMEBUFFER_FEATURES_KHR' value='1000108000'/>
      <enumerator name='VK_STRUCTURE_TYPE_FRAMEBUFFER_ATTACHMENTS_CREATE_INFO_KHR' value='1000108001'/>
      <enumerator name='VK_STRUCTURE_TYPE_FRAMEBUFFER_ATTACHMENT_IMAGE_INFO_KHR' value='1000108002'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_ATTACHMENT_BEGIN_INFO_KHR' value='1000108003'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_DESCRIPTION_2_KHR' value='1000109000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_REFERENCE_2_KHR' value='1000109001'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_DESCRIPTION_2_KHR' value='1000109002'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_DEPENDENCY_2_KHR' value='1000109003'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_CREATE_INFO_2_KHR' value='1000109004'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_BEGIN_INFO_KHR' value='1000109005'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_END_INFO_KHR' value='1000109006'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_FENCE_INFO_KHR' value='1000112000'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXTERNAL_FENCE_PROPERTIES_KHR' value='1000112001'/>
      <enumerator name='VK_STRUCTURE_TYPE_EXPORT_FENCE_CREATE_INFO_KHR' value='1000113000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_POINT_CLIPPING_PROPERTIES_KHR' value='1000117000'/>
      <enumerator name='VK_STRUCTURE_TYPE_RENDER_PASS_INPUT_ATTACHMENT_ASPECT_CREATE_INFO_KHR' value='1000117001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_VIEW_USAGE_CREATE_INFO_KHR' value='1000117002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PIPELINE_TESSELLATION_DOMAIN_ORIGIN_STATE_CREATE_INFO_KHR' value='1000117003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VARIABLE_POINTERS_FEATURES_KHR' value='1000120000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VARIABLE_POINTER_FEATURES_KHR' value='1000120000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_DEDICATED_REQUIREMENTS_KHR' value='1000127000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_DEDICATED_ALLOCATE_INFO_KHR' value='1000127001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SAMPLER_FILTER_MINMAX_PROPERTIES_EXT' value='1000130000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_REDUCTION_MODE_CREATE_INFO_EXT' value='1000130001'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_MEMORY_REQUIREMENTS_INFO_2_KHR' value='1000146000'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_MEMORY_REQUIREMENTS_INFO_2_KHR' value='1000146001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_SPARSE_MEMORY_REQUIREMENTS_INFO_2_KHR' value='1000146002'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_REQUIREMENTS_2_KHR' value='1000146003'/>
      <enumerator name='VK_STRUCTURE_TYPE_SPARSE_IMAGE_MEMORY_REQUIREMENTS_2_KHR' value='1000146004'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_FORMAT_LIST_CREATE_INFO_KHR' value='1000147000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_YCBCR_CONVERSION_CREATE_INFO_KHR' value='1000156000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_YCBCR_CONVERSION_INFO_KHR' value='1000156001'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_IMAGE_PLANE_MEMORY_INFO_KHR' value='1000156002'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_PLANE_MEMORY_REQUIREMENTS_INFO_KHR' value='1000156003'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SAMPLER_YCBCR_CONVERSION_FEATURES_KHR' value='1000156004'/>
      <enumerator name='VK_STRUCTURE_TYPE_SAMPLER_YCBCR_CONVERSION_IMAGE_FORMAT_PROPERTIES_KHR' value='1000156005'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_BUFFER_MEMORY_INFO_KHR' value='1000157000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_IMAGE_MEMORY_INFO_KHR' value='1000157001'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_BINDING_FLAGS_CREATE_INFO_EXT' value='1000161000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DESCRIPTOR_INDEXING_FEATURES_EXT' value='1000161001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DESCRIPTOR_INDEXING_PROPERTIES_EXT' value='1000161002'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_VARIABLE_DESCRIPTOR_COUNT_ALLOCATE_INFO_EXT' value='1000161003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_VARIABLE_DESCRIPTOR_COUNT_LAYOUT_SUPPORT_EXT' value='1000161004'/>
      <enumerator name='VK_STRUCTURE_TYPE_BIND_ACCELERATION_STRUCTURE_MEMORY_INFO_NV' value='1000165006'/>
      <enumerator name='VK_STRUCTURE_TYPE_WRITE_DESCRIPTOR_SET_ACCELERATION_STRUCTURE_NV' value='1000165007'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MAINTENANCE_3_PROPERTIES_KHR' value='1000168000'/>
      <enumerator name='VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_SUPPORT_KHR' value='1000168001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_SUBGROUP_EXTENDED_TYPES_FEATURES_KHR' value='1000175000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_8BIT_STORAGE_FEATURES_KHR' value='1000177000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SHADER_ATOMIC_INT64_FEATURES_KHR' value='1000180000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DRIVER_PROPERTIES_KHR' value='1000196000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FLOAT_CONTROLS_PROPERTIES_KHR' value='1000197000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DEPTH_STENCIL_RESOLVE_PROPERTIES_KHR' value='1000199000'/>
      <enumerator name='VK_STRUCTURE_TYPE_SUBPASS_DESCRIPTION_DEPTH_STENCIL_RESOLVE_KHR' value='1000199001'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TIMELINE_SEMAPHORE_FEATURES_KHR' value='1000207000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_TIMELINE_SEMAPHORE_PROPERTIES_KHR' value='1000207001'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_TYPE_CREATE_INFO_KHR' value='1000207002'/>
      <enumerator name='VK_STRUCTURE_TYPE_TIMELINE_SEMAPHORE_SUBMIT_INFO_KHR' value='1000207003'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_WAIT_INFO_KHR' value='1000207004'/>
      <enumerator name='VK_STRUCTURE_TYPE_SEMAPHORE_SIGNAL_INFO_KHR' value='1000207005'/>
      <enumerator name='VK_STRUCTURE_TYPE_QUERY_POOL_CREATE_INFO_INTEL' value='1000210000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VULKAN_MEMORY_MODEL_FEATURES_KHR' value='1000211000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SCALAR_BLOCK_LAYOUT_FEATURES_EXT' value='1000221000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SEPARATE_DEPTH_STENCIL_LAYOUTS_FEATURES_KHR' value='1000241000'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_REFERENCE_STENCIL_LAYOUT_KHR' value='1000241001'/>
      <enumerator name='VK_STRUCTURE_TYPE_ATTACHMENT_DESCRIPTION_STENCIL_LAYOUT_KHR' value='1000241002'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BUFFER_ADDRESS_FEATURES_EXT' value='1000244000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_DEVICE_ADDRESS_INFO_EXT' value='1000244001'/>
      <enumerator name='VK_STRUCTURE_TYPE_IMAGE_STENCIL_USAGE_CREATE_INFO_EXT' value='1000246000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_UNIFORM_BUFFER_STANDARD_LAYOUT_FEATURES_KHR' value='1000253000'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BUFFER_DEVICE_ADDRESS_FEATURES_KHR' value='1000257000'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_DEVICE_ADDRESS_INFO_KHR' value='1000244001'/>
      <enumerator name='VK_STRUCTURE_TYPE_BUFFER_OPAQUE_CAPTURE_ADDRESS_CREATE_INFO_KHR' value='1000257002'/>
      <enumerator name='VK_STRUCTURE_TYPE_MEMORY_OPAQUE_CAPTURE_ADDRESS_ALLOCATE_INFO_KHR' value='1000257003'/>
      <enumerator name='VK_STRUCTURE_TYPE_DEVICE_MEMORY_OPAQUE_CAPTURE_ADDRESS_INFO_KHR' value='1000257004'/>
      <enumerator name='VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_HOST_QUERY_RESET_FEATURES_EXT' value='1000261000'/>
      <enumerator name='VK_STRUCTURE_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='VkExternalFenceHandleTypeFlagBits' type-id='973e7875' id='343e0279'/>
    <typedef-decl name='VkSystemAllocationScope' type-id='c59f1a7c' id='343e7d20'/>
    <typedef-decl name='VkSemaphoreSignalInfo' type-id='59090758' id='344641db'/>
    <pointer-type-def type-id='777a3c35' size-in-bits='32' id='346ca4cd'/>
    <qualified-type-def type-id='0fb0212f' const='yes' id='34d01c5f'/>
    <pointer-type-def type-id='f67629f4' size-in-bits='32' id='34e25e76'/>
    <pointer-type-def type-id='0d65ce34' size-in-bits='32' id='3543793a'/>
    <typedef-decl name='VkPipelineShaderStageCreateInfo' type-id='0f00d8e9' id='35ac5d2e'/>
    <typedef-decl name='VkResult' type-id='a2b8b282' id='35c4f486'/>
    <qualified-type-def type-id='261ddca0' const='yes' id='35cb7770'/>
    <qualified-type-def type-id='88d80257' const='yes' id='3641e967'/>
    <enum-decl name='VkImageType' id='3660eff8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_IMAGE_TYPE_1D' value='0'/>
      <enumerator name='VK_IMAGE_TYPE_2D' value='1'/>
      <enumerator name='VK_IMAGE_TYPE_3D' value='2'/>
      <enumerator name='VK_IMAGE_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='df345276' size-in-bits='32' id='36a66de3'/>
    <qualified-type-def type-id='cb6055ee' const='yes' id='36d219be'/>
    <typedef-decl name='VkImageSubresourceLayers' type-id='fde950ad' id='3773b0a0'/>
    <typedef-decl name='VkImageViewType' type-id='8ef7a5e9' id='37c629d5'/>
    <typedef-decl name='VkStencilOp' type-id='712391b6' id='3813153a'/>
    <qualified-type-def type-id='0f18d23c' const='yes' id='381d866c'/>
    <pointer-type-def type-id='479f8d52' size-in-bits='32' id='382bb3e8'/>
    <qualified-type-def type-id='fbbeee8b' const='yes' id='383b2b7b'/>
    <pointer-type-def type-id='99abe9ae' size-in-bits='32' id='386b0089'/>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='1024' id='388e96b8'>
      <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
    </array-type-def>
    <class-decl name='VkVertexInputAttributeDescription' size-in-bits='128' is-struct='yes' visibility='default' id='38d2dcda'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='location' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='binding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='13aa8748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='offset' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='4b33a25d' size-in-bits='32' id='3995905c'/>
    <typedef-decl name='VkDescriptorSetLayoutSupport' type-id='eb2101e6' id='39aa3977'/>
    <pointer-type-def type-id='6d019687' size-in-bits='32' id='3aca4fe0'/>
    <pointer-type-def type-id='c8ea9458' size-in-bits='32' id='3ad2cb71'/>
    <typedef-decl name='VkPipelineInputAssemblyStateCreateFlags' type-id='c1850196' id='3aff0763'/>
    <pointer-type-def type-id='13000478' size-in-bits='32' id='3b06cd16'/>
    <pointer-type-def type-id='c8f138c2' size-in-bits='32' id='3bbc9538'/>
    <pointer-type-def type-id='9aea7077' size-in-bits='32' id='3c0ee267'/>
    <class-decl name='VkDeviceQueueCreateInfo' size-in-bits='192' is-struct='yes' visibility='default' id='3c6ae4b3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='c54f7d3f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='queueFamilyIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='queueCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pQueuePriorities' type-id='bc47ccdc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkFenceCreateInfo' size-in-bits='96' is-struct='yes' visibility='default' id='3c9b0b2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='25e5e7ef' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='VkImageLayout' id='3cb58596'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_IMAGE_LAYOUT_UNDEFINED' value='0'/>
      <enumerator name='VK_IMAGE_LAYOUT_GENERAL' value='1'/>
      <enumerator name='VK_IMAGE_LAYOUT_COLOR_ATTACHMENT_OPTIMAL' value='2'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_STENCIL_ATTACHMENT_OPTIMAL' value='3'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_STENCIL_READ_ONLY_OPTIMAL' value='4'/>
      <enumerator name='VK_IMAGE_LAYOUT_SHADER_READ_ONLY_OPTIMAL' value='5'/>
      <enumerator name='VK_IMAGE_LAYOUT_TRANSFER_SRC_OPTIMAL' value='6'/>
      <enumerator name='VK_IMAGE_LAYOUT_TRANSFER_DST_OPTIMAL' value='7'/>
      <enumerator name='VK_IMAGE_LAYOUT_PREINITIALIZED' value='8'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_READ_ONLY_STENCIL_ATTACHMENT_OPTIMAL' value='1000117000'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_ATTACHMENT_STENCIL_READ_ONLY_OPTIMAL' value='1000117001'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_ATTACHMENT_OPTIMAL' value='1000241000'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_READ_ONLY_OPTIMAL' value='1000241001'/>
      <enumerator name='VK_IMAGE_LAYOUT_STENCIL_ATTACHMENT_OPTIMAL' value='1000241002'/>
      <enumerator name='VK_IMAGE_LAYOUT_STENCIL_READ_ONLY_OPTIMAL' value='1000241003'/>
      <enumerator name='VK_IMAGE_LAYOUT_PRESENT_SRC_KHR' value='1000001002'/>
      <enumerator name='VK_IMAGE_LAYOUT_SHARED_PRESENT_KHR' value='1000111000'/>
      <enumerator name='VK_IMAGE_LAYOUT_SHADING_RATE_OPTIMAL_NV' value='1000164003'/>
      <enumerator name='VK_IMAGE_LAYOUT_FRAGMENT_DENSITY_MAP_OPTIMAL_EXT' value='1000218000'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_READ_ONLY_STENCIL_ATTACHMENT_OPTIMAL_KHR' value='1000117000'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_ATTACHMENT_STENCIL_READ_ONLY_OPTIMAL_KHR' value='1000117001'/>
      <enumerator name='VK_IMAGE_LAYOUT_FRAGMENT_SHADING_RATE_ATTACHMENT_OPTIMAL_KHR' value='1000164003'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_ATTACHMENT_OPTIMAL_KHR' value='1000241000'/>
      <enumerator name='VK_IMAGE_LAYOUT_DEPTH_READ_ONLY_OPTIMAL_KHR' value='1000241001'/>
      <enumerator name='VK_IMAGE_LAYOUT_STENCIL_ATTACHMENT_OPTIMAL_KHR' value='1000241002'/>
      <enumerator name='VK_IMAGE_LAYOUT_STENCIL_READ_ONLY_OPTIMAL_KHR' value='1000241003'/>
      <enumerator name='VK_IMAGE_LAYOUT_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkImageCreateFlags' type-id='c1850196' id='3cc36d43'/>
    <typedef-decl name='VkPipelineBindPoint' type-id='94bf23f0' id='3ce0c7c4'/>
    <qualified-type-def type-id='deed538c' const='yes' id='3d73dfdc'/>
    <class-decl name='VkMemoryRequirements' size-in-bits='192' is-struct='yes' visibility='default' id='3d82a05d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alignment' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memoryTypeBits' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkDescriptorType' type-id='af65e24a' id='3e0c9bce'/>
    <class-decl name='VkClearDepthStencilValue' size-in-bits='64' is-struct='yes' visibility='default' id='3eabcefd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='depth' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='stencil' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='05d40e38' size-in-bits='32' id='3ed22656'/>
    <array-type-def dimensions='1' type-id='1c6a5890' size-in-bits='2048' id='3f0a205e'>
      <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
    </array-type-def>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='VkAllocationCallbacks' type-id='8f340254' id='402919e3'/>
    <typedef-decl name='VkSwapchainKHR' type-id='9c313c2d' id='40498d50'/>
    <class-decl name='VkSubpassDependency2' size-in-bits='320' is-struct='yes' visibility='default' id='40869cb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srcSubpass' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dstSubpass' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srcStageMask' type-id='5b07f658' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dstStageMask' type-id='5b07f658' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='srcAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dstAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dependencyFlags' type-id='169f4e95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='viewOffset' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='native_handle_t' type-id='3181ea79' id='40cec2e5'/>
    <class-decl name='VkRenderPassBeginInfo' size-in-bits='384' is-struct='yes' visibility='default' id='40fdcf18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='renderPass' type-id='df345276' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='framebuffer' type-id='67cc387e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='renderArea' type-id='4e73dcf7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clearValueCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='pClearValues' type-id='2fe07ee1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkBlendOp' type-id='06bac29d' id='412f6ab1'/>
    <pointer-type-def type-id='8e8988f5' size-in-bits='32' id='4182770d'/>
    <typedef-decl name='VkCommandBufferInheritanceInfo' type-id='7ceec78f' id='41cb3b96'/>
    <class-decl name='VkPipelineCacheCreateInfo' size-in-bits='160' is-struct='yes' visibility='default' id='41f7d8c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='2998bdd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='initialDataSize' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pInitialData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='a1ad6b94' size-in-bits='32' id='42009c1a'/>
    <pointer-type-def type-id='c421cfab' size-in-bits='32' id='4239a813'/>
    <pointer-type-def type-id='4bdc07fd' size-in-bits='32' id='42605775'/>
    <typedef-decl name='VkDeviceQueueCreateInfo' type-id='3c6ae4b3' id='42d6b370'/>
    <typedef-decl name='VkCommandPoolCreateInfo' type-id='7b2314ad' id='43012ac6'/>
    <class-decl name='VkMemoryRequirements2' size-in-bits='256' is-struct='yes' visibility='default' id='43a28ebd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memoryRequirements' type-id='4c672ee0' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='16cbd04b' size-in-bits='32' id='43d908b3'/>
    <typedef-decl name='VkDeviceCreateInfo' type-id='29a97c58' id='449beb5d'/>
    <typedef-decl name='VkPhysicalDeviceProperties2' type-id='a7f5d036' id='44ca7319'/>
    <typedef-decl name='VkPipelineLayoutCreateFlags' type-id='c1850196' id='44d6fa4a'/>
    <typedef-decl name='VkDescriptorPoolResetFlags' type-id='c1850196' id='45abbdba'/>
    <enum-decl name='VkDescriptorUpdateTemplateType' id='4668c5d9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_DESCRIPTOR_SET' value='0'/>
      <enumerator name='VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_PUSH_DESCRIPTORS_KHR' value='1'/>
      <enumerator name='VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_DESCRIPTOR_SET_KHR' value='0'/>
      <enumerator name='VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkRenderPassBeginInfo' type-id='40fdcf18' id='46b8282f'/>
    <class-decl name='VkImageMemoryBarrier' size-in-bits='512' is-struct='yes' visibility='default' id='47200abf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srcAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dstAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='oldLayout' type-id='dad72c2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='newLayout' type-id='dad72c2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='srcQueueFamilyIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dstQueueFamilyIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='image' type-id='c858cae4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='subresourceRange' type-id='fbbeee8b' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c1768390' size-in-bits='32' id='47915dce'/>
    <qualified-type-def type-id='64584262' const='yes' id='479f8d52'/>
    <pointer-type-def type-id='c6288e7c' size-in-bits='32' id='47d81162'/>
    <typedef-decl name='VkClearValue' type-id='accbee71' id='4804d881'/>
    <qualified-type-def type-id='14a911c6' const='yes' id='4870f976'/>
    <pointer-type-def type-id='93a4ed24' size-in-bits='32' id='487691f9'/>
    <pointer-type-def type-id='5da805f3' size-in-bits='32' id='4881349b'/>
    <pointer-type-def type-id='81905a9c' size-in-bits='32' id='4895e6ee'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='VkPipelineDepthStencilStateCreateFlags' type-id='c1850196' id='48cfe726'/>
    <pointer-type-def type-id='a8e74c4f' size-in-bits='32' id='491d42ff'/>
    <typedef-decl name='VkImageMemoryBarrier' type-id='47200abf' id='49493b26'/>
    <pointer-type-def type-id='c858cae4' size-in-bits='32' id='495efbd3'/>
    <class-decl name='VkAttachmentReference2' size-in-bits='160' is-struct='yes' visibility='default' id='49893166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attachment' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='layout' type-id='dad72c2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aspectMask' type-id='241096e7' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='e5e14142' size-in-bits='32' id='4999f6b8'/>
    <typedef-decl name='VkMemoryPropertyFlags' type-id='c1850196' id='49b55738'/>
    <enum-decl name='VkFormat' id='4a7bb114'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_FORMAT_UNDEFINED' value='0'/>
      <enumerator name='VK_FORMAT_R4G4_UNORM_PACK8' value='1'/>
      <enumerator name='VK_FORMAT_R4G4B4A4_UNORM_PACK16' value='2'/>
      <enumerator name='VK_FORMAT_B4G4R4A4_UNORM_PACK16' value='3'/>
      <enumerator name='VK_FORMAT_R5G6B5_UNORM_PACK16' value='4'/>
      <enumerator name='VK_FORMAT_B5G6R5_UNORM_PACK16' value='5'/>
      <enumerator name='VK_FORMAT_R5G5B5A1_UNORM_PACK16' value='6'/>
      <enumerator name='VK_FORMAT_B5G5R5A1_UNORM_PACK16' value='7'/>
      <enumerator name='VK_FORMAT_A1R5G5B5_UNORM_PACK16' value='8'/>
      <enumerator name='VK_FORMAT_R8_UNORM' value='9'/>
      <enumerator name='VK_FORMAT_R8_SNORM' value='10'/>
      <enumerator name='VK_FORMAT_R8_USCALED' value='11'/>
      <enumerator name='VK_FORMAT_R8_SSCALED' value='12'/>
      <enumerator name='VK_FORMAT_R8_UINT' value='13'/>
      <enumerator name='VK_FORMAT_R8_SINT' value='14'/>
      <enumerator name='VK_FORMAT_R8_SRGB' value='15'/>
      <enumerator name='VK_FORMAT_R8G8_UNORM' value='16'/>
      <enumerator name='VK_FORMAT_R8G8_SNORM' value='17'/>
      <enumerator name='VK_FORMAT_R8G8_USCALED' value='18'/>
      <enumerator name='VK_FORMAT_R8G8_SSCALED' value='19'/>
      <enumerator name='VK_FORMAT_R8G8_UINT' value='20'/>
      <enumerator name='VK_FORMAT_R8G8_SINT' value='21'/>
      <enumerator name='VK_FORMAT_R8G8_SRGB' value='22'/>
      <enumerator name='VK_FORMAT_R8G8B8_UNORM' value='23'/>
      <enumerator name='VK_FORMAT_R8G8B8_SNORM' value='24'/>
      <enumerator name='VK_FORMAT_R8G8B8_USCALED' value='25'/>
      <enumerator name='VK_FORMAT_R8G8B8_SSCALED' value='26'/>
      <enumerator name='VK_FORMAT_R8G8B8_UINT' value='27'/>
      <enumerator name='VK_FORMAT_R8G8B8_SINT' value='28'/>
      <enumerator name='VK_FORMAT_R8G8B8_SRGB' value='29'/>
      <enumerator name='VK_FORMAT_B8G8R8_UNORM' value='30'/>
      <enumerator name='VK_FORMAT_B8G8R8_SNORM' value='31'/>
      <enumerator name='VK_FORMAT_B8G8R8_USCALED' value='32'/>
      <enumerator name='VK_FORMAT_B8G8R8_SSCALED' value='33'/>
      <enumerator name='VK_FORMAT_B8G8R8_UINT' value='34'/>
      <enumerator name='VK_FORMAT_B8G8R8_SINT' value='35'/>
      <enumerator name='VK_FORMAT_B8G8R8_SRGB' value='36'/>
      <enumerator name='VK_FORMAT_R8G8B8A8_UNORM' value='37'/>
      <enumerator name='VK_FORMAT_R8G8B8A8_SNORM' value='38'/>
      <enumerator name='VK_FORMAT_R8G8B8A8_USCALED' value='39'/>
      <enumerator name='VK_FORMAT_R8G8B8A8_SSCALED' value='40'/>
      <enumerator name='VK_FORMAT_R8G8B8A8_UINT' value='41'/>
      <enumerator name='VK_FORMAT_R8G8B8A8_SINT' value='42'/>
      <enumerator name='VK_FORMAT_R8G8B8A8_SRGB' value='43'/>
      <enumerator name='VK_FORMAT_B8G8R8A8_UNORM' value='44'/>
      <enumerator name='VK_FORMAT_B8G8R8A8_SNORM' value='45'/>
      <enumerator name='VK_FORMAT_B8G8R8A8_USCALED' value='46'/>
      <enumerator name='VK_FORMAT_B8G8R8A8_SSCALED' value='47'/>
      <enumerator name='VK_FORMAT_B8G8R8A8_UINT' value='48'/>
      <enumerator name='VK_FORMAT_B8G8R8A8_SINT' value='49'/>
      <enumerator name='VK_FORMAT_B8G8R8A8_SRGB' value='50'/>
      <enumerator name='VK_FORMAT_A8B8G8R8_UNORM_PACK32' value='51'/>
      <enumerator name='VK_FORMAT_A8B8G8R8_SNORM_PACK32' value='52'/>
      <enumerator name='VK_FORMAT_A8B8G8R8_USCALED_PACK32' value='53'/>
      <enumerator name='VK_FORMAT_A8B8G8R8_SSCALED_PACK32' value='54'/>
      <enumerator name='VK_FORMAT_A8B8G8R8_UINT_PACK32' value='55'/>
      <enumerator name='VK_FORMAT_A8B8G8R8_SINT_PACK32' value='56'/>
      <enumerator name='VK_FORMAT_A8B8G8R8_SRGB_PACK32' value='57'/>
      <enumerator name='VK_FORMAT_A2R10G10B10_UNORM_PACK32' value='58'/>
      <enumerator name='VK_FORMAT_A2R10G10B10_SNORM_PACK32' value='59'/>
      <enumerator name='VK_FORMAT_A2R10G10B10_USCALED_PACK32' value='60'/>
      <enumerator name='VK_FORMAT_A2R10G10B10_SSCALED_PACK32' value='61'/>
      <enumerator name='VK_FORMAT_A2R10G10B10_UINT_PACK32' value='62'/>
      <enumerator name='VK_FORMAT_A2R10G10B10_SINT_PACK32' value='63'/>
      <enumerator name='VK_FORMAT_A2B10G10R10_UNORM_PACK32' value='64'/>
      <enumerator name='VK_FORMAT_A2B10G10R10_SNORM_PACK32' value='65'/>
      <enumerator name='VK_FORMAT_A2B10G10R10_USCALED_PACK32' value='66'/>
      <enumerator name='VK_FORMAT_A2B10G10R10_SSCALED_PACK32' value='67'/>
      <enumerator name='VK_FORMAT_A2B10G10R10_UINT_PACK32' value='68'/>
      <enumerator name='VK_FORMAT_A2B10G10R10_SINT_PACK32' value='69'/>
      <enumerator name='VK_FORMAT_R16_UNORM' value='70'/>
      <enumerator name='VK_FORMAT_R16_SNORM' value='71'/>
      <enumerator name='VK_FORMAT_R16_USCALED' value='72'/>
      <enumerator name='VK_FORMAT_R16_SSCALED' value='73'/>
      <enumerator name='VK_FORMAT_R16_UINT' value='74'/>
      <enumerator name='VK_FORMAT_R16_SINT' value='75'/>
      <enumerator name='VK_FORMAT_R16_SFLOAT' value='76'/>
      <enumerator name='VK_FORMAT_R16G16_UNORM' value='77'/>
      <enumerator name='VK_FORMAT_R16G16_SNORM' value='78'/>
      <enumerator name='VK_FORMAT_R16G16_USCALED' value='79'/>
      <enumerator name='VK_FORMAT_R16G16_SSCALED' value='80'/>
      <enumerator name='VK_FORMAT_R16G16_UINT' value='81'/>
      <enumerator name='VK_FORMAT_R16G16_SINT' value='82'/>
      <enumerator name='VK_FORMAT_R16G16_SFLOAT' value='83'/>
      <enumerator name='VK_FORMAT_R16G16B16_UNORM' value='84'/>
      <enumerator name='VK_FORMAT_R16G16B16_SNORM' value='85'/>
      <enumerator name='VK_FORMAT_R16G16B16_USCALED' value='86'/>
      <enumerator name='VK_FORMAT_R16G16B16_SSCALED' value='87'/>
      <enumerator name='VK_FORMAT_R16G16B16_UINT' value='88'/>
      <enumerator name='VK_FORMAT_R16G16B16_SINT' value='89'/>
      <enumerator name='VK_FORMAT_R16G16B16_SFLOAT' value='90'/>
      <enumerator name='VK_FORMAT_R16G16B16A16_UNORM' value='91'/>
      <enumerator name='VK_FORMAT_R16G16B16A16_SNORM' value='92'/>
      <enumerator name='VK_FORMAT_R16G16B16A16_USCALED' value='93'/>
      <enumerator name='VK_FORMAT_R16G16B16A16_SSCALED' value='94'/>
      <enumerator name='VK_FORMAT_R16G16B16A16_UINT' value='95'/>
      <enumerator name='VK_FORMAT_R16G16B16A16_SINT' value='96'/>
      <enumerator name='VK_FORMAT_R16G16B16A16_SFLOAT' value='97'/>
      <enumerator name='VK_FORMAT_R32_UINT' value='98'/>
      <enumerator name='VK_FORMAT_R32_SINT' value='99'/>
      <enumerator name='VK_FORMAT_R32_SFLOAT' value='100'/>
      <enumerator name='VK_FORMAT_R32G32_UINT' value='101'/>
      <enumerator name='VK_FORMAT_R32G32_SINT' value='102'/>
      <enumerator name='VK_FORMAT_R32G32_SFLOAT' value='103'/>
      <enumerator name='VK_FORMAT_R32G32B32_UINT' value='104'/>
      <enumerator name='VK_FORMAT_R32G32B32_SINT' value='105'/>
      <enumerator name='VK_FORMAT_R32G32B32_SFLOAT' value='106'/>
      <enumerator name='VK_FORMAT_R32G32B32A32_UINT' value='107'/>
      <enumerator name='VK_FORMAT_R32G32B32A32_SINT' value='108'/>
      <enumerator name='VK_FORMAT_R32G32B32A32_SFLOAT' value='109'/>
      <enumerator name='VK_FORMAT_R64_UINT' value='110'/>
      <enumerator name='VK_FORMAT_R64_SINT' value='111'/>
      <enumerator name='VK_FORMAT_R64_SFLOAT' value='112'/>
      <enumerator name='VK_FORMAT_R64G64_UINT' value='113'/>
      <enumerator name='VK_FORMAT_R64G64_SINT' value='114'/>
      <enumerator name='VK_FORMAT_R64G64_SFLOAT' value='115'/>
      <enumerator name='VK_FORMAT_R64G64B64_UINT' value='116'/>
      <enumerator name='VK_FORMAT_R64G64B64_SINT' value='117'/>
      <enumerator name='VK_FORMAT_R64G64B64_SFLOAT' value='118'/>
      <enumerator name='VK_FORMAT_R64G64B64A64_UINT' value='119'/>
      <enumerator name='VK_FORMAT_R64G64B64A64_SINT' value='120'/>
      <enumerator name='VK_FORMAT_R64G64B64A64_SFLOAT' value='121'/>
      <enumerator name='VK_FORMAT_B10G11R11_UFLOAT_PACK32' value='122'/>
      <enumerator name='VK_FORMAT_E5B9G9R9_UFLOAT_PACK32' value='123'/>
      <enumerator name='VK_FORMAT_D16_UNORM' value='124'/>
      <enumerator name='VK_FORMAT_X8_D24_UNORM_PACK32' value='125'/>
      <enumerator name='VK_FORMAT_D32_SFLOAT' value='126'/>
      <enumerator name='VK_FORMAT_S8_UINT' value='127'/>
      <enumerator name='VK_FORMAT_D16_UNORM_S8_UINT' value='128'/>
      <enumerator name='VK_FORMAT_D24_UNORM_S8_UINT' value='129'/>
      <enumerator name='VK_FORMAT_D32_SFLOAT_S8_UINT' value='130'/>
      <enumerator name='VK_FORMAT_BC1_RGB_UNORM_BLOCK' value='131'/>
      <enumerator name='VK_FORMAT_BC1_RGB_SRGB_BLOCK' value='132'/>
      <enumerator name='VK_FORMAT_BC1_RGBA_UNORM_BLOCK' value='133'/>
      <enumerator name='VK_FORMAT_BC1_RGBA_SRGB_BLOCK' value='134'/>
      <enumerator name='VK_FORMAT_BC2_UNORM_BLOCK' value='135'/>
      <enumerator name='VK_FORMAT_BC2_SRGB_BLOCK' value='136'/>
      <enumerator name='VK_FORMAT_BC3_UNORM_BLOCK' value='137'/>
      <enumerator name='VK_FORMAT_BC3_SRGB_BLOCK' value='138'/>
      <enumerator name='VK_FORMAT_BC4_UNORM_BLOCK' value='139'/>
      <enumerator name='VK_FORMAT_BC4_SNORM_BLOCK' value='140'/>
      <enumerator name='VK_FORMAT_BC5_UNORM_BLOCK' value='141'/>
      <enumerator name='VK_FORMAT_BC5_SNORM_BLOCK' value='142'/>
      <enumerator name='VK_FORMAT_BC6H_UFLOAT_BLOCK' value='143'/>
      <enumerator name='VK_FORMAT_BC6H_SFLOAT_BLOCK' value='144'/>
      <enumerator name='VK_FORMAT_BC7_UNORM_BLOCK' value='145'/>
      <enumerator name='VK_FORMAT_BC7_SRGB_BLOCK' value='146'/>
      <enumerator name='VK_FORMAT_ETC2_R8G8B8_UNORM_BLOCK' value='147'/>
      <enumerator name='VK_FORMAT_ETC2_R8G8B8_SRGB_BLOCK' value='148'/>
      <enumerator name='VK_FORMAT_ETC2_R8G8B8A1_UNORM_BLOCK' value='149'/>
      <enumerator name='VK_FORMAT_ETC2_R8G8B8A1_SRGB_BLOCK' value='150'/>
      <enumerator name='VK_FORMAT_ETC2_R8G8B8A8_UNORM_BLOCK' value='151'/>
      <enumerator name='VK_FORMAT_ETC2_R8G8B8A8_SRGB_BLOCK' value='152'/>
      <enumerator name='VK_FORMAT_EAC_R11_UNORM_BLOCK' value='153'/>
      <enumerator name='VK_FORMAT_EAC_R11_SNORM_BLOCK' value='154'/>
      <enumerator name='VK_FORMAT_EAC_R11G11_UNORM_BLOCK' value='155'/>
      <enumerator name='VK_FORMAT_EAC_R11G11_SNORM_BLOCK' value='156'/>
      <enumerator name='VK_FORMAT_ASTC_4x4_UNORM_BLOCK' value='157'/>
      <enumerator name='VK_FORMAT_ASTC_4x4_SRGB_BLOCK' value='158'/>
      <enumerator name='VK_FORMAT_ASTC_5x4_UNORM_BLOCK' value='159'/>
      <enumerator name='VK_FORMAT_ASTC_5x4_SRGB_BLOCK' value='160'/>
      <enumerator name='VK_FORMAT_ASTC_5x5_UNORM_BLOCK' value='161'/>
      <enumerator name='VK_FORMAT_ASTC_5x5_SRGB_BLOCK' value='162'/>
      <enumerator name='VK_FORMAT_ASTC_6x5_UNORM_BLOCK' value='163'/>
      <enumerator name='VK_FORMAT_ASTC_6x5_SRGB_BLOCK' value='164'/>
      <enumerator name='VK_FORMAT_ASTC_6x6_UNORM_BLOCK' value='165'/>
      <enumerator name='VK_FORMAT_ASTC_6x6_SRGB_BLOCK' value='166'/>
      <enumerator name='VK_FORMAT_ASTC_8x5_UNORM_BLOCK' value='167'/>
      <enumerator name='VK_FORMAT_ASTC_8x5_SRGB_BLOCK' value='168'/>
      <enumerator name='VK_FORMAT_ASTC_8x6_UNORM_BLOCK' value='169'/>
      <enumerator name='VK_FORMAT_ASTC_8x6_SRGB_BLOCK' value='170'/>
      <enumerator name='VK_FORMAT_ASTC_8x8_UNORM_BLOCK' value='171'/>
      <enumerator name='VK_FORMAT_ASTC_8x8_SRGB_BLOCK' value='172'/>
      <enumerator name='VK_FORMAT_ASTC_10x5_UNORM_BLOCK' value='173'/>
      <enumerator name='VK_FORMAT_ASTC_10x5_SRGB_BLOCK' value='174'/>
      <enumerator name='VK_FORMAT_ASTC_10x6_UNORM_BLOCK' value='175'/>
      <enumerator name='VK_FORMAT_ASTC_10x6_SRGB_BLOCK' value='176'/>
      <enumerator name='VK_FORMAT_ASTC_10x8_UNORM_BLOCK' value='177'/>
      <enumerator name='VK_FORMAT_ASTC_10x8_SRGB_BLOCK' value='178'/>
      <enumerator name='VK_FORMAT_ASTC_10x10_UNORM_BLOCK' value='179'/>
      <enumerator name='VK_FORMAT_ASTC_10x10_SRGB_BLOCK' value='180'/>
      <enumerator name='VK_FORMAT_ASTC_12x10_UNORM_BLOCK' value='181'/>
      <enumerator name='VK_FORMAT_ASTC_12x10_SRGB_BLOCK' value='182'/>
      <enumerator name='VK_FORMAT_ASTC_12x12_UNORM_BLOCK' value='183'/>
      <enumerator name='VK_FORMAT_ASTC_12x12_SRGB_BLOCK' value='184'/>
      <enumerator name='VK_FORMAT_G8B8G8R8_422_UNORM' value='1000156000'/>
      <enumerator name='VK_FORMAT_B8G8R8G8_422_UNORM' value='1000156001'/>
      <enumerator name='VK_FORMAT_G8_B8_R8_3PLANE_420_UNORM' value='1000156002'/>
      <enumerator name='VK_FORMAT_G8_B8R8_2PLANE_420_UNORM' value='1000156003'/>
      <enumerator name='VK_FORMAT_G8_B8_R8_3PLANE_422_UNORM' value='1000156004'/>
      <enumerator name='VK_FORMAT_G8_B8R8_2PLANE_422_UNORM' value='1000156005'/>
      <enumerator name='VK_FORMAT_G8_B8_R8_3PLANE_444_UNORM' value='1000156006'/>
      <enumerator name='VK_FORMAT_R10X6_UNORM_PACK16' value='1000156007'/>
      <enumerator name='VK_FORMAT_R10X6G10X6_UNORM_2PACK16' value='1000156008'/>
      <enumerator name='VK_FORMAT_R10X6G10X6B10X6A10X6_UNORM_4PACK16' value='1000156009'/>
      <enumerator name='VK_FORMAT_G10X6B10X6G10X6R10X6_422_UNORM_4PACK16' value='1000156010'/>
      <enumerator name='VK_FORMAT_B10X6G10X6R10X6G10X6_422_UNORM_4PACK16' value='1000156011'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6_R10X6_3PLANE_420_UNORM_3PACK16' value='1000156012'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6R10X6_2PLANE_420_UNORM_3PACK16' value='1000156013'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6_R10X6_3PLANE_422_UNORM_3PACK16' value='1000156014'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6R10X6_2PLANE_422_UNORM_3PACK16' value='1000156015'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6_R10X6_3PLANE_444_UNORM_3PACK16' value='1000156016'/>
      <enumerator name='VK_FORMAT_R12X4_UNORM_PACK16' value='1000156017'/>
      <enumerator name='VK_FORMAT_R12X4G12X4_UNORM_2PACK16' value='1000156018'/>
      <enumerator name='VK_FORMAT_R12X4G12X4B12X4A12X4_UNORM_4PACK16' value='1000156019'/>
      <enumerator name='VK_FORMAT_G12X4B12X4G12X4R12X4_422_UNORM_4PACK16' value='1000156020'/>
      <enumerator name='VK_FORMAT_B12X4G12X4R12X4G12X4_422_UNORM_4PACK16' value='1000156021'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4_R12X4_3PLANE_420_UNORM_3PACK16' value='1000156022'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4R12X4_2PLANE_420_UNORM_3PACK16' value='1000156023'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4_R12X4_3PLANE_422_UNORM_3PACK16' value='1000156024'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4R12X4_2PLANE_422_UNORM_3PACK16' value='1000156025'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4_R12X4_3PLANE_444_UNORM_3PACK16' value='1000156026'/>
      <enumerator name='VK_FORMAT_G16B16G16R16_422_UNORM' value='1000156027'/>
      <enumerator name='VK_FORMAT_B16G16R16G16_422_UNORM' value='1000156028'/>
      <enumerator name='VK_FORMAT_G16_B16_R16_3PLANE_420_UNORM' value='1000156029'/>
      <enumerator name='VK_FORMAT_G16_B16R16_2PLANE_420_UNORM' value='1000156030'/>
      <enumerator name='VK_FORMAT_G16_B16_R16_3PLANE_422_UNORM' value='1000156031'/>
      <enumerator name='VK_FORMAT_G16_B16R16_2PLANE_422_UNORM' value='1000156032'/>
      <enumerator name='VK_FORMAT_G16_B16_R16_3PLANE_444_UNORM' value='1000156033'/>
      <enumerator name='VK_FORMAT_PVRTC1_2BPP_UNORM_BLOCK_IMG' value='1000054000'/>
      <enumerator name='VK_FORMAT_PVRTC1_4BPP_UNORM_BLOCK_IMG' value='1000054001'/>
      <enumerator name='VK_FORMAT_PVRTC2_2BPP_UNORM_BLOCK_IMG' value='1000054002'/>
      <enumerator name='VK_FORMAT_PVRTC2_4BPP_UNORM_BLOCK_IMG' value='1000054003'/>
      <enumerator name='VK_FORMAT_PVRTC1_2BPP_SRGB_BLOCK_IMG' value='1000054004'/>
      <enumerator name='VK_FORMAT_PVRTC1_4BPP_SRGB_BLOCK_IMG' value='1000054005'/>
      <enumerator name='VK_FORMAT_PVRTC2_2BPP_SRGB_BLOCK_IMG' value='1000054006'/>
      <enumerator name='VK_FORMAT_PVRTC2_4BPP_SRGB_BLOCK_IMG' value='1000054007'/>
      <enumerator name='VK_FORMAT_ASTC_4x4_SFLOAT_BLOCK_EXT' value='1000066000'/>
      <enumerator name='VK_FORMAT_ASTC_5x4_SFLOAT_BLOCK_EXT' value='1000066001'/>
      <enumerator name='VK_FORMAT_ASTC_5x5_SFLOAT_BLOCK_EXT' value='1000066002'/>
      <enumerator name='VK_FORMAT_ASTC_6x5_SFLOAT_BLOCK_EXT' value='1000066003'/>
      <enumerator name='VK_FORMAT_ASTC_6x6_SFLOAT_BLOCK_EXT' value='1000066004'/>
      <enumerator name='VK_FORMAT_ASTC_8x5_SFLOAT_BLOCK_EXT' value='1000066005'/>
      <enumerator name='VK_FORMAT_ASTC_8x6_SFLOAT_BLOCK_EXT' value='1000066006'/>
      <enumerator name='VK_FORMAT_ASTC_8x8_SFLOAT_BLOCK_EXT' value='1000066007'/>
      <enumerator name='VK_FORMAT_ASTC_10x5_SFLOAT_BLOCK_EXT' value='1000066008'/>
      <enumerator name='VK_FORMAT_ASTC_10x6_SFLOAT_BLOCK_EXT' value='1000066009'/>
      <enumerator name='VK_FORMAT_ASTC_10x8_SFLOAT_BLOCK_EXT' value='1000066010'/>
      <enumerator name='VK_FORMAT_ASTC_10x10_SFLOAT_BLOCK_EXT' value='1000066011'/>
      <enumerator name='VK_FORMAT_ASTC_12x10_SFLOAT_BLOCK_EXT' value='1000066012'/>
      <enumerator name='VK_FORMAT_ASTC_12x12_SFLOAT_BLOCK_EXT' value='1000066013'/>
      <enumerator name='VK_FORMAT_A4R4G4B4_UNORM_PACK16_EXT' value='1000340000'/>
      <enumerator name='VK_FORMAT_A4B4G4R4_UNORM_PACK16_EXT' value='1000340001'/>
      <enumerator name='VK_FORMAT_G8B8G8R8_422_UNORM_KHR' value='1000156000'/>
      <enumerator name='VK_FORMAT_B8G8R8G8_422_UNORM_KHR' value='1000156001'/>
      <enumerator name='VK_FORMAT_G8_B8_R8_3PLANE_420_UNORM_KHR' value='1000156002'/>
      <enumerator name='VK_FORMAT_G8_B8R8_2PLANE_420_UNORM_KHR' value='1000156003'/>
      <enumerator name='VK_FORMAT_G8_B8_R8_3PLANE_422_UNORM_KHR' value='1000156004'/>
      <enumerator name='VK_FORMAT_G8_B8R8_2PLANE_422_UNORM_KHR' value='1000156005'/>
      <enumerator name='VK_FORMAT_G8_B8_R8_3PLANE_444_UNORM_KHR' value='1000156006'/>
      <enumerator name='VK_FORMAT_R10X6_UNORM_PACK16_KHR' value='1000156007'/>
      <enumerator name='VK_FORMAT_R10X6G10X6_UNORM_2PACK16_KHR' value='1000156008'/>
      <enumerator name='VK_FORMAT_R10X6G10X6B10X6A10X6_UNORM_4PACK16_KHR' value='1000156009'/>
      <enumerator name='VK_FORMAT_G10X6B10X6G10X6R10X6_422_UNORM_4PACK16_KHR' value='1000156010'/>
      <enumerator name='VK_FORMAT_B10X6G10X6R10X6G10X6_422_UNORM_4PACK16_KHR' value='1000156011'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6_R10X6_3PLANE_420_UNORM_3PACK16_KHR' value='1000156012'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6R10X6_2PLANE_420_UNORM_3PACK16_KHR' value='1000156013'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6_R10X6_3PLANE_422_UNORM_3PACK16_KHR' value='1000156014'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6R10X6_2PLANE_422_UNORM_3PACK16_KHR' value='1000156015'/>
      <enumerator name='VK_FORMAT_G10X6_B10X6_R10X6_3PLANE_444_UNORM_3PACK16_KHR' value='1000156016'/>
      <enumerator name='VK_FORMAT_R12X4_UNORM_PACK16_KHR' value='1000156017'/>
      <enumerator name='VK_FORMAT_R12X4G12X4_UNORM_2PACK16_KHR' value='1000156018'/>
      <enumerator name='VK_FORMAT_R12X4G12X4B12X4A12X4_UNORM_4PACK16_KHR' value='1000156019'/>
      <enumerator name='VK_FORMAT_G12X4B12X4G12X4R12X4_422_UNORM_4PACK16_KHR' value='1000156020'/>
      <enumerator name='VK_FORMAT_B12X4G12X4R12X4G12X4_422_UNORM_4PACK16_KHR' value='1000156021'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4_R12X4_3PLANE_420_UNORM_3PACK16_KHR' value='1000156022'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4R12X4_2PLANE_420_UNORM_3PACK16_KHR' value='1000156023'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4_R12X4_3PLANE_422_UNORM_3PACK16_KHR' value='1000156024'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4R12X4_2PLANE_422_UNORM_3PACK16_KHR' value='1000156025'/>
      <enumerator name='VK_FORMAT_G12X4_B12X4_R12X4_3PLANE_444_UNORM_3PACK16_KHR' value='1000156026'/>
      <enumerator name='VK_FORMAT_G16B16G16R16_422_UNORM_KHR' value='1000156027'/>
      <enumerator name='VK_FORMAT_B16G16R16G16_422_UNORM_KHR' value='1000156028'/>
      <enumerator name='VK_FORMAT_G16_B16_R16_3PLANE_420_UNORM_KHR' value='1000156029'/>
      <enumerator name='VK_FORMAT_G16_B16R16_2PLANE_420_UNORM_KHR' value='1000156030'/>
      <enumerator name='VK_FORMAT_G16_B16_R16_3PLANE_422_UNORM_KHR' value='1000156031'/>
      <enumerator name='VK_FORMAT_G16_B16R16_2PLANE_422_UNORM_KHR' value='1000156032'/>
      <enumerator name='VK_FORMAT_G16_B16_R16_3PLANE_444_UNORM_KHR' value='1000156033'/>
      <enumerator name='VK_FORMAT_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='949f287e' size-in-bits='32' id='4a8c7c3c'/>
    <class-decl name='VkExternalSemaphoreProperties' size-in-bits='160' is-struct='yes' visibility='default' id='4a96f27c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exportFromImportedHandleTypes' type-id='108303cb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='compatibleHandleTypes' type-id='108303cb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='externalSemaphoreFeatures' type-id='6e65435b' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='VkCompareOp' id='4aa145cd'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_COMPARE_OP_NEVER' value='0'/>
      <enumerator name='VK_COMPARE_OP_LESS' value='1'/>
      <enumerator name='VK_COMPARE_OP_EQUAL' value='2'/>
      <enumerator name='VK_COMPARE_OP_LESS_OR_EQUAL' value='3'/>
      <enumerator name='VK_COMPARE_OP_GREATER' value='4'/>
      <enumerator name='VK_COMPARE_OP_NOT_EQUAL' value='5'/>
      <enumerator name='VK_COMPARE_OP_GREATER_OR_EQUAL' value='6'/>
      <enumerator name='VK_COMPARE_OP_ALWAYS' value='7'/>
      <enumerator name='VK_COMPARE_OP_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='85955407' size-in-bits='32' id='4af092f8'/>
    <typedef-decl name='VkImageView' type-id='9c313c2d' id='4b33a25d'/>
    <typedef-decl name='VkSamplerMipmapMode' type-id='69ceb6c6' id='4ba7a02a'/>
    <qualified-type-def type-id='62bb52ad' const='yes' id='4bdc07fd'/>
    <typedef-decl name='VkMemoryRequirements' type-id='3d82a05d' id='4c672ee0'/>
    <typedef-decl name='VkImageSparseMemoryRequirementsInfo2' type-id='98bbe39a' id='4ccaba47'/>
    <typedef-decl name='VkDeviceAddress' type-id='9c313c2d' id='4d0968c3'/>
    <class-decl name='AHardwareBuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d45f31e'/>
    <class-decl name='ANativeWindow' size-in-bits='864' is-struct='yes' visibility='default' id='4d637dbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='bed0922d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='b9930aae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='minSwapInterval' type-id='2448a865' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='maxSwapInterval' type-id='2448a865' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='xdpi' type-id='73f3791e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ydpi' type-id='73f3791e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='oem' type-id='1595aa6b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='setSwapInterval' type-id='4895e6ee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dequeueBuffer_DEPRECATED' type-id='e1460e41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lockBuffer_DEPRECATED' type-id='accce85f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='queueBuffer_DEPRECATED' type-id='accce85f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='query' type-id='e0289d60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='perform' type-id='6e6b4552' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='cancelBuffer_DEPRECATED' type-id='accce85f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dequeueBuffer' type-id='d94a7138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='queueBuffer' type-id='34e25e76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cancelBuffer' type-id='34e25e76' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ANativeWindow' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='96ae8d47' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='VkRect2D' type-id='a06cfb1a' id='4e73dcf7'/>
    <class-decl name='VkDescriptorSetAllocateInfo' size-in-bits='192' is-struct='yes' visibility='default' id='4e8054e6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='descriptorPool' type-id='93a4ed24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='descriptorSetCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pSetLayouts' type-id='1901c85e' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='7e2b5318' const='yes' id='4f1e1808'/>
    <class-decl name='VkPhysicalDeviceMemoryProperties' size-in-bits='4160' is-struct='yes' visibility='default' id='4faac63f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='memoryTypeCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='memoryTypes' type-id='3f0a205e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='memoryHeapCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='memoryHeaps' type-id='114911ce' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='VkPipelineStageFlagBits' id='4fc7e30b'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_PIPELINE_STAGE_TOP_OF_PIPE_BIT' value='1'/>
      <enumerator name='VK_PIPELINE_STAGE_DRAW_INDIRECT_BIT' value='2'/>
      <enumerator name='VK_PIPELINE_STAGE_VERTEX_INPUT_BIT' value='4'/>
      <enumerator name='VK_PIPELINE_STAGE_VERTEX_SHADER_BIT' value='8'/>
      <enumerator name='VK_PIPELINE_STAGE_TESSELLATION_CONTROL_SHADER_BIT' value='16'/>
      <enumerator name='VK_PIPELINE_STAGE_TESSELLATION_EVALUATION_SHADER_BIT' value='32'/>
      <enumerator name='VK_PIPELINE_STAGE_GEOMETRY_SHADER_BIT' value='64'/>
      <enumerator name='VK_PIPELINE_STAGE_FRAGMENT_SHADER_BIT' value='128'/>
      <enumerator name='VK_PIPELINE_STAGE_EARLY_FRAGMENT_TESTS_BIT' value='256'/>
      <enumerator name='VK_PIPELINE_STAGE_LATE_FRAGMENT_TESTS_BIT' value='512'/>
      <enumerator name='VK_PIPELINE_STAGE_COLOR_ATTACHMENT_OUTPUT_BIT' value='1024'/>
      <enumerator name='VK_PIPELINE_STAGE_COMPUTE_SHADER_BIT' value='2048'/>
      <enumerator name='VK_PIPELINE_STAGE_TRANSFER_BIT' value='4096'/>
      <enumerator name='VK_PIPELINE_STAGE_BOTTOM_OF_PIPE_BIT' value='8192'/>
      <enumerator name='VK_PIPELINE_STAGE_HOST_BIT' value='16384'/>
      <enumerator name='VK_PIPELINE_STAGE_ALL_GRAPHICS_BIT' value='32768'/>
      <enumerator name='VK_PIPELINE_STAGE_ALL_COMMANDS_BIT' value='65536'/>
      <enumerator name='VK_PIPELINE_STAGE_TRANSFORM_FEEDBACK_BIT_EXT' value='16777216'/>
      <enumerator name='VK_PIPELINE_STAGE_CONDITIONAL_RENDERING_BIT_EXT' value='262144'/>
      <enumerator name='VK_PIPELINE_STAGE_RAY_TRACING_SHADER_BIT_KHR' value='2097152'/>
      <enumerator name='VK_PIPELINE_STAGE_ACCELERATION_STRUCTURE_BUILD_BIT_KHR' value='33554432'/>
      <enumerator name='VK_PIPELINE_STAGE_SHADING_RATE_IMAGE_BIT_NV' value='4194304'/>
      <enumerator name='VK_PIPELINE_STAGE_TASK_SHADER_BIT_NV' value='524288'/>
      <enumerator name='VK_PIPELINE_STAGE_MESH_SHADER_BIT_NV' value='1048576'/>
      <enumerator name='VK_PIPELINE_STAGE_FRAGMENT_DENSITY_PROCESS_BIT_EXT' value='8388608'/>
      <enumerator name='VK_PIPELINE_STAGE_COMMAND_PREPROCESS_BIT_NV' value='131072'/>
      <enumerator name='VK_PIPELINE_STAGE_RAY_TRACING_SHADER_BIT_NV' value='2097152'/>
      <enumerator name='VK_PIPELINE_STAGE_ACCELERATION_STRUCTURE_BUILD_BIT_NV' value='33554432'/>
      <enumerator name='VK_PIPELINE_STAGE_FRAGMENT_SHADING_RATE_ATTACHMENT_BIT_KHR' value='4194304'/>
      <enumerator name='VK_PIPELINE_STAGE_FLAG_BITS_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='f436abf4' size-in-bits='32' id='50108e7a'/>
    <typedef-decl name='VkShaderModule' type-id='9c313c2d' id='508d2306'/>
    <typedef-decl name='VkDeviceCreateFlags' type-id='c1850196' id='50d689d4'/>
    <class-decl name='VkSparseImageMemoryBindInfo' size-in-bits='128' is-struct='yes' visibility='default' id='5108939b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='image' type-id='c858cae4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bindCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pBinds' type-id='42009c1a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkClearColorValue' type-id='e2d429cc' id='5164b31c'/>
    <class-decl name='VkCommandBufferAllocateInfo' size-in-bits='192' is-struct='yes' visibility='default' id='51ae567a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='commandPool' type-id='31f71d22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='level' type-id='76835664' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='commandBufferCount' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkPipelineVertexInputStateCreateFlags' type-id='c1850196' id='522ffe29'/>
    <pointer-type-def type-id='deed538c' size-in-bits='32' id='5241f7b9'/>
    <qualified-type-def type-id='199e54c9' const='yes' id='529fb599'/>
    <class-decl name='VkComputePipelineCreateInfo' size-in-bits='576' is-struct='yes' visibility='default' id='52bb2b85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='98c8e440' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stage' type-id='35ac5d2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='layout' type-id='9d673803' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='basePipelineHandle' type-id='cb386879' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='basePipelineIndex' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkDeviceGroupPresentCapabilitiesKHR' size-in-bits='1120' is-struct='yes' visibility='default' id='52cf3eff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='presentMask' type-id='388e96b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='modes' type-id='bde2453e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkClearDepthStencilValue' type-id='3eabcefd' id='52e49980'/>
    <pointer-type-def type-id='cc954ce5' size-in-bits='32' id='5361caec'/>
    <typedef-decl name='VkImageTiling' type-id='cbc79af7' id='5395690b'/>
    <typedef-decl name='VkStencilFaceFlags' type-id='c1850196' id='54b6c25f'/>
    <class-decl name='VkBufferImageCopy' size-in-bits='448' is-struct='yes' visibility='default' id='555da594'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bufferOffset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bufferRowLength' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bufferImageHeight' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='imageSubresource' type-id='3773b0a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='imageOffset' type-id='cc1743c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='imageExtent' type-id='b0dd0b40' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='32' id='5632bb1f'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='343e7d20'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <class-decl name='VkSubpassDescription' size-in-bits='320' is-struct='yes' visibility='default' id='567bcf89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='d8466bbb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pipelineBindPoint' type-id='3ce0c7c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='inputAttachmentCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pInputAttachments' type-id='989ccc2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='colorAttachmentCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pColorAttachments' type-id='989ccc2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pResolveAttachments' type-id='989ccc2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pDepthStencilAttachment' type-id='989ccc2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='preserveAttachmentCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pPreserveAttachments' type-id='a6798dcc' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='7062c3a3' const='yes' id='569b1753'/>
    <pointer-type-def type-id='44ca7319' size-in-bits='32' id='56eb72dc'/>
    <pointer-type-def type-id='9f83f811' size-in-bits='32' id='57bfc4e1'/>
    <qualified-type-def type-id='1e5dc49b' const='yes' id='57c8c0ab'/>
    <class-decl name='VkInstance_T' is-struct='yes' visibility='default' is-declaration-only='yes' id='585fcb02'/>
    <pointer-type-def type-id='6a385308' size-in-bits='32' id='58aade86'/>
    <pointer-type-def type-id='78c3a417' size-in-bits='32' id='58fb8c07'/>
    <qualified-type-def type-id='c5e23716' const='yes' id='59076ec6'/>
    <class-decl name='VkSemaphoreSignalInfo' size-in-bits='192' is-struct='yes' visibility='default' id='59090758'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='semaphore' type-id='b90bac47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c5bd633a' size-in-bits='32' id='5922f230'/>
    <typedef-decl name='VkCommandBufferUsageFlags' type-id='c1850196' id='59f93ed8'/>
    <typedef-decl name='VkInstanceCreateFlags' type-id='c1850196' id='5a114e1b'/>
    <typedef-decl name='VkPhysicalDeviceMemoryProperties2' type-id='76d5c677' id='5aaf84dc'/>
    <typedef-decl name='VkPipelineStageFlags' type-id='c1850196' id='5b07f658'/>
    <typedef-decl name='VkImageCreateInfo' type-id='b71f09d7' id='5b1c3d0c'/>
    <qualified-type-def type-id='b94cd713' const='yes' id='5b4c2003'/>
    <typedef-decl name='VkGraphicsPipelineCreateInfo' type-id='fd214f5d' id='5ba47a1c'/>
    <class-decl name='VkMemoryHeap' size-in-bits='128' is-struct='yes' visibility='default' id='5bf9f43b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='93f55269' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='585fcb02' size-in-bits='32' id='5c1a93e0'/>
    <typedef-decl name='VkBindImageMemoryInfo' type-id='1468407d' id='5c4cf30e'/>
    <qualified-type-def type-id='214e5875' const='yes' id='5c57c005'/>
    <class-decl name='VkPhysicalDeviceExternalBufferInfo' size-in-bits='160' is-struct='yes' visibility='default' id='5c74d93c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='9ec20474' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='usage' type-id='845d63eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='handleType' type-id='e8e0a0cf' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='VkDynamicState' id='5c7ae355'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_DYNAMIC_STATE_VIEWPORT' value='0'/>
      <enumerator name='VK_DYNAMIC_STATE_SCISSOR' value='1'/>
      <enumerator name='VK_DYNAMIC_STATE_LINE_WIDTH' value='2'/>
      <enumerator name='VK_DYNAMIC_STATE_DEPTH_BIAS' value='3'/>
      <enumerator name='VK_DYNAMIC_STATE_BLEND_CONSTANTS' value='4'/>
      <enumerator name='VK_DYNAMIC_STATE_DEPTH_BOUNDS' value='5'/>
      <enumerator name='VK_DYNAMIC_STATE_STENCIL_COMPARE_MASK' value='6'/>
      <enumerator name='VK_DYNAMIC_STATE_STENCIL_WRITE_MASK' value='7'/>
      <enumerator name='VK_DYNAMIC_STATE_STENCIL_REFERENCE' value='8'/>
      <enumerator name='VK_DYNAMIC_STATE_VIEWPORT_W_SCALING_NV' value='1000087000'/>
      <enumerator name='VK_DYNAMIC_STATE_DISCARD_RECTANGLE_EXT' value='1000099000'/>
      <enumerator name='VK_DYNAMIC_STATE_SAMPLE_LOCATIONS_EXT' value='1000143000'/>
      <enumerator name='VK_DYNAMIC_STATE_VIEWPORT_SHADING_RATE_PALETTE_NV' value='1000164004'/>
      <enumerator name='VK_DYNAMIC_STATE_VIEWPORT_COARSE_SAMPLE_ORDER_NV' value='1000164006'/>
      <enumerator name='VK_DYNAMIC_STATE_EXCLUSIVE_SCISSOR_NV' value='1000205001'/>
      <enumerator name='VK_DYNAMIC_STATE_FRAGMENT_SHADING_RATE_KHR' value='1000226000'/>
      <enumerator name='VK_DYNAMIC_STATE_LINE_STIPPLE_EXT' value='1000259000'/>
      <enumerator name='VK_DYNAMIC_STATE_CULL_MODE_EXT' value='1000267000'/>
      <enumerator name='VK_DYNAMIC_STATE_FRONT_FACE_EXT' value='1000267001'/>
      <enumerator name='VK_DYNAMIC_STATE_PRIMITIVE_TOPOLOGY_EXT' value='1000267002'/>
      <enumerator name='VK_DYNAMIC_STATE_VIEWPORT_WITH_COUNT_EXT' value='1000267003'/>
      <enumerator name='VK_DYNAMIC_STATE_SCISSOR_WITH_COUNT_EXT' value='1000267004'/>
      <enumerator name='VK_DYNAMIC_STATE_VERTEX_INPUT_BINDING_STRIDE_EXT' value='1000267005'/>
      <enumerator name='VK_DYNAMIC_STATE_DEPTH_TEST_ENABLE_EXT' value='1000267006'/>
      <enumerator name='VK_DYNAMIC_STATE_DEPTH_WRITE_ENABLE_EXT' value='1000267007'/>
      <enumerator name='VK_DYNAMIC_STATE_DEPTH_COMPARE_OP_EXT' value='1000267008'/>
      <enumerator name='VK_DYNAMIC_STATE_DEPTH_BOUNDS_TEST_ENABLE_EXT' value='1000267009'/>
      <enumerator name='VK_DYNAMIC_STATE_STENCIL_TEST_ENABLE_EXT' value='1000267010'/>
      <enumerator name='VK_DYNAMIC_STATE_STENCIL_OP_EXT' value='1000267011'/>
      <enumerator name='VK_DYNAMIC_STATE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkSubpassDescription' type-id='567bcf89' id='5d2f3f28'/>
    <function-type size-in-bits='32' id='5d54fa6d'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='343e7d20'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <pointer-type-def type-id='9c313c2d' size-in-bits='32' id='5d6479ae'/>
    <pointer-type-def type-id='cbea1d76' size-in-bits='32' id='5d8c37d4'/>
    <qualified-type-def type-id='402919e3' const='yes' id='5da805f3'/>
    <enum-decl name='VkLogicOp' id='5e204ff0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_LOGIC_OP_CLEAR' value='0'/>
      <enumerator name='VK_LOGIC_OP_AND' value='1'/>
      <enumerator name='VK_LOGIC_OP_AND_REVERSE' value='2'/>
      <enumerator name='VK_LOGIC_OP_COPY' value='3'/>
      <enumerator name='VK_LOGIC_OP_AND_INVERTED' value='4'/>
      <enumerator name='VK_LOGIC_OP_NO_OP' value='5'/>
      <enumerator name='VK_LOGIC_OP_XOR' value='6'/>
      <enumerator name='VK_LOGIC_OP_OR' value='7'/>
      <enumerator name='VK_LOGIC_OP_NOR' value='8'/>
      <enumerator name='VK_LOGIC_OP_EQUIVALENT' value='9'/>
      <enumerator name='VK_LOGIC_OP_INVERT' value='10'/>
      <enumerator name='VK_LOGIC_OP_OR_REVERSE' value='11'/>
      <enumerator name='VK_LOGIC_OP_COPY_INVERTED' value='12'/>
      <enumerator name='VK_LOGIC_OP_OR_INVERTED' value='13'/>
      <enumerator name='VK_LOGIC_OP_NAND' value='14'/>
      <enumerator name='VK_LOGIC_OP_SET' value='15'/>
      <enumerator name='VK_LOGIC_OP_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkClearRect' type-id='0b80ef51' id='5e2769ce'/>
    <typedef-decl name='VkSamplerCreateInfo' type-id='f539338e' id='5e458f45'/>
    <class-decl name='VkBufferMemoryBarrier' size-in-bits='384' is-struct='yes' visibility='default' id='5f0959aa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srcAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dstAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srcQueueFamilyIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dstQueueFamilyIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buffer' type-id='97f1b675' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='offset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='size' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkSparseImageMemoryRequirements' size-in-bits='384' is-struct='yes' visibility='default' id='5f0d4300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='formatProperties' type-id='be3d6172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='imageMipTailFirstLod' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='imageMipTailSize' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='imageMipTailOffset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='imageMipTailStride' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkPhysicalDeviceFeatures2' size-in-bits='1824' is-struct='yes' visibility='default' id='5f7498cc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='features' type-id='9b182dcb' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c77ebd79' size-in-bits='32' id='5f8409a9'/>
    <pointer-type-def type-id='b0bf8c08' size-in-bits='32' id='5f899986'/>
    <class-decl name='VkBufferViewCreateInfo' size-in-bits='384' is-struct='yes' visibility='default' id='60fb7521'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='00cef61f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer' type-id='97f1b675' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='format' type-id='13aa8748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='offset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='range' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='73c139cf' const='yes' id='611c5bdf'/>
    <typedef-decl name='PFN_vkVoidFunction' type-id='953b12f8' id='615753d0'/>
    <pointer-type-def type-id='e5b592d5' size-in-bits='32' id='615b00d6'/>
    <class-decl name='VkExtensionProperties' size-in-bits='2080' is-struct='yes' visibility='default' id='6192c79e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extensionName' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='specVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkQueryPipelineStatisticFlags' type-id='c1850196' id='61f18032'/>
    <typedef-decl name='VkClearAttachment' type-id='9891586a' id='62bb52ad'/>
    <class-decl name='VkPhysicalDeviceImageFormatInfo2' size-in-bits='224' is-struct='yes' visibility='default' id='62cb5a3d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='format' type-id='13aa8748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='1f12e1cc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tiling' type-id='5395690b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='usage' type-id='10949fe2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='3cc36d43' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='186eb496' size-in-bits='32' id='62ee9b7d'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <pointer-type-def type-id='ab086272' size-in-bits='32' id='636058d0'/>
    <typedef-decl name='VkSparseImageMemoryRequirements2' type-id='d3e0c7b6' id='639c4b27'/>
    <pointer-type-def type-id='909cbf97' size-in-bits='32' id='63c1d687'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <typedef-decl name='VkFramebufferCreateInfo' type-id='2ab6f94d' id='64584262'/>
    <class-decl name='VkSparseBufferMemoryBindInfo' size-in-bits='128' is-struct='yes' visibility='default' id='64f6db6c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='97f1b675' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bindCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pBinds' type-id='7c2d954b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkLogicOp' type-id='5e204ff0' id='6504145c'/>
    <typedef-decl name='VkDescriptorUpdateTemplateEntry' type-id='94c95928' id='65a2edc3'/>
    <typedef-decl name='VkSwapchainCreateFlagsKHR' type-id='c1850196' id='65ce4d83'/>
    <pointer-type-def type-id='4870f976' size-in-bits='32' id='65d88bd4'/>
    <qualified-type-def type-id='5164b31c' const='yes' id='65f8a92c'/>
    <typedef-decl name='VkShaderStageFlagBits' type-id='9168aa0a' id='660b2bbe'/>
    <pointer-type-def type-id='7c6af6a1' size-in-bits='32' id='67621cd1'/>
    <typedef-decl name='VkBindBufferMemoryInfo' type-id='1c423970' id='67958e4d'/>
    <typedef-decl name='VkFramebuffer' type-id='9c313c2d' id='67cc387e'/>
    <pointer-type-def type-id='bf014893' size-in-bits='32' id='68057b3b'/>
    <pointer-type-def type-id='004b9055' size-in-bits='32' id='69abb9f2'/>
    <enum-decl name='VkSamplerMipmapMode' id='69ceb6c6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_SAMPLER_MIPMAP_MODE_NEAREST' value='0'/>
      <enumerator name='VK_SAMPLER_MIPMAP_MODE_LINEAR' value='1'/>
      <enumerator name='VK_SAMPLER_MIPMAP_MODE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <qualified-type-def type-id='d0f8df38' const='yes' id='6a385308'/>
    <typedef-decl name='VkStructureType' type-id='33e97118' id='6add797c'/>
    <class-decl name='VkEventCreateInfo' size-in-bits='96' is-struct='yes' visibility='default' id='6afefc1e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='884032dc' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='VkAttachmentLoadOp' id='6ca301a1'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_ATTACHMENT_LOAD_OP_LOAD' value='0'/>
      <enumerator name='VK_ATTACHMENT_LOAD_OP_CLEAR' value='1'/>
      <enumerator name='VK_ATTACHMENT_LOAD_OP_DONT_CARE' value='2'/>
      <enumerator name='VK_ATTACHMENT_LOAD_OP_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkSurfaceCapabilitiesKHR' type-id='0edfcf42' id='6d019687'/>
    <typedef-decl name='VkPhysicalDeviceLimits' type-id='a99993a1' id='6d14f5f4'/>
    <typedef-decl name='VkExternalSemaphoreFeatureFlags' type-id='c1850196' id='6e65435b'/>
    <pointer-type-def type-id='e1037128' size-in-bits='32' id='6e6b4552'/>
    <qualified-type-def type-id='900e6b6e' const='yes' id='6ea23f5e'/>
    <typedef-decl name='VkPipelineTessellationStateCreateInfo' type-id='b2100bce' id='6f15a925'/>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='128' id='6f6d70c7'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='96' id='6f7eb9e8'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <typedef-decl name='VkSparseMemoryBindFlags' type-id='c1850196' id='70443faa'/>
    <typedef-decl name='VkSubpassDependency' type-id='299827f4' id='7062c3a3'/>
    <enum-decl name='VkSurfaceTransformFlagBitsKHR' id='70e284d3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_SURFACE_TRANSFORM_IDENTITY_BIT_KHR' value='1'/>
      <enumerator name='VK_SURFACE_TRANSFORM_ROTATE_90_BIT_KHR' value='2'/>
      <enumerator name='VK_SURFACE_TRANSFORM_ROTATE_180_BIT_KHR' value='4'/>
      <enumerator name='VK_SURFACE_TRANSFORM_ROTATE_270_BIT_KHR' value='8'/>
      <enumerator name='VK_SURFACE_TRANSFORM_HORIZONTAL_MIRROR_BIT_KHR' value='16'/>
      <enumerator name='VK_SURFACE_TRANSFORM_HORIZONTAL_MIRROR_ROTATE_90_BIT_KHR' value='32'/>
      <enumerator name='VK_SURFACE_TRANSFORM_HORIZONTAL_MIRROR_ROTATE_180_BIT_KHR' value='64'/>
      <enumerator name='VK_SURFACE_TRANSFORM_HORIZONTAL_MIRROR_ROTATE_270_BIT_KHR' value='128'/>
      <enumerator name='VK_SURFACE_TRANSFORM_INHERIT_BIT_KHR' value='256'/>
      <enumerator name='VK_SURFACE_TRANSFORM_FLAG_BITS_MAX_ENUM_KHR' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkDeviceGroupPresentCapabilitiesKHR' type-id='52cf3eff' id='711a7e9c'/>
    <enum-decl name='VkStencilOp' id='712391b6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_STENCIL_OP_KEEP' value='0'/>
      <enumerator name='VK_STENCIL_OP_ZERO' value='1'/>
      <enumerator name='VK_STENCIL_OP_REPLACE' value='2'/>
      <enumerator name='VK_STENCIL_OP_INCREMENT_AND_CLAMP' value='3'/>
      <enumerator name='VK_STENCIL_OP_DECREMENT_AND_CLAMP' value='4'/>
      <enumerator name='VK_STENCIL_OP_INVERT' value='5'/>
      <enumerator name='VK_STENCIL_OP_INCREMENT_AND_WRAP' value='6'/>
      <enumerator name='VK_STENCIL_OP_DECREMENT_AND_WRAP' value='7'/>
      <enumerator name='VK_STENCIL_OP_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='c3b7ba7d' size-in-bits='32' id='713a56f5'/>
    <typedef-decl name='VkExternalFenceFeatureFlags' type-id='c1850196' id='714dfc24'/>
    <typedef-decl name='VkCommandPoolResetFlags' type-id='c1850196' id='71bd2e7c'/>
    <typedef-decl name='VkPipelineDepthStencilStateCreateInfo' type-id='b743b254' id='71ee05bb'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='32' id='7292109c'/>
    <enum-decl name='VkComponentSwizzle' id='72f1bcc8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_IDENTITY' value='0'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_ZERO' value='1'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_ONE' value='2'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_R' value='3'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_G' value='4'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_B' value='5'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_A' value='6'/>
      <enumerator name='VK_COMPONENT_SWIZZLE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkSamplerYcbcrRange' type-id='d2d081b1' id='730f17cd'/>
    <pointer-type-def type-id='949bc9a8' size-in-bits='32' id='733e37a6'/>
    <typedef-decl name='VkSamplerYcbcrModelConversion' type-id='ec2e1829' id='7358d225'/>
    <typedef-decl name='VkDescriptorBufferInfo' type-id='fe2991a1' id='737efec4'/>
    <typedef-decl name='VkPhysicalDeviceExternalSemaphoreInfo' type-id='e85d26f4' id='73c139cf'/>
    <qualified-type-def type-id='ba423818' const='yes' id='73c414e8'/>
    <qualified-type-def type-id='a6c45d85' const='yes' id='73f3791e'/>
    <class-decl name='VkSubmitInfo' size-in-bits='288' is-struct='yes' visibility='default' id='741c008e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='waitSemaphoreCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pWaitSemaphores' type-id='26e3b8e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pWaitDstStageMask' type-id='733e37a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='commandBufferCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pCommandBuffers' type-id='2654af84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='signalSemaphoreCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pSignalSemaphores' type-id='26e3b8e7' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='baa017c0' size-in-bits='32' id='7440a92d'/>
    <typedef-decl name='VkPhysicalDevice' type-id='636058d0' id='744ae60c'/>
    <pointer-type-def type-id='ff3b4380' size-in-bits='32' id='744b849e'/>
    <qualified-type-def type-id='a307acc4' const='yes' id='74599b74'/>
    <class-decl name='VkMemoryAllocateInfo' size-in-bits='192' is-struct='yes' visibility='default' id='745d355e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocationSize' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memoryTypeIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='b2161436' size-in-bits='32' id='74c1a814'/>
    <class-decl name='VkExternalFenceProperties' size-in-bits='160' is-struct='yes' visibility='default' id='75510f4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exportFromImportedHandleTypes' type-id='c3a8ac22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='compatibleHandleTypes' type-id='c3a8ac22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='externalFenceFeatures' type-id='714dfc24' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='f89dd0d1' size-in-bits='32' id='7573fede'/>
    <typedef-decl name='VkCommandBufferLevel' type-id='ca4f94f0' id='76835664'/>
    <class-decl name='VkPhysicalDeviceMemoryProperties2' size-in-bits='4224' is-struct='yes' visibility='default' id='76d5c677'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memoryProperties' type-id='099fe106' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='40cec2e5' const='yes' id='777a3c35'/>
    <qualified-type-def type-id='d140a67c' const='yes' id='77d3032c'/>
    <pointer-type-def type-id='7d211657' size-in-bits='32' id='781666c7'/>
    <pointer-type-def type-id='d6df85a9' size-in-bits='32' id='7880fc7a'/>
    <qualified-type-def type-id='c8445d63' const='yes' id='78ba67f3'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='32' id='78c01427'/>
    <qualified-type-def type-id='4ccaba47' const='yes' id='78c3a417'/>
    <enum-decl name='VkPolygonMode' id='78d0e244'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_POLYGON_MODE_FILL' value='0'/>
      <enumerator name='VK_POLYGON_MODE_LINE' value='1'/>
      <enumerator name='VK_POLYGON_MODE_POINT' value='2'/>
      <enumerator name='VK_POLYGON_MODE_FILL_RECTANGLE_NV' value='1000153000'/>
      <enumerator name='VK_POLYGON_MODE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkExternalSemaphoreHandleTypeFlagBits' type-id='2169550e' id='78e0ab02'/>
    <class-decl name='VkComponentMapping' size-in-bits='128' is-struct='yes' visibility='default' id='7983296d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r' type-id='2d118a7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='g' type-id='2d118a7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='b' type-id='2d118a7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='a' type-id='2d118a7c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkPushConstantRange' size-in-bits='96' is-struct='yes' visibility='default' id='79c4c69b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stageFlags' type-id='a910dd47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='VkSharingMode' id='7a056712'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_SHARING_MODE_EXCLUSIVE' value='0'/>
      <enumerator name='VK_SHARING_MODE_CONCURRENT' value='1'/>
      <enumerator name='VK_SHARING_MODE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='e19db565' size-in-bits='32' id='7a446b5d'/>
    <typedef-decl name='VkQueryPoolCreateFlags' type-id='c1850196' id='7aa97fca'/>
    <typedef-decl name='VkLayerProperties' type-id='8e02178a' id='7af5e0f5'/>
    <pointer-type-def type-id='b960935d' size-in-bits='32' id='7b094468'/>
    <class-decl name='VkCommandPoolCreateInfo' size-in-bits='128' is-struct='yes' visibility='default' id='7b2314ad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='09153291' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='queueFamilyIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='30734f1c' size-in-bits='32' id='7b85b202'/>
    <function-type size-in-bits='32' id='7c01b235'>
      <parameter type-id='96ae8d47'/>
      <parameter type-id='84f3f1fd'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='cbf55043' size-in-bits='32' id='7c2d954b'/>
    <qualified-type-def type-id='8afe3e31' const='yes' id='7c6af6a1'/>
    <typedef-decl name='VkSampleMask' type-id='8f92235e' id='7c70a631'/>
    <typedef-decl name='VkSubpassDependency2' type-id='40869cb2' id='7c79dd43'/>
    <class-decl name='VkCommandBufferInheritanceInfo' size-in-bits='384' is-struct='yes' visibility='default' id='7ceec78f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='renderPass' type-id='df345276' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='subpass' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='framebuffer' type-id='67cc387e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='occlusionQueryEnable' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='queryFlags' type-id='865d2379' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pipelineStatistics' type-id='61f18032' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='1539ab27' const='yes' id='7d211657'/>
    <typedef-decl name='VkExternalMemoryHandleTypeFlags' type-id='c1850196' id='7d9a9cb8'/>
    <typedef-decl name='VkRenderPassCreateInfo2' type-id='bda9164f' id='7da6fb68'/>
    <typedef-decl name='VkDescriptorSetAllocateInfo' type-id='4e8054e6' id='7db79445'/>
    <pointer-type-def type-id='9fe41ae0' size-in-bits='32' id='7e162bfe'/>
    <typedef-decl name='VkSamplerYcbcrConversionCreateInfo' type-id='1901625d' id='7e2b5318'/>
    <pointer-type-def type-id='5aaf84dc' size-in-bits='32' id='7f0e712f'/>
    <class-decl name='VkDescriptorImageInfo' size-in-bits='192' is-struct='yes' visibility='default' id='7f821684'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sampler' type-id='0ccf74ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='imageView' type-id='4b33a25d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='imageLayout' type-id='dad72c2a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkDescriptorUpdateTemplateCreateInfo' type-id='188c570c' id='7f8594dd'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <pointer-type-def type-id='b90bac47' size-in-bits='32' id='8053ecf6'/>
    <typedef-decl name='VkDescriptorPoolSize' type-id='f266d720' id='805464bd'/>
    <typedef-decl name='VkPhysicalDeviceSparseProperties' type-id='1df3d048' id='80820589'/>
    <typedef-decl name='VkDescriptorSetLayoutCreateInfo' type-id='b94e0c8f' id='80c638a8'/>
    <qualified-type-def type-id='89395175' const='yes' id='80c88c05'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <function-type size-in-bits='32' id='81905a9c'>
      <parameter type-id='96ae8d47'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='5632bb1f' size-in-bits='32' id='81e75593'/>
    <class-decl name='VkCommandBuffer_T' is-struct='yes' visibility='default' is-declaration-only='yes' id='8249f1ee'/>
    <class-decl name='VkFormatProperties2' size-in-bits='160' is-struct='yes' visibility='default' id='82c9fd62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='formatProperties' type-id='f633aaad' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='5e458f45' const='yes' id='830a2175'/>
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='64' id='83214edf'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <class-decl name='VkAndroidSurfaceCreateInfoKHR' size-in-bits='128' is-struct='yes' visibility='default' id='8326f11f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='b8bb4b3f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='window' type-id='96ae8d47' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkAccessFlags' type-id='c1850196' id='839716f4'/>
    <typedef-decl name='VkBufferUsageFlags' type-id='c1850196' id='845d63eb'/>
    <qualified-type-def type-id='4804d881' const='yes' id='84bc9611'/>
    <pointer-type-def type-id='2326b805' size-in-bits='32' id='84f3f1fd'/>
    <typedef-decl name='VkQueueFamilyProperties2' type-id='eb50ee7a' id='85955407'/>
    <typedef-decl name='VkImageFormatProperties2' type-id='9c7cd2c9' id='85a0c094'/>
    <qualified-type-def type-id='e7bc5b14' const='yes' id='85f52404'/>
    <qualified-type-def type-id='2e12ba1a' const='yes' id='85fe916a'/>
    <typedef-decl name='VkQueryControlFlags' type-id='c1850196' id='865d2379'/>
    <typedef-decl name='VkQueryType' type-id='d7499351' id='866ec04d'/>
    <pointer-type-def type-id='2d621e0b' size-in-bits='32' id='867a6488'/>
    <pointer-type-def type-id='74599b74' size-in-bits='32' id='870f94fa'/>
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='128' id='87305fb5'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <typedef-decl name='VkEventCreateFlags' type-id='c1850196' id='884032dc'/>
    <qualified-type-def type-id='106aac28' const='yes' id='887ed618'/>
    <qualified-type-def type-id='b90bac47' const='yes' id='88c24ff7'/>
    <pointer-type-def type-id='8bc56eab' size-in-bits='32' id='88ccf513'/>
    <typedef-decl name='VkBufferImageCopy' type-id='555da594' id='88d80257'/>
    <pointer-type-def type-id='8249f1ee' size-in-bits='32' id='88f95194'/>
    <typedef-decl name='__uint64_t' type-id='0d77e947' id='8910171f'/>
    <typedef-decl name='VkEventCreateInfo' type-id='6afefc1e' id='89395175'/>
    <class-decl name='VkFormatProperties' size-in-bits='96' is-struct='yes' visibility='default' id='89527264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='linearTilingFeatures' type-id='b054b9a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='optimalTilingFeatures' type-id='b054b9a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bufferFeatures' type-id='b054b9a1' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='VkExternalMemoryHandleTypeFlagBits' id='89728a13'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_FD_BIT' value='1'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_BIT' value='2'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT' value='4'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_BIT' value='8'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_KMT_BIT' value='16'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_HEAP_BIT' value='32'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_RESOURCE_BIT' value='64'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_DMA_BUF_BIT_EXT' value='512'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_ANDROID_HARDWARE_BUFFER_BIT_ANDROID' value='1024'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_HOST_ALLOCATION_BIT_EXT' value='128'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_HOST_MAPPED_FOREIGN_MEMORY_BIT_EXT' value='256'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_FD_BIT_KHR' value='1'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_BIT_KHR' value='2'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT_KHR' value='4'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_BIT_KHR' value='8'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_KMT_BIT_KHR' value='16'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_HEAP_BIT_KHR' value='32'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_RESOURCE_BIT_KHR' value='64'/>
      <enumerator name='VK_EXTERNAL_MEMORY_HANDLE_TYPE_FLAG_BITS_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkPolygonMode' type-id='78d0e244' id='89dcc4a8'/>
    <pointer-type-def type-id='bd35095e' size-in-bits='32' id='89dcc683'/>
    <class-decl name='VkPipelineViewportStateCreateInfo' size-in-bits='224' is-struct='yes' visibility='default' id='8a11ccd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='9a352e97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='viewportCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pViewports' type-id='4182770d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='scissorCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pScissors' type-id='f3cc5757' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkDescriptorSetLayoutBinding' type-id='00eb5c74' id='8afe3e31'/>
    <pointer-type-def type-id='711a7e9c' size-in-bits='32' id='8b8d3d17'/>
    <qualified-type-def type-id='71ee05bb' const='yes' id='8bc56eab'/>
    <pointer-type-def type-id='9439f9de' size-in-bits='32' id='8c398b93'/>
    <qualified-type-def type-id='2448def1' const='yes' id='8c4eb061'/>
    <pointer-type-def type-id='65f8a92c' size-in-bits='32' id='8c721472'/>
    <pointer-type-def type-id='5c57c005' size-in-bits='32' id='8d2389fd'/>
    <class-decl name='VkQueueFamilyProperties' size-in-bits='192' is-struct='yes' visibility='default' id='8db0cbec'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='queueFlags' type-id='b0c1ef51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='queueCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='timestampValidBits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='minImageTransferGranularity' type-id='b0dd0b40' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkLayerProperties' size-in-bits='4160' is-struct='yes' visibility='default' id='8e02178a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='layerName' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='specVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='implementationVersion' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='description' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='805464bd' const='yes' id='8e1d876d'/>
    <qualified-type-def type-id='0409a5a5' const='yes' id='8e8988f5'/>
    <qualified-type-def type-id='f6995a99' const='yes' id='8ea01769'/>
    <typedef-decl name='VkDescriptorUpdateTemplateCreateFlags' type-id='c1850196' id='8eac5e54'/>
    <enum-decl name='VkImageViewType' id='8ef7a5e9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_1D' value='0'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_2D' value='1'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_3D' value='2'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_CUBE' value='3'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_1D_ARRAY' value='4'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_2D_ARRAY' value='5'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_CUBE_ARRAY' value='6'/>
      <enumerator name='VK_IMAGE_VIEW_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <class-decl name='VkAllocationCallbacks' size-in-bits='192' is-struct='yes' visibility='default' id='8f340254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pUserData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pfnAllocation' type-id='c7051da4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pfnReallocation' type-id='0b231b21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pfnFree' type-id='dc0e69bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pfnInternalAllocation' type-id='1bf0818e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pfnInternalFree' type-id='c3421dfa' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='099fe106' size-in-bits='32' id='8f732927'/>
    <class-decl name='VkExtent2D' size-in-bits='64' is-struct='yes' visibility='default' id='8f8e408c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='width' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='height' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='VkBufferMemoryBarrier' type-id='5f0959aa' id='8fad9c85'/>
    <class-decl name='VkPipelineColorBlendStateCreateInfo' size-in-bits='352' is-struct='yes' visibility='default' id='8fe239ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='10e5b1d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='logicOpEnable' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='logicOp' type-id='6504145c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='attachmentCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pAttachments' type-id='e849bfbf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='blendConstants' type-id='87305fb5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkPipelineVertexInputStateCreateInfo' type-id='2128c873' id='900e6b6e'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='32' id='90421557'/>
    <typedef-decl name='VkExternalMemoryProperties' type-id='1d632383' id='908e411e'/>
    <qualified-type-def type-id='cf4420a7' const='yes' id='909cbf97'/>
    <typedef-decl name='VkMemoryGetAndroidHardwareBufferInfoANDROID' type-id='3216649b' id='90cc6058'/>
    <pointer-type-def type-id='0e357719' size-in-bits='32' id='912aa549'/>
    <enum-decl name='VkShaderStageFlagBits' id='9168aa0a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_SHADER_STAGE_VERTEX_BIT' value='1'/>
      <enumerator name='VK_SHADER_STAGE_TESSELLATION_CONTROL_BIT' value='2'/>
      <enumerator name='VK_SHADER_STAGE_TESSELLATION_EVALUATION_BIT' value='4'/>
      <enumerator name='VK_SHADER_STAGE_GEOMETRY_BIT' value='8'/>
      <enumerator name='VK_SHADER_STAGE_FRAGMENT_BIT' value='16'/>
      <enumerator name='VK_SHADER_STAGE_COMPUTE_BIT' value='32'/>
      <enumerator name='VK_SHADER_STAGE_ALL_GRAPHICS' value='31'/>
      <enumerator name='VK_SHADER_STAGE_ALL' value='2147483647'/>
      <enumerator name='VK_SHADER_STAGE_RAYGEN_BIT_KHR' value='256'/>
      <enumerator name='VK_SHADER_STAGE_ANY_HIT_BIT_KHR' value='512'/>
      <enumerator name='VK_SHADER_STAGE_CLOSEST_HIT_BIT_KHR' value='1024'/>
      <enumerator name='VK_SHADER_STAGE_MISS_BIT_KHR' value='2048'/>
      <enumerator name='VK_SHADER_STAGE_INTERSECTION_BIT_KHR' value='4096'/>
      <enumerator name='VK_SHADER_STAGE_CALLABLE_BIT_KHR' value='8192'/>
      <enumerator name='VK_SHADER_STAGE_TASK_BIT_NV' value='64'/>
      <enumerator name='VK_SHADER_STAGE_MESH_BIT_NV' value='128'/>
      <enumerator name='VK_SHADER_STAGE_RAYGEN_BIT_NV' value='256'/>
      <enumerator name='VK_SHADER_STAGE_ANY_HIT_BIT_NV' value='512'/>
      <enumerator name='VK_SHADER_STAGE_CLOSEST_HIT_BIT_NV' value='1024'/>
      <enumerator name='VK_SHADER_STAGE_MISS_BIT_NV' value='2048'/>
      <enumerator name='VK_SHADER_STAGE_INTERSECTION_BIT_NV' value='4096'/>
      <enumerator name='VK_SHADER_STAGE_CALLABLE_BIT_NV' value='8192'/>
      <enumerator name='VK_SHADER_STAGE_FLAG_BITS_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkCommandBuffer' type-id='88f95194' id='918bf5f6'/>
    <typedef-decl name='VkDescriptorUpdateTemplateType' type-id='4668c5d9' id='92903a9d'/>
    <typedef-decl name='VkSamplerYcbcrConversion' type-id='9c313c2d' id='92a560a0'/>
    <typedef-decl name='VkDescriptorPool' type-id='9c313c2d' id='93a4ed24'/>
    <qualified-type-def type-id='ed193dfb' const='yes' id='93ee8c2b'/>
    <typedef-decl name='VkMemoryHeapFlags' type-id='c1850196' id='93f55269'/>
    <qualified-type-def type-id='35ac5d2e' const='yes' id='93fd7c3e'/>
    <pointer-type-def type-id='bfa0b5c0' size-in-bits='32' id='93fe5f5e'/>
    <typedef-decl name='VkBool32' type-id='8f92235e' id='9439f9de'/>
    <qualified-type-def type-id='2aaa8237' const='yes' id='94403fe7'/>
    <class-decl name='VkSemaphoreCreateInfo' size-in-bits='96' is-struct='yes' visibility='default' id='948a1a08'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='e9f22446' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkAcquireNextImageInfoKHR' type-id='f95144cf' id='94912950'/>
    <qualified-type-def type-id='5b07f658' const='yes' id='949bc9a8'/>
    <qualified-type-def type-id='5e2769ce' const='yes' id='949f287e'/>
    <enum-decl name='VkPipelineBindPoint' id='94bf23f0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_PIPELINE_BIND_POINT_GRAPHICS' value='0'/>
      <enumerator name='VK_PIPELINE_BIND_POINT_COMPUTE' value='1'/>
      <enumerator name='VK_PIPELINE_BIND_POINT_RAY_TRACING_KHR' value='1000165000'/>
      <enumerator name='VK_PIPELINE_BIND_POINT_RAY_TRACING_NV' value='1000165000'/>
      <enumerator name='VK_PIPELINE_BIND_POINT_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <class-decl name='VkDescriptorUpdateTemplateEntry' size-in-bits='192' is-struct='yes' visibility='default' id='94c95928'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dstBinding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstArrayElement' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='descriptorCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='descriptorType' type-id='3e0c9bce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='stride' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='ee076206' size-in-bits='32' id='953b12f8'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <typedef-decl name='VkPresentInfoKHR' type-id='0150b0a8' id='95ea0aed'/>
    <pointer-type-def type-id='35c4f486' size-in-bits='32' id='95eab37f'/>
    <pointer-type-def type-id='4d637dbf' size-in-bits='32' id='96ae8d47'/>
    <qualified-type-def type-id='7c70a631' const='yes' id='97100d01'/>
    <enum-decl name='VkExternalFenceHandleTypeFlagBits' id='973e7875'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_FD_BIT' value='1'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_BIT' value='2'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT' value='4'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_SYNC_FD_BIT' value='8'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_FD_BIT_KHR' value='1'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_BIT_KHR' value='2'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT_KHR' value='4'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_SYNC_FD_BIT_KHR' value='8'/>
      <enumerator name='VK_EXTERNAL_FENCE_HANDLE_TYPE_FLAG_BITS_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <pointer-type-def type-id='20105efb' size-in-bits='32' id='978e701a'/>
    <typedef-decl name='VkMemoryBarrier' type-id='9ffa78f4' id='979402cb'/>
    <typedef-decl name='VkBuffer' type-id='9c313c2d' id='97f1b675'/>
    <class-decl name='VkClearAttachment' size-in-bits='192' is-struct='yes' visibility='default' id='9891586a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aspectMask' type-id='241096e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='colorAttachment' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='clearValue' type-id='4804d881' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='34d01c5f' size-in-bits='32' id='989ccc2f'/>
    <class-decl name='VkImageSparseMemoryRequirementsInfo2' size-in-bits='128' is-struct='yes' visibility='default' id='98bbe39a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='image' type-id='c858cae4' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkPipelineCreateFlags' type-id='c1850196' id='98c8e440'/>
    <typedef-decl name='VkDescriptorPoolCreateFlags' type-id='c1850196' id='98d7d383'/>
    <class-decl name='VkQueue_T' is-struct='yes' visibility='default' is-declaration-only='yes' id='99185402'/>
    <typedef-decl name='VkImageFormatProperties' type-id='f70d0381' id='99abe9ae'/>
    <typedef-decl name='VkPipelineViewportStateCreateFlags' type-id='c1850196' id='9a352e97'/>
    <qualified-type-def type-id='9d239247' const='yes' id='9aea7077'/>
    <typedef-decl name='VkPhysicalDeviceFeatures' type-id='1c7eb3b6' id='9b182dcb'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <class-decl name='VkSubresourceLayout' size-in-bits='320' is-struct='yes' visibility='default' id='9b8da776'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rowPitch' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='arrayPitch' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='depthPitch' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='5d54fa6d' size-in-bits='32' id='9bcae1a1'/>
    <qualified-type-def type-id='d7aa927d' const='yes' id='9be9006d'/>
    <pointer-type-def type-id='2fb28dac' size-in-bits='32' id='9c14c9f2'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <pointer-type-def type-id='381d866c' size-in-bits='32' id='9c7a6032'/>
    <class-decl name='VkImageFormatProperties2' size-in-bits='320' is-struct='yes' visibility='default' id='9c7cd2c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='imageFormatProperties' type-id='99abe9ae' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <typedef-decl name='VkImageBlit' type-id='f86f0838' id='9d239247'/>
    <typedef-decl name='VkPipelineRasterizationStateCreateFlags' type-id='c1850196' id='9d23c940'/>
    <qualified-type-def type-id='2a41d7ca' const='yes' id='9d4ff65a'/>
    <typedef-decl name='VkPipelineLayout' type-id='9c313c2d' id='9d673803'/>
    <pointer-type-def type-id='6ea23f5e' size-in-bits='32' id='9d69e39c'/>
    <pointer-type-def type-id='d73077f7' size-in-bits='32' id='9e4cb0e7'/>
    <function-type size-in-bits='32' id='9e53d056'>
      <parameter type-id='5f899986'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7292109c'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <enum-decl name='VkVertexInputRate' id='9e9dd0f9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_VERTEX_INPUT_RATE_VERTEX' value='0'/>
      <enumerator name='VK_VERTEX_INPUT_RATE_INSTANCE' value='1'/>
      <enumerator name='VK_VERTEX_INPUT_RATE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkBufferCreateFlags' type-id='c1850196' id='9ec20474'/>
    <pointer-type-def type-id='d64c5e3a' size-in-bits='32' id='9ef5cd4c'/>
    <qualified-type-def type-id='d3657c9f' const='yes' id='9ef9d48f'/>
    <enum-decl name='VkFilter' id='9f5d4195'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_FILTER_NEAREST' value='0'/>
      <enumerator name='VK_FILTER_LINEAR' value='1'/>
      <enumerator name='VK_FILTER_CUBIC_IMG' value='1000015000'/>
      <enumerator name='VK_FILTER_CUBIC_EXT' value='1000015000'/>
      <enumerator name='VK_FILTER_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <class-decl name='VkDescriptorPoolCreateInfo' size-in-bits='192' is-struct='yes' visibility='default' id='9f71bc99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='98d7d383' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='maxSets' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='poolSizeCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pPoolSizes' type-id='ff7bf4c5' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='e5303b81' const='yes' id='9f83f811'/>
    <qualified-type-def type-id='6f15a925' const='yes' id='9f884855'/>
    <class-decl name='VkDeviceQueueInfo2' size-in-bits='160' is-struct='yes' visibility='default' id='9f8e7fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='c54f7d3f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='queueFamilyIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='queueIndex' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='a052dbb0' const='yes' id='9fe41ae0'/>
    <class-decl name='VkMemoryBarrier' size-in-bits='128' is-struct='yes' visibility='default' id='9ffa78f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srcAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dstAccessMask' type-id='839716f4' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='32' id='a01c551e'>
      <parameter type-id='96ae8d47'/>
      <parameter type-id='84f3f1fd'/>
      <parameter type-id='7292109c'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <enum-decl name='VkPrimitiveTopology' id='a0479f7d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_POINT_LIST' value='0'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_LINE_LIST' value='1'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_LINE_STRIP' value='2'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_TRIANGLE_LIST' value='3'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_TRIANGLE_STRIP' value='4'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_TRIANGLE_FAN' value='5'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_LINE_LIST_WITH_ADJACENCY' value='6'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_LINE_STRIP_WITH_ADJACENCY' value='7'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_TRIANGLE_LIST_WITH_ADJACENCY' value='8'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_TRIANGLE_STRIP_WITH_ADJACENCY' value='9'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_PATCH_LIST' value='10'/>
      <enumerator name='VK_PRIMITIVE_TOPOLOGY_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkPhysicalDeviceExternalFenceInfo' type-id='e308e27b' id='a052dbb0'/>
    <class-decl name='VkRect2D' size-in-bits='128' is-struct='yes' visibility='default' id='a06cfb1a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='ae14d5f2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='extent' type-id='d6df85a9' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkColorSpaceKHR' type-id='0d402807' id='a0807a93'/>
    <class-decl name='VkBufferCopy' size-in-bits='192' is-struct='yes' visibility='default' id='a080d2e5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srcOffset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dstOffset' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkPipelineTessellationStateCreateFlags' type-id='c1850196' id='a09ee4cc'/>
    <enum-decl name='VkPhysicalDeviceType' id='a0b8a718'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_PHYSICAL_DEVICE_TYPE_OTHER' value='0'/>
      <enumerator name='VK_PHYSICAL_DEVICE_TYPE_INTEGRATED_GPU' value='1'/>
      <enumerator name='VK_PHYSICAL_DEVICE_TYPE_DISCRETE_GPU' value='2'/>
      <enumerator name='VK_PHYSICAL_DEVICE_TYPE_VIRTUAL_GPU' value='3'/>
      <enumerator name='VK_PHYSICAL_DEVICE_TYPE_CPU' value='4'/>
      <enumerator name='VK_PHYSICAL_DEVICE_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkBufferDeviceAddressInfo' type-id='bd5ba0b2' id='a0e818a9'/>
    <pointer-type-def type-id='639c4b27' size-in-bits='32' id='a144c74c'/>
    <typedef-decl name='VkCompositeAlphaFlagBitsKHR' type-id='be35ae5b' id='a15f2dc7'/>
    <qualified-type-def type-id='aeed5304' const='yes' id='a1ad6b94'/>
    <typedef-decl name='VkCompareOp' type-id='4aa145cd' id='a23ca649'/>
    <pointer-type-def type-id='9f884855' size-in-bits='32' id='a28a1fed'/>
    <qualified-type-def type-id='b93b13f1' const='yes' id='a2ab8d81'/>
    <enum-decl name='VkResult' id='a2b8b282'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_SUCCESS' value='0'/>
      <enumerator name='VK_NOT_READY' value='1'/>
      <enumerator name='VK_TIMEOUT' value='2'/>
      <enumerator name='VK_EVENT_SET' value='3'/>
      <enumerator name='VK_EVENT_RESET' value='4'/>
      <enumerator name='VK_INCOMPLETE' value='5'/>
      <enumerator name='VK_ERROR_OUT_OF_HOST_MEMORY' value='-1'/>
      <enumerator name='VK_ERROR_OUT_OF_DEVICE_MEMORY' value='-2'/>
      <enumerator name='VK_ERROR_INITIALIZATION_FAILED' value='-3'/>
      <enumerator name='VK_ERROR_DEVICE_LOST' value='-4'/>
      <enumerator name='VK_ERROR_MEMORY_MAP_FAILED' value='-5'/>
      <enumerator name='VK_ERROR_LAYER_NOT_PRESENT' value='-6'/>
      <enumerator name='VK_ERROR_EXTENSION_NOT_PRESENT' value='-7'/>
      <enumerator name='VK_ERROR_FEATURE_NOT_PRESENT' value='-8'/>
      <enumerator name='VK_ERROR_INCOMPATIBLE_DRIVER' value='-9'/>
      <enumerator name='VK_ERROR_TOO_MANY_OBJECTS' value='-10'/>
      <enumerator name='VK_ERROR_FORMAT_NOT_SUPPORTED' value='-11'/>
      <enumerator name='VK_ERROR_FRAGMENTED_POOL' value='-12'/>
      <enumerator name='VK_ERROR_UNKNOWN' value='-13'/>
      <enumerator name='VK_ERROR_OUT_OF_POOL_MEMORY' value='-1000069000'/>
      <enumerator name='VK_ERROR_INVALID_EXTERNAL_HANDLE' value='-1000072003'/>
      <enumerator name='VK_ERROR_FRAGMENTATION' value='-1000161000'/>
      <enumerator name='VK_ERROR_INVALID_OPAQUE_CAPTURE_ADDRESS' value='-1000257000'/>
      <enumerator name='VK_ERROR_SURFACE_LOST_KHR' value='-1000000000'/>
      <enumerator name='VK_ERROR_NATIVE_WINDOW_IN_USE_KHR' value='-1000000001'/>
      <enumerator name='VK_SUBOPTIMAL_KHR' value='1000001003'/>
      <enumerator name='VK_ERROR_OUT_OF_DATE_KHR' value='-1000001004'/>
      <enumerator name='VK_ERROR_INCOMPATIBLE_DISPLAY_KHR' value='-1000003001'/>
      <enumerator name='VK_ERROR_VALIDATION_FAILED_EXT' value='-1000011001'/>
      <enumerator name='VK_ERROR_INVALID_SHADER_NV' value='-1000012000'/>
      <enumerator name='VK_ERROR_INCOMPATIBLE_VERSION_KHR' value='-1000150000'/>
      <enumerator name='VK_ERROR_INVALID_DRM_FORMAT_MODIFIER_PLANE_LAYOUT_EXT' value='-1000158000'/>
      <enumerator name='VK_ERROR_NOT_PERMITTED_EXT' value='-1000174001'/>
      <enumerator name='VK_ERROR_FULL_SCREEN_EXCLUSIVE_MODE_LOST_EXT' value='-1000255000'/>
      <enumerator name='VK_THREAD_IDLE_KHR' value='1000268000'/>
      <enumerator name='VK_THREAD_DONE_KHR' value='1000268001'/>
      <enumerator name='VK_OPERATION_DEFERRED_KHR' value='1000268002'/>
      <enumerator name='VK_OPERATION_NOT_DEFERRED_KHR' value='1000268003'/>
      <enumerator name='VK_PIPELINE_COMPILE_REQUIRED_EXT' value='1000297000'/>
      <enumerator name='VK_ERROR_OUT_OF_POOL_MEMORY_KHR' value='-1000069000'/>
      <enumerator name='VK_ERROR_INVALID_EXTERNAL_HANDLE_KHR' value='-1000072003'/>
      <enumerator name='VK_ERROR_FRAGMENTATION_EXT' value='-1000161000'/>
      <enumerator name='VK_ERROR_INVALID_DEVICE_ADDRESS_EXT' value='-1000257000'/>
      <enumerator name='VK_ERROR_INVALID_OPAQUE_CAPTURE_ADDRESS_KHR' value='-1000257000'/>
      <enumerator name='VK_ERROR_PIPELINE_COMPILE_REQUIRED_EXT' value='1000297000'/>
      <enumerator name='VK_RESULT_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkSpecializationMapEntry' type-id='fd16158d' id='a307acc4'/>
    <class-decl name='VkAttachmentDescription' size-in-bits='288' is-struct='yes' visibility='default' id='a47cd5ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='a9452b0f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='format' type-id='13aa8748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='samples' type-id='bdefcf36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='loadOp' type-id='b752b535' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='storeOp' type-id='0fff4ee4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='stencilLoadOp' type-id='b752b535' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stencilStoreOp' type-id='0fff4ee4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='initialLayout' type-id='dad72c2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='finalLayout' type-id='dad72c2a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkBorderColor' type-id='b7ed5680' id='a4de75dc'/>
    <typedef-decl name='VkBlendFactor' type-id='f807f4fd' id='a4e44441'/>
    <array-type-def dimensions='1' type-id='cc1743c3' size-in-bits='192' id='a55957e6'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <pointer-type-def type-id='b9930aae' size-in-bits='32' id='a6798dcc'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <qualified-type-def type-id='c6885aaf' const='yes' id='a6d9651f'/>
    <pointer-type-def type-id='77d3032c' size-in-bits='32' id='a72dc272'/>
    <class-decl name='VkCopyDescriptorSet' size-in-bits='384' is-struct='yes' visibility='default' id='a73ee9c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srcSet' type-id='c5e23716' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srcBinding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='srcArrayElement' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dstSet' type-id='c5e23716' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dstBinding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='dstArrayElement' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='descriptorCount' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='e948c840' size-in-bits='32' id='a7937ede'/>
    <qualified-type-def type-id='0dc3622c' const='yes' id='a79c877c'/>
    <pointer-type-def type-id='830a2175' size-in-bits='32' id='a7f2888d'/>
    <class-decl name='VkPipelineDynamicStateCreateInfo' size-in-bits='160' is-struct='yes' visibility='default' id='a7f3daae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='d86d7866' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dynamicStateCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pDynamicStates' type-id='abd896e9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkPhysicalDeviceProperties2' size-in-bits='6592' is-struct='yes' visibility='default' id='a7f5d036'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='properties' type-id='bd625411' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='67cc387e' size-in-bits='32' id='a80cc4c5'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='128' id='a85e133a'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='dd4bec60' size-in-bits='32' id='a884f87e'/>
    <pointer-type-def type-id='df0578b9' size-in-bits='32' id='a89ccf69'/>
    <class-decl name='VkWriteDescriptorSet' size-in-bits='384' is-struct='yes' visibility='default' id='a8def84c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dstSet' type-id='c5e23716' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dstBinding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dstArrayElement' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='descriptorCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='descriptorType' type-id='3e0c9bce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pImageInfo' type-id='2e246fb7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pBufferInfo' type-id='29a6781a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pTexelBufferView' type-id='3b06cd16' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='2e4df19f' const='yes' id='a8e74c4f'/>
    <typedef-decl name='VkShaderStageFlags' type-id='c1850196' id='a910dd47'/>
    <pointer-type-def type-id='744ae60c' size-in-bits='32' id='a927f001'/>
    <typedef-decl name='VkAttachmentDescriptionFlags' type-id='c1850196' id='a9452b0f'/>
    <class-decl name='VkPhysicalDeviceLimits' size-in-bits='3968' is-struct='yes' visibility='default' id='a99993a1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='maxImageDimension1D' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='maxImageDimension2D' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='maxImageDimension3D' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='maxImageDimensionCube' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='maxImageArrayLayers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maxTexelBufferElements' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='maxUniformBufferRange' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='maxStorageBufferRange' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='maxPushConstantsSize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='maxMemoryAllocationCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='maxSamplerAllocationCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bufferImageGranularity' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sparseAddressSpaceSize' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='maxBoundDescriptorSets' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='maxPerStageDescriptorSamplers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='maxPerStageDescriptorUniformBuffers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='maxPerStageDescriptorStorageBuffers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='maxPerStageDescriptorSampledImages' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='maxPerStageDescriptorStorageImages' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='maxPerStageDescriptorInputAttachments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='maxPerStageResources' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='maxDescriptorSetSamplers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='maxDescriptorSetUniformBuffers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='maxDescriptorSetUniformBuffersDynamic' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='maxDescriptorSetStorageBuffers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='maxDescriptorSetStorageBuffersDynamic' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='maxDescriptorSetSampledImages' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='maxDescriptorSetStorageImages' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='maxDescriptorSetInputAttachments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='maxVertexInputAttributes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='maxVertexInputBindings' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='maxVertexInputAttributeOffset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='maxVertexInputBindingStride' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='maxVertexOutputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='maxTessellationGenerationLevel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='maxTessellationPatchSize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='maxTessellationControlPerVertexInputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='maxTessellationControlPerVertexOutputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='maxTessellationControlPerPatchOutputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='maxTessellationControlTotalOutputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='maxTessellationEvaluationInputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='maxTessellationEvaluationOutputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='maxGeometryShaderInvocations' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='maxGeometryInputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='maxGeometryOutputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='maxGeometryOutputVertices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='maxGeometryTotalOutputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='maxFragmentInputComponents' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='maxFragmentOutputAttachments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='maxFragmentDualSrcAttachments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='maxFragmentCombinedOutputResources' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='maxComputeSharedMemorySize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='maxComputeWorkGroupCount' type-id='6f7eb9e8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='maxComputeWorkGroupInvocations' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='maxComputeWorkGroupSize' type-id='6f7eb9e8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='subPixelPrecisionBits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='subTexelPrecisionBits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='mipmapPrecisionBits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='maxDrawIndexedIndexValue' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='maxDrawIndirectCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='maxSamplerLodBias' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='maxSamplerAnisotropy' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='maxViewports' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='maxViewportDimensions' type-id='337c1cdd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='viewportBoundsRange' type-id='83214edf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='viewportSubPixelBits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='minMemoryMapAlignment' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='minTexelBufferOffsetAlignment' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='minUniformBufferOffsetAlignment' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='minStorageBufferOffsetAlignment' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='minTexelOffset' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='maxTexelOffset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='minTexelGatherOffset' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='maxTexelGatherOffset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='minInterpolationOffset' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='maxInterpolationOffset' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='subPixelInterpolationOffsetBits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='maxFramebufferWidth' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='maxFramebufferHeight' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='maxFramebufferLayers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='framebufferColorSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='framebufferDepthSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='framebufferStencilSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='framebufferNoAttachmentsSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='maxColorAttachments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='sampledImageColorSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='sampledImageIntegerSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='sampledImageDepthSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='sampledImageStencilSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='storageImageSampleCounts' type-id='0b99c89f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='maxSampleMaskWords' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='timestampComputeAndGraphics' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='timestampPeriod' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='maxClipDistances' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='maxCullDistances' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='maxCombinedClipAndCullDistances' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='discreteQueuePriorities' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='pointSizeRange' type-id='83214edf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='lineWidthRange' type-id='83214edf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='pointSizeGranularity' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='lineWidthGranularity' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='strictLines' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='standardSampleLocations' type-id='9439f9de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='optimalBufferCopyOffsetAlignment' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='optimalBufferCopyRowPitchAlignment' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='nonCoherentAtomSize' type-id='deed538c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkSurfaceFormatKHR' size-in-bits='64' is-struct='yes' visibility='default' id='a9ef89b9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='13aa8748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='colorSpace' type-id='a0807a93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkSubpassBeginInfo' size-in-bits='96' is-struct='yes' visibility='default' id='aa0f3cfe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='contents' type-id='2c7aaccc' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkExternalFenceProperties' type-id='75510f4b' id='ab045e7c'/>
    <class-decl name='VkPhysicalDevice_T' is-struct='yes' visibility='default' is-declaration-only='yes' id='ab086272'/>
    <pointer-type-def type-id='c7354339' size-in-bits='32' id='abd896e9'/>
    <typedef-decl name='VkPipelineInputAssemblyStateCreateInfo' type-id='c963b875' id='ac1d76ac'/>
    <class-decl name='VkInstanceCreateInfo' size-in-bits='256' is-struct='yes' visibility='default' id='ac6bde01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='5a114e1b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pApplicationInfo' type-id='e1d6a08b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='enabledLayerCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ppEnabledLayerNames' type-id='13956559' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='enabledExtensionCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ppEnabledExtensionNames' type-id='13956559' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='b17d9f6e' size-in-bits='32' id='acc1b80c'/>
    <union-decl name='VkClearValue' size-in-bits='128' visibility='default' id='accbee71'>
      <data-member access='public'>
        <var-decl name='color' type-id='5164b31c' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='depthStencil' type-id='52e49980' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='18a8f8ab' size-in-bits='32' id='accce85f'/>
    <typedef-decl name='VkFramebufferCreateFlags' type-id='c1850196' id='acd5e1d5'/>
    <class-decl name='VkAndroidHardwareBufferPropertiesANDROID' size-in-bits='192' is-struct='yes' visibility='default' id='ad089bed'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocationSize' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memoryTypeBits' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='VkVertexInputBindingDescription' size-in-bits='96' is-struct='yes' visibility='default' id='adf6a475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='binding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='stride' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='inputRate' type-id='075054bd' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VkOffset2D' type-id='d00b269f' id='ae14d5f2'/>
    <pointer-type-def type-id='4f1e1808' size-in-bits='32' id='ae5ffd86'/>
    <typedef-decl name='VkSparseImageMemoryBind' type-id='13cd9d8f' id='aeed5304'/>
    <enum-decl name='VkDescriptorType' id='af65e24a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_SAMPLER' value='0'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_COMBINED_IMAGE_SAMPLER' value='1'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_SAMPLED_IMAGE' value='2'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_STORAGE_IMAGE' value='3'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_UNIFORM_TEXEL_BUFFER' value='4'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_STORAGE_TEXEL_BUFFER' value='5'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_UNIFORM_BUFFER' value='6'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_STORAGE_BUFFER' value='7'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_UNIFORM_BUFFER_DYNAMIC' value='8'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_STORAGE_BUFFER_DYNAMIC' value='9'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_INPUT_ATTACHMENT' value='10'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_INLINE_UNIFORM_BLOCK_EXT' value='1000138000'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_ACCELERATION_STRUCTURE_KHR' value='1000165000'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_ACCELERATION_STRUCTURE_NV' value='1000165000'/>
      <enumerator name='VK_DESCRIPTOR_TYPE_MAX_ENUM' value='2147483647'/>
    </enum-decl>
    <typedef-decl name='VkFormatFeatureFlags' type-id='c1850196' id='b054b9a1'/>
    <qualified-type-def type-id='4d637dbf' const='yes' id='b0bf8c08'/>
    <typedef-decl name='VkQueueFlags' type-id='c1850196' id='b0c1ef51'/>
    <typedef-decl name='VkExtent3D' type-id='b590baf5' id='b0dd0b40'/>
    <qualified-type-def type-id='23c44e7e' const='yes' id='b17d9f6e'/>
    <typedef-decl name='VkSurfaceKHR' type-id='9c313c2d' id='b1e05099'/>
    <pointer-type-def type-id='57c8c0ab' size-in-bits='32' id='b2070b13'/>
    <class-decl name='VkPipelineTessellationStateCreateInfo' size-in-bits='128' is-struct='yes' visibility='default' id='b2100bce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='a09ee4cc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='patchControlPoints' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='49493b26' const='yes' id='b2161436'/>
    <typedef-decl name='VkSparseImageMemoryRequirements' type-id='5f0d4300' id='b25bdcaf'/>
    <typedef-decl name='VkPipelineColorBlendStateCreateInfo' type-id='8fe239ff' id='b2670f78'/>
    <class-decl name='VkRenderPassCreateInfo' size-in-bits='288' is-struct='yes' visibility='default' id='b2717de7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='2dfe2d2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='attachmentCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pAttachments' type-id='a72dc272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='subpassCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pSubpasses' type-id='3ed22656' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dependencyCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pDependencies' type-id='cf25f37b' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='3d73dfdc' size-in-bits='32' id='b3699042'/>
    <typedef-decl name='VkSurfaceTransformFlagsKHR' type-id='c1850196' id='b478c344'/>
    <pointer-type-def type-id='ccf799c3' size-in-bits='32' id='b491785a'/>
    <qualified-type-def type-id='b96e5a7c' const='yes' id='b49487ec'/>
    <class-decl name='VkExtent3D' size-in-bits='96' is-struct='yes' visibility='default' id='b590baf5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='width' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='height' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depth' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <class-decl name='VkBufferCreateInfo' size-in-bits='320' is-struct='yes' visibility='default' id='b5d55ad0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sType' type-id='6add797c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pNext' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='9ec20474' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='deed538c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='usage' type-id='845d63eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='sharingMode' type-id='be84525e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queueFamilyIndexCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pQueueFamilyIndices' type-id='a6798dcc' visibility='default'/>
      </data-member>
    </class-decl>
