<abi-corpus version='2.1' architecture='elf-arm' soname='libcamera2ndk.so'>
  <elf-needed>
    <dependency name='libbinder.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libgui.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libandroid_runtime.so'/>
    <dependency name='libcamera_client.so'/>
    <dependency name='libstagefright_foundation.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libcamera_metadata.so'/>
    <dependency name='libmediandk.so'/>
    <dependency name='libnativewindow.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ACameraCaptureSession_abortCaptures' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACameraCaptureSession_capture' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACameraCaptureSession_close' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='ACaptureRequest_setEntry_physicalCamera_rational' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureRequest_setEntry_physicalCamera_u8' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureRequest_setEntry_rational' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureRequest_setEntry_u8' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureRequest_setUserContext' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionOutputContainer_add' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionOutputContainer_create' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionOutputContainer_free' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionOutputContainer_remove' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionOutput_create' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionOutput_free' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionPhysicalOutput_create' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionSharedOutput_add' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionSharedOutput_create' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ACaptureSessionSharedOutput_remove' version='LIBCAMERA2NDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <pointer-type-def type-id='3bf60ab6' size-in-bits='32' id='0052b394'/>
    <function-type size-in-bits='32' id='0053e404'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9da381c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='27c2393d' const='yes' id='0070bfec'/>
    <qualified-type-def type-id='908c82f9' const='yes' id='007ae349'/>
    <qualified-type-def type-id='8d535b36' const='yes' id='0080aa45'/>
    <pointer-type-def type-id='82303925' size-in-bits='32' id='00e9d29d'/>
    <typedef-decl name='nsecs_t' type-id='9da381c4' id='00f5ef57'/>
    <function-type size-in-bits='32' id='0149d965'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b89f496'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='4c967707' size-in-bits='32' id='014ee4dc'/>
    <pointer-type-def type-id='41c7ddad' size-in-bits='32' id='017f980d'/>
    <pointer-type-def type-id='106bd8ac' size-in-bits='32' id='01eb6566'/>
    <pointer-type-def type-id='cf567cb8' size-in-bits='32' id='01f0771e'/>
    <reference-type-def kind='lvalue' type-id='639a6c10' size-in-bits='32' id='02185902'/>
    <reference-type-def kind='lvalue' type-id='47259324' size-in-bits='32' id='02266c26'/>
    <qualified-type-def type-id='77ccf34e' const='yes' id='026c2741'/>
    <qualified-type-def type-id='cada66f6' const='yes' id='02746ca7'/>
    <qualified-type-def type-id='1317e1fb' const='yes' id='02809e8c'/>
    <typedef-decl name='ACameraMetadata' type-id='e6cb9c9e' id='0280fe4d'/>
    <pointer-type-def type-id='b66924e8' size-in-bits='32' id='0290ef52'/>
    <function-type size-in-bits='32' id='02a81098'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='02c4e402'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='c2fb5303'/>
    </function-type>
    <qualified-type-def type-id='6960ca21' const='yes' id='02ff77f1'/>
    <qualified-type-def type-id='6366ace4' const='yes' id='0318cc19'/>
    <pointer-type-def type-id='dd7295b3' size-in-bits='32' id='0323d66f'/>
    <reference-type-def kind='lvalue' type-id='68d7e4bd' size-in-bits='32' id='037dcae9'/>
    <typedef-decl name='__int16_t' type-id='a2185560' id='03896e23'/>
    <pointer-type-def type-id='3d8c391f' size-in-bits='32' id='03bcacf3'/>
    <function-type size-in-bits='32' id='03e3ce24'>
      <parameter type-id='fae49a1f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='0411e2cc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='a6979e77'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='3d1f4bea' size-in-bits='32' id='04445224'/>
    <reference-type-def kind='lvalue' type-id='e721dd0c' size-in-bits='32' id='044f291e'/>
    <pointer-type-def type-id='18165859' size-in-bits='32' id='04600c31'/>
    <pointer-type-def type-id='1e7918a7' size-in-bits='32' id='047d4fff'/>
    <reference-type-def kind='rvalue' type-id='6366ace4' size-in-bits='32' id='0480f5d8'/>
    <reference-type-def kind='lvalue' type-id='2538414b' size-in-bits='32' id='048efe97'/>
    <pointer-type-def type-id='2a068a94' size-in-bits='32' id='04939e76'/>
    <pointer-type-def type-id='14c3a3b0' size-in-bits='32' id='04aa9df2'/>
    <pointer-type-def type-id='9539c406' size-in-bits='32' id='04b3e5a0'/>
    <pointer-type-def type-id='014ee4dc' size-in-bits='32' id='05326f42'/>
    <pointer-type-def type-id='c7b95082' size-in-bits='32' id='0553fc90'/>
    <function-type size-in-bits='32' id='055a6f41'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='80f4b756'/>
    </function-type>
    <qualified-type-def type-id='21d7352a' const='yes' id='05623813'/>
    <pointer-type-def type-id='c12bf182' size-in-bits='32' id='0571aa74'/>
    <reference-type-def kind='rvalue' type-id='7321a4c8' size-in-bits='32' id='0584abdc'/>
    <qualified-type-def type-id='9ff45d67' const='yes' id='05d3ee77'/>
    <function-type size-in-bits='32' id='06074860'>
      <parameter type-id='fae49a1f'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='eb796c24' size-in-bits='32' id='060c7d5e'/>
    <pointer-type-def type-id='07d6afa7' size-in-bits='32' id='061a816f'/>
    <qualified-type-def type-id='f23f6a00' const='yes' id='0627e5a9'/>
    <qualified-type-def type-id='500299ab' const='yes' id='062c8fe8'/>
    <reference-type-def kind='lvalue' type-id='1af23cbd' size-in-bits='32' id='06556801'/>
    <reference-type-def kind='rvalue' type-id='00d599cc' size-in-bits='32' id='0664fc30'/>
    <pointer-type-def type-id='5fa8a65a' size-in-bits='32' id='067e0250'/>
    <pointer-type-def type-id='16cc647b' size-in-bits='32' id='06fbd437'/>
    <qualified-type-def type-id='199fc21a' const='yes' id='07053001'/>
    <pointer-type-def type-id='8dfe2e06' size-in-bits='32' id='071e4e5d'/>
    <pointer-type-def type-id='8b54feb4' size-in-bits='32' id='0734bf72'/>
    <pointer-type-def type-id='db9b93fa' size-in-bits='32' id='0736b484'/>
    <qualified-type-def type-id='3ae07df8' const='yes' id='074a2fe9'/>
    <pointer-type-def type-id='6d519b6e' size-in-bits='32' id='075b7a00'/>
    <reference-type-def kind='lvalue' type-id='eaca554d' size-in-bits='32' id='07847771'/>
    <qualified-type-def type-id='7194074a' const='yes' id='078f62bd'/>
    <class-decl name='_jthrowable' visibility='default' is-declaration-only='yes' id='07f10124'/>
    <function-type size-in-bits='32' id='07f91629'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <qualified-type-def type-id='c833d2f8' const='yes' id='082cc7e5'/>
    <pointer-type-def type-id='476e10bc' size-in-bits='32' id='08441c22'/>
    <pointer-type-def type-id='055a6f41' size-in-bits='32' id='08565ebd'/>
    <function-type size-in-bits='32' id='085a09e0'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='69995df8' size-in-bits='32' id='088a84fe'/>
    <typedef-decl name='jcharArray' type-id='349a45dd' id='088b642f'/>
    <pointer-type-def type-id='38f21f8c' size-in-bits='32' id='08e1942a'/>
    <pointer-type-def type-id='c9f7d0f5' size-in-bits='32' id='090a6901'/>
    <pointer-type-def type-id='7a6fe7df' size-in-bits='32' id='09176273'/>
    <pointer-type-def type-id='82f40932' size-in-bits='32' id='0944aa01'/>
    <reference-type-def kind='lvalue' type-id='0dc3d978' size-in-bits='32' id='094f2efa'/>
    <qualified-type-def type-id='56ebf1d8' const='yes' id='0979f248'/>
    <pointer-type-def type-id='0ed3c13b' size-in-bits='32' id='097c7407'/>
    <reference-type-def kind='lvalue' type-id='1cd33d8f' size-in-bits='32' id='098a110b'/>
    <typedef-decl name='jvalue' type-id='2eab072b' id='0994533b'/>
    <pointer-type-def type-id='784a10a1' size-in-bits='32' id='09b49e9d'/>
    <pointer-type-def type-id='0df80beb' size-in-bits='32' id='0a41f39b'/>
    <reference-type-def kind='lvalue' type-id='dfd28794' size-in-bits='32' id='0a6b9d36'/>
    <reference-type-def kind='lvalue' type-id='89669498' size-in-bits='32' id='0a7c271a'/>
    <pointer-type-def type-id='dcbb605e' size-in-bits='32' id='0a7e4740'/>
    <reference-type-def kind='lvalue' type-id='72f3b233' size-in-bits='32' id='0aa1570f'/>
    <pointer-type-def type-id='6d4002a8' size-in-bits='32' id='0aae1fa1'/>
    <qualified-type-def type-id='693ee6ab' const='yes' id='0abdfb52'/>
    <pointer-type-def type-id='6ab04463' size-in-bits='32' id='0ae13aef'/>
    <reference-type-def kind='rvalue' type-id='c727f5b3' size-in-bits='32' id='0b83cc73'/>
    <qualified-type-def type-id='7d3cd834' const='yes' id='0b9a0a7f'/>
    <typedef-decl name='jint' type-id='3ff5601b' id='0b9c02cb'/>
    <pointer-type-def type-id='30f9fd2c' size-in-bits='32' id='0ba6a8b6'/>
    <pointer-type-def type-id='26aee099' size-in-bits='32' id='0c10a541'/>
    <reference-type-def kind='lvalue' type-id='164eddc8' size-in-bits='32' id='0c275daa'/>
    <reference-type-def kind='lvalue' type-id='4a362c1f' size-in-bits='32' id='0c479dbb'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' id='0c9942d2'/>
    <reference-type-def kind='lvalue' type-id='7be66827' size-in-bits='32' id='0cb5b993'/>
    <pointer-type-def type-id='d413ac7e' size-in-bits='32' id='0cb5bb00'/>
    <function-type size-in-bits='32' id='0ccd5902'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <qualified-type-def type-id='760319b5' const='yes' id='0cebea86'/>
    <pointer-type-def type-id='c6b5bf17' size-in-bits='32' id='0d1c0d07'/>
    <reference-type-def kind='lvalue' type-id='7194074a' size-in-bits='32' id='0d58425c'/>
    <pointer-type-def type-id='dc1ed48c' size-in-bits='32' id='0d5970ee'/>
    <reference-type-def kind='lvalue' type-id='9a271c44' size-in-bits='32' id='0d91ae46'/>
    <pointer-type-def type-id='f0aa1618' size-in-bits='32' id='0dc0f0b6'/>
    <qualified-type-def type-id='9def79e8' const='yes' id='0dc3d978'/>
    <pointer-type-def type-id='d011aefa' size-in-bits='32' id='0de3cc28'/>
    <pointer-type-def type-id='90c673e3' size-in-bits='32' id='0de4af77'/>
    <function-type size-in-bits='32' id='0df96076'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='d4a328b7'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='27c2393d' size-in-bits='32' id='0e48132d'/>
    <pointer-type-def type-id='2f0b7817' size-in-bits='32' id='0e5e0cdb'/>
    <reference-type-def kind='rvalue' type-id='a6c45d85' size-in-bits='32' id='0e7051ad'/>
    <pointer-type-def type-id='38aff045' size-in-bits='32' id='0ea51aa5'/>
    <function-type size-in-bits='32' id='0ed3c13b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <qualified-type-def type-id='1f6df83a' const='yes' id='0f1d872f'/>
    <pointer-type-def type-id='68d7e4bd' size-in-bits='32' id='0f7dddcd'/>
    <pointer-type-def type-id='b0749e8e' size-in-bits='32' id='0faa6e74'/>
    <reference-type-def kind='rvalue' type-id='346cc318' size-in-bits='32' id='0fca8f17'/>
    <function-type size-in-bits='32' id='0fce6948'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='c25cc0ef' size-in-bits='32' id='1000e907'/>
    <pointer-type-def type-id='470aec15' size-in-bits='32' id='10182119'/>
    <function-type size-in-bits='32' id='106bd8ac'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='071e4e5d'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='ff06e1a2' size-in-bits='32' id='10856d80'/>
    <class-decl name='ACameraMetadata_rational' is-struct='yes' visibility='default' is-declaration-only='yes' id='10ee5a45'/>
    <reference-type-def kind='lvalue' type-id='6f9ee57c' size-in-bits='32' id='11230cae'/>
    <pointer-type-def type-id='fcbd9376' size-in-bits='32' id='1145dfec'/>
    <reference-type-def kind='lvalue' type-id='c7b95082' size-in-bits='32' id='11540f74'/>
    <pointer-type-def type-id='7194074a' size-in-bits='32' id='115848a8'/>
    <reference-type-def kind='rvalue' type-id='d5605f7b' size-in-bits='32' id='115ce4ab'/>
    <pointer-type-def type-id='0df7597f' size-in-bits='32' id='11821397'/>
    <pointer-type-def type-id='b05c3be5' size-in-bits='32' id='11b6c5f5'/>
    <function-type size-in-bits='32' id='126e53d0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <typedef-decl name='ACameraCaptureSession_captureCallback_start' type-id='04939e76' id='1280ba53'/>
    <reference-type-def kind='lvalue' type-id='5d60e735' size-in-bits='32' id='128bc2e9'/>
    <typedef-decl name='ACameraMetadata_const_entry' type-id='96a92ccd' id='1302695e'/>
    <reference-type-def kind='lvalue' type-id='4b5d8a96' size-in-bits='32' id='13174098'/>
    <pointer-type-def type-id='bed9a8c1' size-in-bits='32' id='13196dfd'/>
    <qualified-type-def type-id='c7b95082' const='yes' id='1377b429'/>
    <pointer-type-def type-id='e4318eab' size-in-bits='32' id='137ecb5b'/>
    <pointer-type-def type-id='b99c00c9' size-in-bits='32' id='13956559'/>
    <qualified-type-def type-id='2214e443' const='yes' id='13c66d8e'/>
    <pointer-type-def type-id='efb1bb95' size-in-bits='32' id='13ca8dad'/>
    <reference-type-def kind='lvalue' type-id='72b1f7a0' size-in-bits='32' id='1428a7f2'/>
    <pointer-type-def type-id='cada66f6' size-in-bits='32' id='1428aabc'/>
    <typedef-decl name='size_type' type-id='b59d7dce' id='143a6b6e'/>
    <function-type size-in-bits='32' id='148c6738'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='dbd873d7' size-in-bits='32' id='148d03cf'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <qualified-type-def type-id='115848a8' const='yes' id='14ba0a7b'/>
    <function-type size-in-bits='32' id='14c3a3b0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='1f3810cb'/>
    </function-type>
    <pointer-type-def type-id='fdf9f098' size-in-bits='32' id='14c7458e'/>
    <qualified-type-def type-id='326cdeee' const='yes' id='14f61f5e'/>
    <pointer-type-def type-id='38d85c8f' size-in-bits='32' id='151a1d63'/>
    <typedef-decl name='jshortArray' type-id='3239e3af' id='152bf3a9'/>
    <reference-type-def kind='lvalue' type-id='50cffff8' size-in-bits='32' id='156fca7a'/>
    <pointer-type-def type-id='dc0046e1' size-in-bits='32' id='157d76dd'/>
    <pointer-type-def type-id='bf1e0391' size-in-bits='32' id='15887ec5'/>
    <qualified-type-def type-id='742db7d5' const='yes' id='15896165'/>
    <reference-type-def kind='lvalue' type-id='b05c3be5' size-in-bits='32' id='15b6cc41'/>
    <pointer-type-def type-id='fb46a283' size-in-bits='32' id='15b6e673'/>
    <reference-type-def kind='lvalue' type-id='a9189dc2' size-in-bits='32' id='15c08dec'/>
    <reference-type-def kind='rvalue' type-id='953503e1' size-in-bits='32' id='15c51941'/>
    <pointer-type-def type-id='4d503755' size-in-bits='32' id='15cb44c5'/>
    <reference-type-def kind='rvalue' type-id='1afd9f8b' size-in-bits='32' id='15db188b'/>
    <pointer-type-def type-id='aca2cd7e' size-in-bits='32' id='162473c8'/>
    <qualified-type-def type-id='1ab09733' const='yes' id='164eddc8'/>
    <pointer-type-def type-id='356da24e' size-in-bits='32' id='167270f4'/>
    <reference-type-def kind='lvalue' type-id='e3c90ea7' size-in-bits='32' id='1681d513'/>
    <qualified-type-def type-id='41c7e19d' const='yes' id='168d64f2'/>
    <function-type size-in-bits='32' id='16cc647b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='a098fd0c' size-in-bits='32' id='17b5999a'/>
    <pointer-type-def type-id='74a83c45' size-in-bits='32' id='17b93cd5'/>
    <pointer-type-def type-id='e0efb9de' size-in-bits='32' id='17d955f8'/>
    <pointer-type-def type-id='5fde1a5b' size-in-bits='32' id='17e4d497'/>
    <pointer-type-def type-id='c3a70532' size-in-bits='32' id='17ed04c8'/>
    <function-type size-in-bits='32' id='181a3db0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='973e3c3f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jintArray' type-id='0faa6e74' id='181f4ac0'/>
    <reference-type-def kind='lvalue' type-id='cada66f6' size-in-bits='32' id='1828b108'/>
    <pointer-type-def type-id='95d32fc8' size-in-bits='32' id='187251e2'/>
    <function-type size-in-bits='32' id='18caaa83'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='3204b3f6' size-in-bits='32' id='18d92df7'/>
    <reference-type-def kind='lvalue' type-id='1ab09733' size-in-bits='32' id='18fdd60f'/>
    <class-decl name='ACameraManager_ExtendedAvailabilityListener' size-in-bits='320' is-struct='yes' visibility='default' id='190d429d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='availabilityCallbacks' type-id='2637f885' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='onCameraAccessPrioritiesChanged' type-id='21ee9fc5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='onPhysicalCameraAvailable' type-id='f708caaa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='onPhysicalCameraUnavailable' type-id='f708caaa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved' type-id='209ef23f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='ca62bfca' size-in-bits='32' id='1930d02c'/>
    <pointer-type-def type-id='181a3db0' size-in-bits='32' id='195d3e42'/>
    <pointer-type-def type-id='62f4575f' size-in-bits='32' id='19672083'/>
    <reference-type-def kind='lvalue' type-id='74fa90d5' size-in-bits='32' id='19722e89'/>
    <reference-type-def kind='lvalue' type-id='f8299b7f' size-in-bits='32' id='19a79523'/>
    <qualified-type-def type-id='5d58ba7c' const='yes' id='19a9b64c'/>
    <reference-type-def kind='lvalue' type-id='2432e338' size-in-bits='32' id='1a1b883a'/>
    <pointer-type-def type-id='acaf0bb1' size-in-bits='32' id='1a33f029'/>
    <typedef-decl name='jfloat' type-id='a6c45d85' id='1a7fe6b0'/>
    <reference-type-def kind='lvalue' type-id='40249207' size-in-bits='32' id='1a9209f3'/>
    <pointer-type-def type-id='61356d67' size-in-bits='32' id='1a947f6f'/>
    <function-type size-in-bits='32' id='1a9d598b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='bacf3393' size-in-bits='32' id='1ab09733'/>
    <function-type size-in-bits='32' id='1ab7137e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='38565182'/>
    </function-type>
    <pointer-type-def type-id='31cf2794' size-in-bits='32' id='1ad79892'/>
    <pointer-type-def type-id='2e46a068' size-in-bits='32' id='1af20502'/>
    <qualified-type-def type-id='6e81b4be' const='yes' id='1af23cbd'/>
    <reference-type-def kind='lvalue' type-id='7c9ba3d4' size-in-bits='32' id='1b0315f6'/>
    <pointer-type-def type-id='2091603e' size-in-bits='32' id='1b0d8c84'/>
    <reference-type-def kind='lvalue' type-id='744d9a23' size-in-bits='32' id='1b2975df'/>
    <reference-type-def kind='lvalue' type-id='80e9e90d' size-in-bits='32' id='1b3a0eb1'/>
    <pointer-type-def type-id='867f015c' size-in-bits='32' id='1ba84b2a'/>
    <reference-type-def kind='lvalue' type-id='5f434503' size-in-bits='32' id='1be5d93f'/>
    <qualified-type-def type-id='db4d5c20' const='yes' id='1c02351b'/>
    <qualified-type-def type-id='7bd9b712' const='yes' id='1c2cb422'/>
    <pointer-type-def type-id='ecec83c5' size-in-bits='32' id='1c35da75'/>
    <reference-type-def kind='rvalue' type-id='c8491dd8' size-in-bits='32' id='1c78badc'/>
    <pointer-type-def type-id='34c2ba24' size-in-bits='32' id='1c8ae40a'/>
    <pointer-type-def type-id='140c2675' size-in-bits='32' id='1ca38bd5'/>
    <reference-type-def kind='lvalue' type-id='be3e2187' size-in-bits='32' id='1ccef073'/>
    <qualified-type-def type-id='98cfc42a' const='yes' id='1cd33d8f'/>
    <function-type size-in-bits='32' id='1cd86ccf'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='fe213acd' size-in-bits='32' id='1d2f8a91'/>
    <function-type size-in-bits='32' id='1d639c93'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='8ec52105'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <qualified-type-def type-id='a35bd70b' const='yes' id='1d81be5b'/>
    <pointer-type-def type-id='d1ff2147' size-in-bits='32' id='1db4c5bb'/>
    <function-type size-in-bits='32' id='1dba3069'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='1ded82e5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='adf18958'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='c3ed119a' size-in-bits='32' id='1e32d810'/>
    <qualified-type-def type-id='00f5ef57' const='yes' id='1e3bd547'/>
    <class-decl name='_jbyteArray' visibility='default' is-declaration-only='yes' id='1e7918a7'/>
    <pointer-type-def type-id='99f546a8' size-in-bits='32' id='1e9b69ae'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <reference-type-def kind='lvalue' type-id='2e52cf5c' size-in-bits='32' id='1ed21fc6'/>
    <reference-type-def kind='lvalue' type-id='9f2377bc' size-in-bits='32' id='1ed5476e'/>
    <reference-type-def kind='lvalue' type-id='0318cc19' size-in-bits='32' id='1f09872d'/>
    <reference-type-def kind='lvalue' type-id='862784c9' size-in-bits='32' id='1f36443d'/>
    <typedef-decl name='jfieldID' type-id='ee3187c5' id='1f3810cb'/>
    <pointer-type-def type-id='922df12b' size-in-bits='32' id='1f526493'/>
    <pointer-type-def type-id='5fea4ff8' size-in-bits='32' id='1f57b15a'/>
    <class-decl name='ACameraOutputTargets' size-in-bits='96' is-struct='yes' visibility='default' id='1f6f9334'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mOutputs' type-id='bf774091' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c4c77bfc' size-in-bits='32' id='1f865a3a'/>
    <function-type size-in-bits='32' id='1f8f9f18'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='b99c00c9' size-in-bits='32' id='1f95783d'/>
    <pointer-type-def type-id='56c055db' size-in-bits='32' id='1fda464f'/>
    <pointer-type-def type-id='5f434503' size-in-bits='32' id='1fe5df8b'/>
    <pointer-type-def type-id='40660a2d' size-in-bits='32' id='1fe9cd9d'/>
    <pointer-type-def type-id='31d87a2b' size-in-bits='32' id='2041a8d7'/>
    <reference-type-def kind='lvalue' type-id='083f931d' size-in-bits='32' id='205a8b30'/>
    <qualified-type-def type-id='38a7bde3' const='yes' id='208677b8'/>
    <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='128' id='209ef23f'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <qualified-type-def type-id='f0981eeb' const='yes' id='20f5f452'/>
    <function-type size-in-bits='32' id='21042e4a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='84110544' size-in-bits='32' id='210c37a6'/>
    <typedef-decl name='camera_metadata_t' type-id='96e4f1e6' id='21185622'/>
    <pointer-type-def type-id='d5c4ab4c' size-in-bits='32' id='21231b1a'/>
    <reference-type-def kind='lvalue' type-id='f117c1bf' size-in-bits='32' id='2165c3db'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <pointer-type-def type-id='680601aa' size-in-bits='32' id='217b77c8'/>
    <typedef-decl name='ACaptureRequest' type-id='8834d82b' id='2186eb60'/>
    <typedef-decl name='ACameraManager_AccessPrioritiesChangedCallback' type-id='b7f9d8e6' id='21ee9fc5'/>
    <function-type size-in-bits='32' id='21fee85f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='223133a2'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='a6979e77'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='f1215fad' size-in-bits='32' id='228967d1'/>
    <qualified-type-def type-id='4993e123' const='yes' id='22d1a9b3'/>
    <reference-type-def kind='lvalue' type-id='f30500b4' size-in-bits='32' id='22dfe5d6'/>
    <class-decl name='ACameraOutputTarget' size-in-bits='32' is-struct='yes' visibility='default' id='2357f00f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mWindow' type-id='2d8486a3' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACameraOutputTarget' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='d523b107' is-artificial='yes'/>
          <parameter type-id='2d8486a3'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='94b3f3d2' size-in-bits='32' id='23846a30'/>
    <pointer-type-def type-id='57aaeac5' size-in-bits='32' id='239d7ad9'/>
    <typedef-decl name='int16_t' type-id='03896e23' id='23bd8cb5'/>
    <reference-type-def kind='lvalue' type-id='03a37aa9' size-in-bits='32' id='23eaa354'/>
    <pointer-type-def type-id='991ecdf5' size-in-bits='32' id='2423a535'/>
    <qualified-type-def type-id='23d9c008' const='yes' id='2432e338'/>
    <qualified-type-def type-id='60cca661' const='yes' id='243d7df1'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <qualified-type-def type-id='fafa91c1' const='yes' id='248dded1'/>
    <pointer-type-def type-id='9884ef0e' size-in-bits='32' id='24a161d4'/>
    <reference-type-def kind='rvalue' type-id='fee63a6d' size-in-bits='32' id='24b638bd'/>
    <reference-type-def kind='lvalue' type-id='60a78cdb' size-in-bits='32' id='24c2f247'/>
    <reference-type-def kind='lvalue' type-id='3e934885' size-in-bits='32' id='24db5899'/>
    <qualified-type-def type-id='1b40f38a' const='yes' id='2538414b'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='ACameraCaptureSession_captureCallback_failed' type-id='63f10dea' id='253d86a0'/>
    <qualified-type-def type-id='8d551f68' const='yes' id='2555c0e3'/>
    <pointer-type-def type-id='5e933196' size-in-bits='32' id='255ff5d8'/>
    <reference-type-def kind='rvalue' type-id='a419a827' size-in-bits='32' id='25719717'/>
    <pointer-type-def type-id='f8299b7f' size-in-bits='32' id='25a7a807'/>
    <reference-type-def kind='rvalue' type-id='7abe72a4' size-in-bits='32' id='25b2af80'/>
    <qualified-type-def type-id='68d7e4bd' const='yes' id='25c9c19a'/>
    <pointer-type-def type-id='731574db' size-in-bits='32' id='25dbb38b'/>
    <reference-type-def kind='lvalue' type-id='2199750a' size-in-bits='32' id='26019e5c'/>
    <typedef-decl name='ACameraManager_AvailabilityCallbacks' type-id='5646a760' id='2637f885'/>
    <reference-type-def kind='rvalue' type-id='99f546a8' size-in-bits='32' id='269d440c'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <reference-type-def kind='lvalue' type-id='bacf3393' size-in-bits='32' id='26b0aa17'/>
    <function-type size-in-bits='32' id='26ee7735'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='640aedbe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='26e693c4' size-in-bits='32' id='26fb5e72'/>
    <qualified-type-def type-id='ed970554' const='yes' id='270b873f'/>
    <function-type size-in-bits='32' id='27a87596'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='ccec19b6' size-in-bits='32' id='27ac3db0'/>
    <reference-type-def kind='lvalue' type-id='16a994c9' size-in-bits='32' id='285535a8'/>
    <reference-type-def kind='lvalue' type-id='18b0cc4f' size-in-bits='32' id='28562303'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='ALogicalCameraCaptureFailure' size-in-bits='256' is-struct='yes' visibility='default' id='2865b1a8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='captureFailure' type-id='c2f20afb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='physicalCameraId' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='54912122' size-in-bits='32' id='2876ff98'/>
    <reference-type-def kind='lvalue' type-id='1c60fd14' size-in-bits='32' id='288be63e'/>
    <reference-type-def kind='lvalue' type-id='df899665' size-in-bits='32' id='28978b79'/>
    <qualified-type-def type-id='bcaa9b4f' const='yes' id='28aa8eff'/>
    <pointer-type-def type-id='ef4ff6eb' size-in-bits='32' id='29237c57'/>
    <reference-type-def kind='lvalue' type-id='e8bae7ed' size-in-bits='32' id='293ae491'/>
    <class-decl name='ACameraDevice_StateCallbacks' size-in-bits='96' is-struct='yes' visibility='default' id='293e73a9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onDisconnected' type-id='87c9e0a3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='onError' type-id='728c8613' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='e69beb08' size-in-bits='32' id='29732686'/>
    <function-type size-in-bits='32' id='2987b0c7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='f7cb1f6a' size-in-bits='32' id='29bfa078'/>
    <pointer-type-def type-id='2199750a' size-in-bits='32' id='2a01a4a8'/>
    <function-type size-in-bits='32' id='2a068a94'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='45c42eae'/>
      <parameter type-id='9da381c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='8202de7d' size-in-bits='32' id='2a09f84d'/>
    <reference-type-def kind='lvalue' type-id='a6c45d85' size-in-bits='32' id='2a1f6799'/>
    <reference-type-def kind='lvalue' type-id='c3ed119a' size-in-bits='32' id='2a32eaf4'/>
    <reference-type-def kind='lvalue' type-id='15896165' size-in-bits='32' id='2a441c79'/>
    <reference-type-def kind='rvalue' type-id='46767cd5' size-in-bits='32' id='2a4818c5'/>
    <pointer-type-def type-id='c330caa7' size-in-bits='32' id='2a894f0f'/>
    <reference-type-def kind='rvalue' type-id='291a51eb' size-in-bits='32' id='2a8a14bb'/>
    <qualified-type-def type-id='1c60fd14' const='yes' id='2a9e3ce7'/>
    <reference-type-def kind='lvalue' type-id='a84c031d' size-in-bits='32' id='2aa915e1'/>
    <reference-type-def kind='rvalue' type-id='c2479237' size-in-bits='32' id='2abc8237'/>
    <pointer-type-def type-id='2e52cf5c' size-in-bits='32' id='2ad232aa'/>
    <typedef-decl name='va_list' type-id='7f896fb4' id='2aee9912'/>
    <reference-type-def kind='lvalue' type-id='808000be' size-in-bits='32' id='2af383f0'/>
    <function-type size-in-bits='32' id='2b209300'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='c1647b90' size-in-bits='32' id='2b2ec5ce'/>
    <qualified-type-def type-id='d040f4c1' const='yes' id='2b544340'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <reference-type-def kind='lvalue' type-id='802f4dbd' size-in-bits='32' id='2b64bcc8'/>
    <qualified-type-def type-id='2bf6096a' const='yes' id='2b884d91'/>
    <pointer-type-def type-id='760319b5' size-in-bits='32' id='2bca2025'/>
    <reference-type-def kind='lvalue' type-id='97b3d57a' size-in-bits='32' id='2c18dfd4'/>
    <typedef-decl name='jsize' type-id='0b9c02cb' id='2c2f1adb'/>
    <pointer-type-def type-id='860e8f90' size-in-bits='32' id='2c3f3166'/>
    <pointer-type-def type-id='ef48369b' size-in-bits='32' id='2c684c9f'/>
    <reference-type-def kind='lvalue' type-id='b28eb34a' size-in-bits='32' id='2c6e24ac'/>
    <function-type size-in-bits='32' id='2c8ecc6a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='c2fb5303'/>
      <return type-id='48b5725f'/>
    </function-type>
    <class-decl name='_jbooleanArray' visibility='default' is-declaration-only='yes' id='2ca86b0d'/>
    <pointer-type-def type-id='3e733c7e' size-in-bits='32' id='2d3fb794'/>
    <typedef-decl name='jobjectArray' type-id='14c7458e' id='2d5e6f72'/>
    <reference-type-def kind='lvalue' type-id='93f1ab6e' size-in-bits='32' id='2d70a258'/>
    <pointer-type-def type-id='e376d34c' size-in-bits='32' id='2d8486a3'/>
    <reference-type-def kind='lvalue' type-id='0080aa45' size-in-bits='32' id='2d8c39d9'/>
    <pointer-type-def type-id='6a3187ab' size-in-bits='32' id='2da5edeb'/>
    <qualified-type-def type-id='c214b7fe' const='yes' id='2da719ae'/>
    <pointer-type-def type-id='d776b039' size-in-bits='32' id='2dab161d'/>
    <pointer-type-def type-id='b7e7edbe' size-in-bits='32' id='2dcc8b98'/>
    <pointer-type-def type-id='1afd9f8b' size-in-bits='32' id='2de0ce5b'/>
    <qualified-type-def type-id='1a30a429' const='yes' id='2de2ccd9'/>
    <pointer-type-def type-id='a1159711' size-in-bits='32' id='2deb20e5'/>
    <reference-type-def kind='lvalue' type-id='e4e736f0' size-in-bits='32' id='2dfb52e2'/>
    <reference-type-def kind='rvalue' type-id='7c6c74ea' size-in-bits='32' id='2e01d9fe'/>
    <function-type size-in-bits='32' id='2e19a82f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2d5e6f72'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='99463423' size-in-bits='32' id='2e1e1cf7'/>
    <function-type size-in-bits='32' id='2e46a068'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='6f4c521b'/>
      <parameter type-id='efb1bb95'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='13ca8dad'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2e613a3e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='96f3d089'/>
    </function-type>
    <class-decl name='_jfieldID' is-struct='yes' visibility='default' is-declaration-only='yes' id='2e67d715'/>
    <function-type size-in-bits='32' id='2e6e32b5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='c5b6437f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='b8a2913a' size-in-bits='32' id='2e93afb3'/>
    <qualified-type-def type-id='fd376fcf' const='yes' id='2e96e5aa'/>
    <union-decl name='jvalue' visibility='default' is-declaration-only='yes' id='2eab072b'/>
    <reference-type-def kind='lvalue' type-id='a32c4876' size-in-bits='32' id='2eb5d5f0'/>
    <function-type size-in-bits='32' id='2f02ea7a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='2f03f5b7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='a8d5bec6'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='2f0b7817'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='e90b7d78' size-in-bits='32' id='2f164816'/>
    <reference-type-def kind='lvalue' type-id='a33d1010' size-in-bits='32' id='2f208502'/>
    <reference-type-def kind='lvalue' type-id='6316fd14' size-in-bits='32' id='2f3095b6'/>
    <reference-type-def kind='rvalue' type-id='d4063a8f' size-in-bits='32' id='2f45c03f'/>
    <qualified-type-def type-id='a85d4248' const='yes' id='2f65eb78'/>
    <qualified-type-def type-id='04e3192c' const='yes' id='2f804dfc'/>
    <reference-type-def kind='lvalue' type-id='77e49a55' size-in-bits='32' id='2fdf2309'/>
    <pointer-type-def type-id='397d9db3' size-in-bits='32' id='2fecf143'/>
    <pointer-type-def type-id='59330a47' size-in-bits='32' id='30411993'/>
    <typedef-decl name='ACameraOutputTargets' type-id='1f6f9334' id='305940d1'/>
    <pointer-type-def type-id='b28eb34a' size-in-bits='32' id='306e2af8'/>
    <reference-type-def kind='lvalue' type-id='007ae349' size-in-bits='32' id='307407bd'/>
    <function-type size-in-bits='32' id='307d2c7d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='1ab7137e' size-in-bits='32' id='30974818'/>
    <class-decl name='_jshortArray' visibility='default' is-declaration-only='yes' id='30a4d497'/>
    <pointer-type-def type-id='83574fe4' size-in-bits='32' id='30b9a8ce'/>
    <reference-type-def kind='rvalue' type-id='38aff045' size-in-bits='32' id='30f2b275'/>
    <function-type size-in-bits='32' id='30f9fd2c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='c2fb5303'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='654b3b9a' size-in-bits='32' id='316f08f4'/>
    <reference-type-def kind='lvalue' type-id='4bd3d2f5' size-in-bits='32' id='3174e229'/>
    <function-type size-in-bits='32' id='3197286d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='31d87a2b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='181f4ac0'/>
    </function-type>
    <pointer-type-def type-id='dc0b1ac7' size-in-bits='32' id='31ebf17b'/>
    <pointer-type-def type-id='e4e736f0' size-in-bits='32' id='31fb592e'/>
    <pointer-type-def type-id='30a4d497' size-in-bits='32' id='3239e3af'/>
    <reference-type-def kind='rvalue' type-id='23f80699' size-in-bits='32' id='323d7d39'/>
    <pointer-type-def type-id='82d29439' size-in-bits='32' id='326df5b5'/>
    <pointer-type-def type-id='becc7143' size-in-bits='32' id='3271bf2f'/>
    <pointer-type-def type-id='305940d1' size-in-bits='32' id='32901832'/>
    <reference-type-def kind='lvalue' type-id='d42b1915' size-in-bits='32' id='32d8ab49'/>
    <pointer-type-def type-id='42337f0c' size-in-bits='32' id='3318dad6'/>
    <pointer-type-def type-id='2f03f5b7' size-in-bits='32' id='3358ddb3'/>
    <pointer-type-def type-id='223133a2' size-in-bits='32' id='33683384'/>
    <qualified-type-def type-id='96492bd6' const='yes' id='33734e9b'/>
    <pointer-type-def type-id='41b981f8' size-in-bits='32' id='337e1672'/>
    <pointer-type-def type-id='554d87f1' size-in-bits='32' id='339f696d'/>
    <pointer-type-def type-id='1d552e7d' size-in-bits='32' id='33f4b9ed'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <reference-type-def kind='rvalue' type-id='c1aa2e6a' size-in-bits='32' id='340cc00e'/>
    <reference-type-def kind='lvalue' type-id='07053001' size-in-bits='32' id='342acd65'/>
    <pointer-type-def type-id='18b0cc4f' size-in-bits='32' id='345635e7'/>
    <pointer-type-def type-id='18caaa83' size-in-bits='32' id='3459b4cf'/>
    <reference-type-def kind='lvalue' type-id='59c9a1fa' size-in-bits='32' id='3469cd54'/>
    <pointer-type-def type-id='2e6e32b5' size-in-bits='32' id='348c02e9'/>
    <pointer-type-def type-id='eeed1f5d' size-in-bits='32' id='349a45dd'/>
    <pointer-type-def type-id='0053e404' size-in-bits='32' id='34bd81ae'/>
    <qualified-type-def type-id='936a69c9' const='yes' id='34c2ba24'/>
    <pointer-type-def type-id='7f8ca3fe' size-in-bits='32' id='34c67260'/>
    <reference-type-def kind='lvalue' type-id='a42e64e6' size-in-bits='32' id='35089a40'/>
    <reference-type-def kind='lvalue' type-id='605189b3' size-in-bits='32' id='355b958f'/>
    <reference-type-def kind='lvalue' type-id='eb9fd26f' size-in-bits='32' id='359808eb'/>
    <qualified-type-def type-id='c70437bc' const='yes' id='35b2a69f'/>
    <reference-type-def kind='lvalue' type-id='e89f4e25' size-in-bits='32' id='35c7ceb9'/>
    <pointer-type-def type-id='307d2c7d' size-in-bits='32' id='362e2831'/>
    <pointer-type-def type-id='05fd149f' size-in-bits='32' id='3667c307'/>
    <qualified-type-def type-id='d5605f7b' const='yes' id='368848f2'/>
    <pointer-type-def type-id='808000be' size-in-bits='32' id='36f396d4'/>
    <reference-type-def kind='lvalue' type-id='026c2741' size-in-bits='32' id='37420725'/>
    <reference-type-def kind='lvalue' type-id='bf84559c' size-in-bits='32' id='3752f3ce'/>
    <qualified-type-def type-id='44f4c31c' const='yes' id='376dced9'/>
    <pointer-type-def type-id='bd86d803' size-in-bits='32' id='37732cf3'/>
    <pointer-type-def type-id='b142692f' size-in-bits='32' id='377b5e63'/>
    <pointer-type-def type-id='e44fdfb2' size-in-bits='32' id='378b5a50'/>
    <reference-type-def kind='lvalue' type-id='c380fa52' size-in-bits='32' id='380a449c'/>
    <reference-type-def kind='rvalue' type-id='87e0363f' size-in-bits='32' id='38358baf'/>
    <typedef-decl name='jmethodID' type-id='b09bab5e' id='38565182'/>
    <reference-type-def kind='lvalue' type-id='4f4a9440' size-in-bits='32' id='38679c92'/>
    <function-type size-in-bits='32' id='386e18fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='a6979e77'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='25c9c19a' size-in-bits='32' id='389bfaf4'/>
    <reference-type-def kind='lvalue' type-id='6f5fb9c3' size-in-bits='32' id='38b1a37f'/>
    <reference-type-def kind='lvalue' type-id='7d3cd834' size-in-bits='32' id='38c82456'/>
    <function-type size-in-bits='32' id='38d85c8f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='38edd3d4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='96f3d089'/>
      <return type-id='2d5e6f72'/>
    </function-type>
    <qualified-type-def type-id='21eadfd1' const='yes' id='397866e2'/>
    <qualified-type-def type-id='21c31e25' const='yes' id='3a2c66cc'/>
    <pointer-type-def type-id='6e835a19' size-in-bits='32' id='3a8fe115'/>
    <reference-type-def kind='lvalue' type-id='2de2ccd9' size-in-bits='32' id='3b08b56d'/>
    <reference-type-def kind='rvalue' type-id='9523e199' size-in-bits='32' id='3b144019'/>
    <reference-type-def kind='lvalue' type-id='e90b7d78' size-in-bits='32' id='3b165afa'/>
    <pointer-type-def type-id='9bf2d596' size-in-bits='32' id='3b4676f4'/>
    <reference-type-def kind='lvalue' type-id='7e592d73' size-in-bits='32' id='3b625ccf'/>
    <function-type size-in-bits='32' id='3b720171'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='96f3d089'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='2bf6096a' size-in-bits='32' id='3b86e57c'/>
    <reference-type-def kind='lvalue' type-id='810dc035' size-in-bits='32' id='3ba55de9'/>
    <pointer-type-def type-id='e4ac11d4' size-in-bits='32' id='3bce5f02'/>
    <pointer-type-def type-id='2987b0c7' size-in-bits='32' id='3bd86cfb'/>
    <pointer-type-def type-id='bfa0e315' size-in-bits='32' id='3be1fa35'/>
    <qualified-type-def type-id='7816db5b' const='yes' id='3bf60ab6'/>
    <pointer-type-def type-id='94c77445' size-in-bits='32' id='3c32a875'/>
    <reference-type-def kind='lvalue' type-id='397866e2' size-in-bits='32' id='3c89c68c'/>
    <pointer-type-def type-id='897a51fb' size-in-bits='32' id='3c8ecc03'/>
    <reference-type-def kind='lvalue' type-id='785771ed' size-in-bits='32' id='3ca82291'/>
    <qualified-type-def type-id='92cce770' const='yes' id='3d00a6e0'/>
    <qualified-type-def type-id='783dcbfa' const='yes' id='3d1f4bea'/>
    <function-type size-in-bits='32' id='3d2d0c38'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='1a7fe6b0'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='d09ee9a8' size-in-bits='32' id='3d427cbb'/>
    <pointer-type-def type-id='27fe3097' size-in-bits='32' id='3d53610f'/>
    <pointer-type-def type-id='b8d5136c' size-in-bits='32' id='3d6d5732'/>
    <pointer-type-def type-id='4bd3d2f5' size-in-bits='32' id='3d74f50d'/>
    <reference-type-def kind='lvalue' type-id='7a7f5f41' size-in-bits='32' id='3d832f25'/>
    <function-type size-in-bits='32' id='3d8c391f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='6c9a8402'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='e703acb5' size-in-bits='32' id='3dc8ab69'/>
    <pointer-type-def type-id='03f240eb' size-in-bits='32' id='3ddb2ecc'/>
    <qualified-type-def type-id='b39df991' const='yes' id='3ddd2dbc'/>
    <reference-type-def kind='rvalue' type-id='551a3c84' size-in-bits='32' id='3de238c8'/>
    <reference-type-def kind='lvalue' type-id='06ee45bd' size-in-bits='32' id='3e20d199'/>
    <qualified-type-def type-id='23af9275' const='yes' id='3e4ed4c6'/>
    <reference-type-def kind='lvalue' type-id='2b884d91' size-in-bits='32' id='3e925715'/>
    <qualified-type-def type-id='f7f99c02' const='yes' id='3e934885'/>
    <function-type size-in-bits='32' id='3eafa32f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <qualified-type-def type-id='adf18958' const='yes' id='3ebf19c8'/>
    <pointer-type-def type-id='565960bf' size-in-bits='32' id='3f7ede67'/>
    <pointer-type-def type-id='2bf6096a' size-in-bits='32' id='3f86ebc8'/>
    <pointer-type-def type-id='e7dd31fc' size-in-bits='32' id='3f8e232a'/>
    <reference-type-def kind='lvalue' type-id='69496ea7' size-in-bits='32' id='3f98f513'/>
    <function-type size-in-bits='32' id='3fa8e199'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='0627e5a9' size-in-bits='32' id='3fce601d'/>
    <pointer-type-def type-id='ae9623b5' size-in-bits='32' id='3fe97c25'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <qualified-type-def type-id='3b673277' const='yes' id='40249207'/>
    <pointer-type-def type-id='fb98e614' size-in-bits='32' id='407a0a12'/>
    <reference-type-def kind='lvalue' type-id='d2169ba1' size-in-bits='32' id='4096d585'/>
    <pointer-type-def type-id='fd376fcf' size-in-bits='32' id='40a3d947'/>
    <reference-type-def kind='lvalue' type-id='376dced9' size-in-bits='32' id='40dcdb6d'/>
    <reference-type-def kind='lvalue' type-id='5c14e06a' size-in-bits='32' id='40dd17a4'/>
    <pointer-type-def type-id='7de99def' size-in-bits='32' id='40f183ab'/>
    <pointer-type-def type-id='6da5b67e' size-in-bits='32' id='412650f8'/>
    <pointer-type-def type-id='7be75d9e' size-in-bits='32' id='4127a730'/>
    <function-type size-in-bits='32' id='41301cf9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='b9c972b8' size-in-bits='32' id='413559e2'/>
    <function-type size-in-bits='32' id='413b072a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='35b2a69f' size-in-bits='32' id='413c753b'/>
    <function-type size-in-bits='32' id='4142d35b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='1302695e' size-in-bits='32' id='4183b90d'/>
    <function-type size-in-bits='32' id='41b981f8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='e89f4e25' size-in-bits='32' id='41c7e19d'/>
    <pointer-type-def type-id='0fce6948' size-in-bits='32' id='41d61b6a'/>
    <pointer-type-def type-id='60a59244' size-in-bits='32' id='41da4542'/>
    <qualified-type-def type-id='3c207afe' const='yes' id='42021ec3'/>
    <pointer-type-def type-id='1a3e4cae' size-in-bits='32' id='4221fc54'/>
    <function-type size-in-bits='32' id='42337f0c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='d88c39bb' size-in-bits='32' id='4233bd9b'/>
    <reference-type-def kind='lvalue' type-id='72fefe1d' size-in-bits='32' id='426a36e1'/>
    <pointer-type-def type-id='e24417ff' size-in-bits='32' id='4278623b'/>
    <qualified-type-def type-id='346cc318' const='yes' id='42bf2268'/>
    <qualified-type-def type-id='dea3ef0c' const='yes' id='435025b7'/>
    <reference-type-def kind='lvalue' type-id='edbf6dd9' size-in-bits='32' id='435a286d'/>
    <pointer-type-def type-id='3da62952' size-in-bits='32' id='436afaf0'/>
    <reference-type-def kind='lvalue' type-id='e44fdfb2' size-in-bits='32' id='438b6d34'/>
    <qualified-type-def type-id='3f1fbea7' const='yes' id='43a1e744'/>
    <reference-type-def kind='lvalue' type-id='a3f5ae0e' size-in-bits='32' id='43c128f8'/>
    <pointer-type-def type-id='83568ea8' size-in-bits='32' id='43cf345e'/>
    <pointer-type-def type-id='b40e1a4a' size-in-bits='32' id='43eed7c8'/>
    <qualified-type-def type-id='a419a827' const='yes' id='43ffacc6'/>
    <class-decl name='_jarray' size-in-bits='8' visibility='default' id='440aaf49'>
      <base-class access='public' layout-offset-in-bits='0' type-id='baffb083'/>
    </class-decl>
    <reference-type-def kind='lvalue' type-id='91e0a3ba' size-in-bits='32' id='444a4d53'/>
    <pointer-type-def type-id='d664a6f7' size-in-bits='32' id='44bea17b'/>
    <reference-type-def kind='rvalue' type-id='1e5a3259' size-in-bits='32' id='45210ed9'/>
    <reference-type-def kind='lvalue' type-id='5c6f52e4' size-in-bits='32' id='453f4766'/>
    <pointer-type-def type-id='2aea98eb' size-in-bits='32' id='456a21db'/>
    <qualified-type-def type-id='86ba64c1' const='yes' id='4597d0f1'/>
    <reference-type-def kind='lvalue' type-id='9def79e8' size-in-bits='32' id='459dcdc3'/>
    <pointer-type-def type-id='d2367b70' size-in-bits='32' id='45c42eae'/>
    <pointer-type-def type-id='5572c375' size-in-bits='32' id='45fa91ba'/>
    <pointer-type-def type-id='2b209300' size-in-bits='32' id='461c5f2a'/>
    <function-type size-in-bits='32' id='461d0e9f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <qualified-type-def type-id='fcb5722c' const='yes' id='4629d4dc'/>
    <pointer-type-def type-id='682cd0e9' size-in-bits='32' id='4645c6d1'/>
    <function-type size-in-bits='32' id='467aaa2c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='0f3165aa' size-in-bits='32' id='4685832c'/>
    <function-type size-in-bits='32' id='470aec15'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='884af3d2'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='7c16c677' const='yes' id='47259324'/>
    <qualified-type-def type-id='6e0a00e4' const='yes' id='472db454'/>
    <pointer-type-def type-id='13956559' size-in-bits='32' id='472eb409'/>
    <qualified-type-def type-id='3a2a87e3' const='yes' id='47351492'/>
    <pointer-type-def type-id='a017e9d1' size-in-bits='32' id='47653e05'/>
    <qualified-type-def type-id='7792dc45' const='yes' id='476e10bc'/>
    <pointer-type-def type-id='49617147' size-in-bits='32' id='476f48bb'/>
    <function-type size-in-bits='32' id='47891898'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='baffb083' size-in-bits='32' id='478e3663'/>
    <pointer-type-def type-id='148c6738' size-in-bits='32' id='478facc2'/>
    <reference-type-def kind='lvalue' type-id='5410e8d7' size-in-bits='32' id='479eb363'/>
    <qualified-type-def type-id='7d85bcce' const='yes' id='47ae819e'/>
    <qualified-type-def type-id='6b4a65cd' const='yes' id='47b457b2'/>
    <pointer-type-def type-id='a4a61472' size-in-bits='32' id='47bc557c'/>
    <pointer-type-def type-id='b39df991' size-in-bits='32' id='4859dce9'/>
    <qualified-type-def type-id='31fb592e' const='yes' id='486d7da1'/>
    <function-type size-in-bits='32' id='4890b95b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='41c7e19d' size-in-bits='32' id='48a85961'/>
    <type-decl name='void' id='48b5725f'/>
    <reference-type-def kind='lvalue' type-id='074a2fe9' size-in-bits='32' id='48c942dd'/>
    <pointer-type-def type-id='5b6ea680' size-in-bits='32' id='4945fd86'/>
    <function-type size-in-bits='32' id='49617147'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='483b2fbb' size-in-bits='32' id='4974c4db'/>
    <pointer-type-def type-id='e703acb5' size-in-bits='32' id='49c8be4d'/>
    <reference-type-def kind='lvalue' type-id='f79d815b' size-in-bits='32' id='49f2d7c7'/>
    <pointer-type-def type-id='0149d965' size-in-bits='32' id='4a0b9bf1'/>
    <pointer-type-def type-id='06ee45bd' size-in-bits='32' id='4a20e47d'/>
    <qualified-type-def type-id='46e02796' const='yes' id='4a362c1f'/>
    <pointer-type-def type-id='4e0bfe8e' size-in-bits='32' id='4a392734'/>
    <function-type size-in-bits='32' id='4a42a622'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='5fd79c4c' size-in-bits='32' id='4a6b3ade'/>
    <pointer-type-def type-id='0f3165aa' size-in-bits='32' id='4a858978'/>
    <reference-type-def kind='rvalue' type-id='abb85f22' size-in-bits='32' id='4aa2bb96'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='32' id='4aafb922'/>
    <qualified-type-def type-id='c894953d' const='yes' id='4ab96a04'/>
    <function-type size-in-bits='32' id='4aec61f6'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='06074860' size-in-bits='32' id='4b15419a'/>
    <qualified-type-def type-id='5e0b7a1d' const='yes' id='4b24591e'/>
    <reference-type-def kind='lvalue' type-id='db942487' size-in-bits='32' id='4b35a973'/>
    <function-type size-in-bits='32' id='4b5c8855'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='5b7c7bab'/>
    </function-type>
    <typedef-decl name='weakref_type' type-id='114d3ce2' id='4b9d3492'/>
    <reference-type-def kind='lvalue' type-id='c16f8eef' size-in-bits='32' id='4b9dc66b'/>
    <function-type size-in-bits='32' id='4bcddb36'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='78c897a1' size-in-bits='32' id='4bd35839'/>
    <qualified-type-def type-id='3623438e' const='yes' id='4bd3d2f5'/>
    <function-type size-in-bits='32' id='4bd440f5'>
      <parameter type-id='fae49a1f'/>
      <return type-id='5b89f496'/>
    </function-type>
    <qualified-type-def type-id='e44fdfb2' const='yes' id='4c0de1d1'/>
    <reference-type-def kind='lvalue' type-id='b16ea9dd' size-in-bits='32' id='4c359621'/>
    <pointer-type-def type-id='79c6b8a9' size-in-bits='32' id='4c6a1d41'/>
    <reference-type-def kind='lvalue' type-id='745bbe06' size-in-bits='32' id='4c6c4c60'/>
    <typedef-decl name='ACaptureSessionOutputContainer' type-id='b7bcdd66' id='4c967707'/>
    <pointer-type-def type-id='cb0b6e10' size-in-bits='32' id='4cb51eb6'/>
    <class-decl name='ANativeWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d637dbf'/>
    <pointer-type-def type-id='e82ccd38' size-in-bits='32' id='4d84e5de'/>
    <reference-type-def kind='lvalue' type-id='199c7084' size-in-bits='32' id='4d99985d'/>
    <function-type size-in-bits='32' id='4dd30b7b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='4e053e6d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='1a7fe6b0'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='camera_status_t' type-id='89c27d39' id='4e73a1ad'/>
    <function-type size-in-bits='32' id='4e7eaf04'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='1dba3069' size-in-bits='32' id='4ed90115'/>
    <qualified-type-def type-id='735576a1' const='yes' id='4f4a9440'/>
    <reference-type-def kind='lvalue' type-id='00d599cc' size-in-bits='32' id='4f617136'/>
    <pointer-type-def type-id='6878e9a8' size-in-bits='32' id='4f68d4b2'/>
    <pointer-type-def type-id='ae2834f4' size-in-bits='32' id='4f7677f6'/>
    <enum-decl name='jobjectRefType' id='4f771c8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='JNIInvalidRefType' value='0'/>
      <enumerator name='JNILocalRefType' value='1'/>
      <enumerator name='JNIGlobalRefType' value='2'/>
      <enumerator name='JNIWeakGlobalRefType' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='e8f54abb' size-in-bits='32' id='500eebf7'/>
    <pointer-type-def type-id='0b1c0fcb' size-in-bits='32' id='504420eb'/>
    <pointer-type-def type-id='f07b7694' size-in-bits='32' id='505bed1a'/>
    <pointer-type-def type-id='ea778602' size-in-bits='32' id='50760a00'/>
    <pointer-type-def type-id='8cdb81b9' size-in-bits='32' id='508cfa69'/>
    <reference-type-def kind='lvalue' type-id='60b6ab37' size-in-bits='32' id='508f4bc3'/>
    <reference-type-def kind='rvalue' type-id='31fb592e' size-in-bits='32' id='5095901a'/>
    <pointer-type-def type-id='d4db09c0' size-in-bits='32' id='50b94ba6'/>
    <typedef-decl name='ACameraMetadata_rational' type-id='10ee5a45' id='50c4778c'/>
    <function-type size-in-bits='32' id='50ce2e7b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='17ed04c8'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <qualified-type-def type-id='d1235548' const='yes' id='50cffff8'/>
    <reference-type-def kind='lvalue' type-id='4cb51eb6' size-in-bits='32' id='511f1cb0'/>
    <qualified-type-def type-id='dd0baacf' const='yes' id='51468fff'/>
    <qualified-type-def type-id='cd97f128' const='yes' id='51ab4043'/>
    <reference-type-def kind='rvalue' type-id='2638336c' size-in-bits='32' id='5232db80'/>
    <pointer-type-def type-id='994bb87b' size-in-bits='32' id='5234b17b'/>
    <pointer-type-def type-id='b284e6e2' size-in-bits='32' id='52901a60'/>
    <class-decl name='_jdoubleArray' visibility='default' is-declaration-only='yes' id='530c1a32'/>
    <function-type size-in-bits='32' id='533df676'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='da4ac88c' size-in-bits='32' id='5353c67e'/>
    <function-type size-in-bits='32' id='5368e5fc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='7f83e8c4'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='7321a4c8' const='yes' id='5410e8d7'/>
    <pointer-type-def type-id='71f8677c' size-in-bits='32' id='541c80aa'/>
    <pointer-type-def type-id='c727f5b3' size-in-bits='32' id='542f42a3'/>
    <function-type size-in-bits='32' id='5432adc5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6c9a8402'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='37d9218c' size-in-bits='32' id='5456509a'/>
    <reference-type-def kind='lvalue' type-id='b39df991' size-in-bits='32' id='5459efcd'/>
    <reference-type-def kind='lvalue' type-id='1c02351b' size-in-bits='32' id='5479cf07'/>
    <qualified-type-def type-id='82f40932' const='yes' id='54912122'/>
    <reference-type-def kind='lvalue' type-id='168d64f2' size-in-bits='32' id='5495b9bc'/>
    <reference-type-def kind='lvalue' type-id='90c6c04a' size-in-bits='32' id='54e0ea04'/>
    <qualified-type-def type-id='74d49702' const='yes' id='551128d3'/>
    <function-type size-in-bits='32' id='554d87f1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <typedef-decl name='ACameraCaptureSession_captureCallbacks' type-id='ab6760dc' id='5572c375'/>
    <function-type size-in-bits='32' id='558a0aa4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='152bf3a9'/>
    </function-type>
    <pointer-type-def type-id='953503e1' size-in-bits='32' id='55a77b99'/>
    <reference-type-def kind='lvalue' type-id='1428aabc' size-in-bits='32' id='5604906e'/>
    <reference-type-def kind='rvalue' type-id='d5c4ab4c' size-in-bits='32' id='5625b130'/>
    <class-decl name='ACameraManager_AvailabilityListener' size-in-bits='96' is-struct='yes' visibility='default' id='5646a760'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onCameraAvailable' type-id='fbf2ccf4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='onCameraUnavailable' type-id='fbf2ccf4' visibility='default'/>
      </data-member>
    </class-decl>
    <reference-type-def kind='lvalue' type-id='64bb19e2' size-in-bits='32' id='56898f8c'/>
    <function-type size-in-bits='32' id='56c055db'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <qualified-type-def type-id='019093f3' const='yes' id='56cc4c7c'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='56f71ed3' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default'/>
      </data-member>
    </class-decl>
    <reference-type-def kind='lvalue' type-id='bcd6c637' size-in-bits='32' id='5719ccc3'/>
    <reference-type-def kind='lvalue' type-id='20f5f452' size-in-bits='32' id='572fd29c'/>
    <reference-type-def kind='lvalue' type-id='8180ab5c' size-in-bits='32' id='578df10e'/>
    <qualified-type-def type-id='99f546a8' const='yes' id='579090e1'/>
    <pointer-type-def type-id='59ed1e59' size-in-bits='32' id='5796afad'/>
    <function-type size-in-bits='32' id='57aaeac5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='ad3ebb8d' size-in-bits='32' id='57c94099'/>
    <function-type size-in-bits='32' id='57d663c4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0944aa01'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='1c507e8b' size-in-bits='32' id='5817af7b'/>
    <pointer-type-def type-id='67748225' size-in-bits='32' id='582ba311'/>
    <pointer-type-def type-id='f341e414' size-in-bits='32' id='58398eee'/>
    <reference-type-def kind='lvalue' type-id='71ed2026' size-in-bits='32' id='58496000'/>
    <qualified-type-def type-id='4d159548' const='yes' id='584de2ab'/>
    <pointer-type-def type-id='f56bc8f9' size-in-bits='32' id='586b6581'/>
    <pointer-type-def type-id='d33b8a5d' size-in-bits='32' id='5885850d'/>
    <function-type size-in-bits='32' id='588dec50'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='cb0b6e10' size-in-bits='32' id='58b5319a'/>
    <qualified-type-def type-id='0df7597f' const='yes' id='58e546d2'/>
    <reference-type-def kind='lvalue' type-id='0979f248' size-in-bits='32' id='58f8a32a'/>
    <qualified-type-def type-id='143a6b6e' const='yes' id='5919835e'/>
    <function-type size-in-bits='32' id='59330a47'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='973e3c3f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='06ee45bd' const='yes' id='5991d1d2'/>
    <function-type size-in-bits='32' id='59b5ee8a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='aad38483' const='yes' id='59c9a1fa'/>
    <function-type size-in-bits='32' id='59da7e0d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='0411e2cc' size-in-bits='32' id='59e7b6c6'/>
    <function-type size-in-bits='32' id='59ed1e59'>
      <parameter type-id='fae49a1f'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='18165859' size-in-bits='32' id='5a2911f9'/>
    <pointer-type-def type-id='50ce2e7b' size-in-bits='32' id='5a4c25bf'/>
    <pointer-type-def type-id='406f4753' size-in-bits='32' id='5a5e1f63'/>
    <pointer-type-def type-id='21c31e25' size-in-bits='32' id='5a7968c5'/>
    <reference-type-def kind='lvalue' type-id='bde7be41' size-in-bits='32' id='5ad0bc25'/>
    <function-type size-in-bits='32' id='5ad5f77b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <typedef-decl name='ACameraCaptureSession_captureCallback_sequenceAbort' type-id='668fd911' id='5b12dd86'/>
    <pointer-type-def type-id='20f5f452' size-in-bits='32' id='5b2fd8e8'/>
    <typedef-decl name='ACameraCaptureSession_stateCallback' type-id='7a0e522a' id='5b4cb29f'/>
    <pointer-type-def type-id='00d599cc' size-in-bits='32' id='5b61841a'/>
    <typedef-decl name='jstring' type-id='e65fd0e5' id='5b7c7bab'/>
    <typedef-decl name='jthrowable' type-id='a5fd6882' id='5b89f496'/>
    <reference-type-def kind='rvalue' type-id='42d681db' size-in-bits='32' id='5bd130eb'/>
    <pointer-type-def type-id='f5098ab4' size-in-bits='32' id='5c0536ba'/>
    <qualified-type-def type-id='bd86d803' const='yes' id='5c14e06a'/>
    <typedef-decl name='ALogicalCameraCaptureFailure' type-id='2865b1a8' id='5c3c7795'/>
    <pointer-type-def type-id='11310303' size-in-bits='32' id='5c6506f3'/>
    <class-decl name='ACameraDevice' size-in-bits='32' is-struct='yes' visibility='default' id='5c6f4069'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mDevice' type-id='37981ab7' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACameraDevice' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='0944aa01' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='987fd631'/>
          <parameter type-id='3ae07df8'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~ACameraDevice' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='0944aa01' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='657494f4' const='yes' id='5c6f52e4'/>
    <reference-type-def kind='lvalue' type-id='ea778602' size-in-bits='32' id='5c761ce4'/>
    <reference-type-def kind='lvalue' type-id='0e5e8ffd' size-in-bits='32' id='5c7c075a'/>
    <reference-type-def kind='lvalue' type-id='8cdb81b9' size-in-bits='32' id='5c8d0d4d'/>
    <reference-type-def kind='rvalue' type-id='08f7445f' size-in-bits='32' id='5cb5a2df'/>
    <function-type size-in-bits='32' id='5ce9ffdf'>
      <parameter type-id='5b2fd8e8'/>
      <parameter type-id='5b2fd8e8'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='f23f6a00' size-in-bits='32' id='5cf7bd96'/>
    <reference-type-def kind='lvalue' type-id='bfb3c4b3' size-in-bits='32' id='5cfe768f'/>
    <pointer-type-def type-id='9ac97b60' size-in-bits='32' id='5d123fd6'/>
    <pointer-type-def type-id='f634fb6b' size-in-bits='32' id='5d2f916b'/>
    <pointer-type-def type-id='e3042e3b' size-in-bits='32' id='5d3f91fb'/>
    <function-type size-in-bits='32' id='5d4b6f06'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <return type-id='2c2f1adb'/>
    </function-type>
    <function-type size-in-bits='32' id='5d529e9d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='ad5227a3' size-in-bits='32' id='5d54365f'/>
    <qualified-type-def type-id='07af2665' const='yes' id='5d60e735'/>
    <qualified-type-def type-id='9523e199' const='yes' id='5d6edba8'/>
    <pointer-type-def type-id='fea2690f' size-in-bits='32' id='5d99509b'/>
    <pointer-type-def type-id='5ad5f77b' size-in-bits='32' id='5da2c37f'/>
    <array-type-def dimensions='1' type-id='0ad725ff' size-in-bits='96' id='5da85797'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <pointer-type-def type-id='e3e7515c' size-in-bits='32' id='5db5877e'/>
    <reference-type-def kind='lvalue' type-id='02746ca7' size-in-bits='32' id='5e46cf13'/>
    <qualified-type-def type-id='2199750a' const='yes' id='5e4f1927'/>
    <reference-type-def kind='lvalue' type-id='1c2cb422' size-in-bits='32' id='5e5f624c'/>
    <function-type size-in-bits='32' id='5e933196'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='1f6df83a' size-in-bits='32' id='5eb88ee8'/>
    <pointer-type-def type-id='b6e5053d' size-in-bits='32' id='5ee69201'/>
    <qualified-type-def type-id='e4e736f0' const='yes' id='5f434503'/>
    <reference-type-def kind='lvalue' type-id='78c34362' size-in-bits='32' id='5f62e40c'/>
    <pointer-type-def type-id='4890b95b' size-in-bits='32' id='5f929ab7'/>
    <qualified-type-def type-id='cc6e09ca' const='yes' id='5fa8a65a'/>
    <pointer-type-def type-id='82ca2bbd' size-in-bits='32' id='5fbd0cbd'/>
    <qualified-type-def type-id='1da2675c' const='yes' id='5fd79c4c'/>
    <function-type size-in-bits='32' id='5fde1a5b'>
      <parameter type-id='5b2fd8e8'/>
      <parameter type-id='5b2fd8e8'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='5fea4ff8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='aa210e95'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='d47c1022' size-in-bits='32' id='601f438c'/>
    <function-type size-in-bits='32' id='6024e9ed'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='8c344f84' size-in-bits='32' id='60306f66'/>
    <pointer-type-def type-id='f7f99c02' size-in-bits='32' id='6039a2e0'/>
    <class-decl name='ACaptureSessionOutput' size-in-bits='288' is-struct='yes' visibility='default' id='60514a0b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mWindow' type-id='2d8486a3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mSharedWindows' type-id='a419a827' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mIsShared' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mRotation' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mPhysicalCameraId' type-id='2e84cb7b' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACaptureSessionOutput' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='c2e7c99b' is-artificial='yes'/>
          <parameter type-id='2d8486a3'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='f8435afc' const='yes' id='605189b3'/>
    <class-decl name='ACameraCaptureSession_logicalCamera_captureCallbacks' size-in-bits='256' is-struct='yes' visibility='default' id='60728019'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onCaptureStarted' type-id='1280ba53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='onCaptureProgressed' type-id='e5263ed0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='onLogicalCameraCaptureCompleted' type-id='c9e023e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='onLogicalCameraCaptureFailed' type-id='9715c851' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='onCaptureSequenceCompleted' type-id='9a359a61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='onCaptureSequenceAborted' type-id='5b12dd86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='onCaptureBufferLost' type-id='f2bba1dd' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='a2a0fc4c' const='yes' id='6078709c'/>
    <qualified-type-def type-id='f1d02bab' const='yes' id='60a78cdb'/>
    <qualified-type-def type-id='1acffe87' const='yes' id='60b6ab37'/>
    <reference-type-def kind='lvalue' type-id='42bf2268' size-in-bits='32' id='60e300ca'/>
    <function-type size-in-bits='32' id='60e6a162'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='7f83e8c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='0abdfb52' size-in-bits='32' id='6112dde8'/>
    <reference-type-def kind='lvalue' type-id='2448a865' size-in-bits='32' id='6160e179'/>
    <pointer-type-def type-id='fee63a6d' size-in-bits='32' id='6192a12d'/>
    <pointer-type-def type-id='331ea4b6' size-in-bits='32' id='61bdc68c'/>
    <reference-type-def kind='lvalue' type-id='9c45b746' size-in-bits='32' id='61bfac20'/>
    <pointer-type-def type-id='efa46d99' size-in-bits='32' id='61d681d5'/>
    <typedef-decl name='jbyteArray' type-id='047d4fff' id='61dc2b35'/>
    <reference-type-def kind='lvalue' type-id='c8f2ae2a' size-in-bits='32' id='6207fce4'/>
    <function-type size-in-bits='32' id='625a21da'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='973e3c3f' size-in-bits='32' id='6292c81e'/>
    <pointer-type-def type-id='c5c8084e' size-in-bits='32' id='629961b8'/>
    <reference-type-def kind='lvalue' type-id='f8193ff5' size-in-bits='32' id='62bf7929'/>
    <pointer-type-def type-id='86910635' size-in-bits='32' id='62d9dee9'/>
    <reference-type-def kind='lvalue' type-id='65ff4bf4' size-in-bits='32' id='62e45b96'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <function-type size-in-bits='32' id='62f4575f'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='6f4c521b'/>
      <parameter type-id='96ca2a2e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='pthread_cond_t' type-id='56f71ed3' id='62fab762'/>
    <qualified-type-def type-id='de49cf79' const='yes' id='6316fd14'/>
    <qualified-type-def type-id='b6ee2fc0' const='yes' id='639a6c10'/>
    <qualified-type-def type-id='61c0f62a' const='yes' id='639eaa9a'/>
    <pointer-type-def type-id='d4063a8f' size-in-bits='32' id='63b034e7'/>
    <reference-type-def kind='rvalue' type-id='0a1605f7' size-in-bits='32' id='63c73cc7'/>
    <pointer-type-def type-id='ad3ebb8d' size-in-bits='32' id='63c9537d'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <pointer-type-def type-id='fb38e8e0' size-in-bits='32' id='63f10dea'/>
    <pointer-type-def type-id='07f91629' size-in-bits='32' id='63f7d65d'/>
    <pointer-type-def type-id='af8c6a20' size-in-bits='32' id='640aedbe'/>
    <qualified-type-def type-id='2638336c' const='yes' id='640e6f0f'/>
    <pointer-type-def type-id='09244f78' size-in-bits='32' id='6413916e'/>
    <reference-type-def kind='rvalue' type-id='03a1b690' size-in-bits='32' id='647d0d64'/>
    <qualified-type-def type-id='6e679e09' const='yes' id='64bb19e2'/>
    <pointer-type-def type-id='4a42a622' size-in-bits='32' id='64ca4b84'/>
    <qualified-type-def type-id='19251663' const='yes' id='64e308f3'/>
    <reference-type-def kind='lvalue' type-id='4597d0f1' size-in-bits='32' id='64fdc275'/>
    <reference-type-def kind='lvalue' type-id='22d1a9b3' size-in-bits='32' id='650df58f'/>
    <qualified-type-def type-id='657bf64a' const='yes' id='654b3b9a'/>
    <typedef-decl name='jarray' type-id='85c463b1' id='65b69bb3'/>
    <reference-type-def kind='rvalue' type-id='0306a627' size-in-bits='32' id='65c6e907'/>
    <qualified-type-def type-id='29e02f04' const='yes' id='65ff4bf4'/>
    <reference-type-def kind='lvalue' type-id='2da719ae' size-in-bits='32' id='660d3118'/>
    <pointer-type-def type-id='c9e564b8' size-in-bits='32' id='661d51d6'/>
    <pointer-type-def type-id='6f4c521b' size-in-bits='32' id='66256323'/>
    <reference-type-def kind='lvalue' type-id='406f4753' size-in-bits='32' id='665e3247'/>
    <pointer-type-def type-id='0df96076' size-in-bits='32' id='666fc788'/>
    <pointer-type-def type-id='9523e199' size-in-bits='32' id='66857951'/>
    <pointer-type-def type-id='6024e9ed' size-in-bits='32' id='668fd911'/>
    <function-type size-in-bits='32' id='66c316f9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='4bcddb36' size-in-bits='32' id='66ebe6b0'/>
    <pointer-type-def type-id='588dec50' size-in-bits='32' id='67514b72'/>
    <reference-type-def kind='lvalue' type-id='eeb7d5ba' size-in-bits='32' id='67654494'/>
    <reference-type-def kind='rvalue' type-id='807abec7' size-in-bits='32' id='677383f7'/>
    <function-type size-in-bits='32' id='67748225'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='b396e89b' size-in-bits='32' id='67904ea3'/>
    <pointer-type-def type-id='47891898' size-in-bits='32' id='67a46ff2'/>
    <reference-type-def kind='lvalue' type-id='8da47f48' size-in-bits='32' id='67f49a2a'/>
    <pointer-type-def type-id='7940fa8d' size-in-bits='32' id='686fa20d'/>
    <function-type size-in-bits='32' id='6878e9a8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='7f83e8c4'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='140c2675' size-in-bits='32' id='687ee105'/>
    <pointer-type-def type-id='4b5c8855' size-in-bits='32' id='691ba251'/>
    <pointer-type-def type-id='b6d76995' size-in-bits='32' id='692552f9'/>
    <function-type size-in-bits='32' id='6935722a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <qualified-type-def type-id='cb386317' const='yes' id='69496ea7'/>
    <pointer-type-def type-id='cd97f128' size-in-bits='32' id='6952c79e'/>
    <reference-type-def kind='lvalue' type-id='e7a6e843' size-in-bits='32' id='69b1203e'/>
    <pointer-type-def type-id='cd5e6e48' size-in-bits='32' id='69b7386a'/>
    <pointer-type-def type-id='c17f92e4' size-in-bits='32' id='69d41a4a'/>
    <qualified-type-def type-id='a098fd0c' const='yes' id='69d84107'/>
    <reference-type-def kind='rvalue' type-id='4e0bfe8e' size-in-bits='32' id='69db35c2'/>
    <qualified-type-def type-id='23f80699' const='yes' id='69f91e90'/>
    <pointer-type-def type-id='02746ca7' size-in-bits='32' id='6a46e1f7'/>
    <qualified-type-def type-id='f14cc06d' const='yes' id='6a57413d'/>
    <pointer-type-def type-id='37263ccf' size-in-bits='32' id='6a81a397'/>
    <qualified-type-def type-id='ea6782df' const='yes' id='6aa51dda'/>
    <function-type size-in-bits='32' id='6ab04463'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2d5e6f72'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='43c1388c' size-in-bits='32' id='6ab580ba'/>
    <pointer-type-def type-id='e5dbe592' size-in-bits='32' id='6ad98110'/>
    <reference-type-def kind='rvalue' type-id='603f72de' size-in-bits='32' id='6b0d6512'/>
    <pointer-type-def type-id='c58e4e3d' size-in-bits='32' id='6b3f28dd'/>
    <function-type size-in-bits='32' id='6b5c9008'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='d4a328b7'/>
    </function-type>
    <function-type size-in-bits='32' id='6b6501bd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='41d0c067' size-in-bits='32' id='6b6e291f'/>
    <pointer-type-def type-id='2214e443' size-in-bits='32' id='6b7be7d3'/>
    <reference-type-def kind='rvalue' type-id='6e84a657' size-in-bits='32' id='6b858f87'/>
    <function-type size-in-bits='32' id='6bb2df61'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='067e0250'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='70118403' size-in-bits='32' id='6bda8ce3'/>
    <pointer-type-def type-id='e798ce7f' size-in-bits='32' id='6c0650e7'/>
    <qualified-type-def type-id='807abec7' const='yes' id='6c110ee4'/>
    <pointer-type-def type-id='81719d6d' size-in-bits='32' id='6c160b51'/>
    <reference-type-def kind='lvalue' type-id='f7f99c02' size-in-bits='32' id='6c39b5c4'/>
    <function-type size-in-bits='32' id='6c431008'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='66c316f9' size-in-bits='32' id='6c56e815'/>
    <typedef-decl name='jweak' type-id='478e3663' id='6c9a8402'/>
    <pointer-type-def type-id='6b4a65cd' size-in-bits='32' id='6cdac9fd'/>
    <typedef-decl name='ACameraCaptureSession_logicalCamera_captureCallbacks' type-id='60728019' id='6d4002a8'/>
    <reference-type-def kind='rvalue' type-id='b7323b50' size-in-bits='32' id='6d430377'/>
    <function-type size-in-bits='32' id='6d519b6e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='aa210e95'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='b2300bca' size-in-bits='32' id='6da2c484'/>
    <function-type size-in-bits='32' id='6da5b67e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='8b4f04b0' size-in-bits='32' id='6dd0c774'/>
    <reference-type-def kind='lvalue' type-id='4629d4dc' size-in-bits='32' id='6dda458e'/>
    <pointer-type-def type-id='a0a3c555' size-in-bits='32' id='6dece8e5'/>
    <pointer-type-def type-id='a22e6735' size-in-bits='32' id='6e0c55cd'/>
    <reference-type-def kind='lvalue' type-id='bc8fd08c' size-in-bits='32' id='6e29e006'/>
    <function-type size-in-bits='32' id='6e3cf71b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='8dfe2e06'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6e835a19'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jfloatArray' type-id='dda33667' id='6e9854cd'/>
    <pointer-type-def type-id='f8193ff5' size-in-bits='32' id='6ebf8c0d'/>
    <function-type size-in-bits='32' id='6f160e3a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='6292c81e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='2186eb60' size-in-bits='32' id='6f4c521b'/>
    <reference-type-def kind='lvalue' type-id='8de1b933' size-in-bits='32' id='6f565c0f'/>
    <qualified-type-def type-id='53f0a593' const='yes' id='6f5fb9c3'/>
    <qualified-type-def type-id='991ecdf5' const='yes' id='6f9ee57c'/>
    <pointer-type-def type-id='7f57b6c0' size-in-bits='32' id='6fc0eca2'/>
    <reference-type-def kind='rvalue' type-id='37d9218c' size-in-bits='32' id='6fc2e9b0'/>
    <reference-type-def kind='lvalue' type-id='b96bb15f' size-in-bits='32' id='7016b393'/>
    <pointer-type-def type-id='ea3e1072' size-in-bits='32' id='7052ab20'/>
    <qualified-type-def type-id='808000be' const='yes' id='7062dc99'/>
    <function-type size-in-bits='32' id='70b02f6f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jclass' type-id='a5a1fc5a' id='70de5c42'/>
    <qualified-type-def type-id='8ccfa95d' const='yes' id='7116dd52'/>
    <pointer-type-def type-id='8a8cd6aa' size-in-bits='32' id='71346a88'/>
    <pointer-type-def type-id='6c431008' size-in-bits='32' id='7139225a'/>
    <reference-type-def kind='lvalue' type-id='80f4b756' size-in-bits='32' id='713cc550'/>
    <pointer-type-def type-id='2ca86b0d' size-in-bits='32' id='715a5bad'/>
    <pointer-type-def type-id='019093f3' size-in-bits='32' id='715a9133'/>
    <function-type size-in-bits='32' id='717ad472'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='088b642f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='a0a3c555' size-in-bits='32' id='71ecef31'/>
    <qualified-type-def type-id='e4318eab' const='yes' id='71ed2026'/>
    <reference-type-def kind='lvalue' type-id='b6ee2fc0' size-in-bits='32' id='72063e63'/>
    <reference-type-def kind='lvalue' type-id='c9e564b8' size-in-bits='32' id='721d64ba'/>
    <qualified-type-def type-id='f3515648' const='yes' id='72532fc9'/>
    <typedef-decl name='ACameraDevice_ErrorStateCallback' type-id='157d76dd' id='728c8613'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='32' id='7292109c'/>
    <qualified-type-def type-id='0306a627' const='yes' id='72b1f7a0'/>
    <reference-type-def kind='lvalue' type-id='a8e48eb5' size-in-bits='32' id='72cc7169'/>
    <qualified-type-def type-id='de2c4ae3' const='yes' id='72f3b233'/>
    <pointer-type-def type-id='625a21da' size-in-bits='32' id='72f7c194'/>
    <qualified-type-def type-id='4222078d' const='yes' id='72fefe1d'/>
    <pointer-type-def type-id='bae33ff3' size-in-bits='32' id='735645b3'/>
    <reference-type-def kind='rvalue' type-id='808000be' size-in-bits='32' id='735889e2'/>
    <pointer-type-def type-id='5ce9ffdf' size-in-bits='32' id='7379601b'/>
    <pointer-type-def type-id='4478a14f' size-in-bits='32' id='73819597'/>
    <reference-type-def kind='lvalue' type-id='b396e89b' size-in-bits='32' id='73906187'/>
    <typedef-decl name='ANativeWindow' type-id='4d637dbf' id='739fb858'/>
    <reference-type-def kind='lvalue' type-id='f3515648' size-in-bits='32' id='73cced02'/>
    <qualified-type-def type-id='a6c45d85' const='yes' id='73f3791e'/>
    <qualified-type-def type-id='dfd28794' const='yes' id='743de5df'/>
    <qualified-type-def type-id='52fb1fd3' const='yes' id='744d9a23'/>
    <qualified-type-def type-id='b73b48d6' const='yes' id='745bbe06'/>
    <qualified-type-def type-id='bacf3393' const='yes' id='745c9152'/>
    <pointer-type-def type-id='2c8ecc6a' size-in-bits='32' id='747a49e4'/>
    <pointer-type-def type-id='0ccd5902' size-in-bits='32' id='74823d0c'/>
    <pointer-type-def type-id='36b6d9fa' size-in-bits='32' id='748d0b58'/>
    <pointer-type-def type-id='fb5fd12b' size-in-bits='32' id='74a8503b'/>
    <reference-type-def kind='rvalue' type-id='3f1fbea7' size-in-bits='32' id='74bdde37'/>
    <reference-type-def kind='lvalue' type-id='ef24955b' size-in-bits='32' id='74ccc49a'/>
    <reference-type-def kind='lvalue' type-id='47b457b2' size-in-bits='32' id='74e5ddfc'/>
    <qualified-type-def type-id='cb0b6e10' const='yes' id='74f1a4a5'/>
    <reference-type-def kind='lvalue' type-id='de55bd52' size-in-bits='32' id='74f93d9c'/>
    <qualified-type-def type-id='c407b125' const='yes' id='74fa90d5'/>
    <pointer-type-def type-id='8b4f04b0' size-in-bits='32' id='75138036'/>
    <qualified-type-def type-id='d592c84e' const='yes' id='7525625e'/>
    <pointer-type-def type-id='d040f4c1' size-in-bits='32' id='7573afb9'/>
    <function-type size-in-bits='32' id='757515fe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='3a2a87e3' size-in-bits='32' id='758c5523'/>
    <pointer-type-def type-id='8ccfa95d' size-in-bits='32' id='75b3d14d'/>
    <qualified-type-def type-id='de28910c' const='yes' id='75c1fb1c'/>
    <reference-type-def kind='rvalue' type-id='95e97e5e' size-in-bits='32' id='75f9e64a'/>
    <pointer-type-def type-id='4b9d3492' size-in-bits='32' id='7613b793'/>
    <pointer-type-def type-id='6e679e09' size-in-bits='32' id='76248711'/>
    <pointer-type-def type-id='1d639c93' size-in-bits='32' id='764ac7bf'/>
    <reference-type-def kind='lvalue' type-id='95e97e5e' size-in-bits='32' id='769216e8'/>
    <qualified-type-def type-id='50c4778c' const='yes' id='76a49d1c'/>
    <pointer-type-def type-id='530c1a32' size-in-bits='32' id='76b5a6a0'/>
    <typedef-decl name='ACameraCaptureFailure' type-id='c2f20afb' id='76cc2f98'/>
    <reference-type-def kind='lvalue' type-id='e5dbe592' size-in-bits='32' id='76d993f4'/>
    <pointer-type-def type-id='21fee85f' size-in-bits='32' id='771014ab'/>
    <reference-type-def kind='lvalue' type-id='f3440ea5' size-in-bits='32' id='7722d839'/>
    <reference-type-def kind='lvalue' type-id='dfdbe536' size-in-bits='32' id='77299830'/>
    <reference-type-def kind='lvalue' type-id='14f61f5e' size-in-bits='32' id='777389e8'/>
    <reference-type-def kind='lvalue' type-id='2214e443' size-in-bits='32' id='777bfab7'/>
    <reference-type-def kind='lvalue' type-id='5e4f1927' size-in-bits='32' id='77845c93'/>
    <reference-type-def kind='lvalue' type-id='cce517cd' size-in-bits='32' id='77a4a6f1'/>
    <pointer-type-def type-id='f3515648' size-in-bits='32' id='77ccf34e'/>
    <typedef-decl name='ACameraDevice_request_template' type-id='864355ef' id='77d413bb'/>
    <qualified-type-def type-id='8b4f04b0' const='yes' id='77e49a55'/>
    <qualified-type-def type-id='37981ab7' const='yes' id='77ef0602'/>
    <pointer-type-def type-id='bbab09bf' size-in-bits='32' id='77f8e4d3'/>
    <pointer-type-def type-id='3b720171' size-in-bits='32' id='782c53f5'/>
    <function-type size-in-bits='32' id='784a10a1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='f1fca3c4' const='yes' id='785771ed'/>
    <pointer-type-def type-id='a981db8b' size-in-bits='32' id='786cbe73'/>
    <reference-type-def kind='rvalue' type-id='b8d27941' size-in-bits='32' id='7882d111'/>
    <pointer-type-def type-id='cca659a2' size-in-bits='32' id='78bbf770'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='32' id='78c01427'/>
    <qualified-type-def type-id='f9e4b3e7' const='yes' id='78c34362'/>
    <pointer-type-def type-id='37ff4804' size-in-bits='32' id='78d1d352'/>
    <function-type size-in-bits='32' id='792136c4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='6292c81e'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='d88c39bb' size-in-bits='32' id='7924ff4b'/>
    <pointer-type-def type-id='3b888c88' size-in-bits='32' id='7996139e'/>
    <reference-type-def kind='lvalue' type-id='8ee001a9' size-in-bits='32' id='79a2741d'/>
    <reference-type-def kind='lvalue' type-id='8d01d01b' size-in-bits='32' id='79d78b9f'/>
    <reference-type-def kind='lvalue' type-id='f401d47d' size-in-bits='32' id='79e14b41'/>
    <pointer-type-def type-id='085a09e0' size-in-bits='32' id='7a0e522a'/>
    <reference-type-def kind='lvalue' type-id='76dd389d' size-in-bits='32' id='7a54800a'/>
    <typedef-decl name='pthread_mutex_t' type-id='92fa54c8' id='7a6844eb'/>
    <function-type size-in-bits='32' id='7a6fe7df'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='38565182'/>
    </function-type>
    <qualified-type-def type-id='7c6c74ea' const='yes' id='7a7f5f41'/>
    <pointer-type-def type-id='21185622' size-in-bits='32' id='7aa62f3d'/>
    <reference-type-def kind='lvalue' type-id='f8435afc' size-in-bits='32' id='7ab13f86'/>
    <pointer-type-def type-id='e6cb9c9e' size-in-bits='32' id='7abe72a4'/>
    <reference-type-def kind='lvalue' type-id='7116dd52' size-in-bits='32' id='7afe9d9c'/>
    <pointer-type-def type-id='519af06b' size-in-bits='32' id='7b142a6b'/>
    <pointer-type-def type-id='630f0eda' size-in-bits='32' id='7b35ce68'/>
    <reference-type-def kind='lvalue' type-id='0070bfec' size-in-bits='32' id='7b7deafe'/>
    <function-type size-in-bits='32' id='7ba71958'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <qualified-type-def type-id='519d1950' const='yes' id='7be66827'/>
    <function-type size-in-bits='32' id='7be75d9e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <pointer-type-def type-id='b96bb15f' size-in-bits='32' id='7c16c677'/>
    <qualified-type-def type-id='c8745fdc' const='yes' id='7c1d680c'/>
    <qualified-type-def type-id='b8d27941' const='yes' id='7c9ba3d4'/>
    <function-type size-in-bits='32' id='7cca9422'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='78c897a1' size-in-bits='32' id='7cd1cde1'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='32' id='7d3cd834'/>
    <reference-type-def kind='lvalue' type-id='019093f3' size-in-bits='32' id='7d5aa417'/>
    <reference-type-def kind='lvalue' type-id='05d3ee77' size-in-bits='32' id='7da02983'/>
    <reference-type-def kind='lvalue' type-id='4da3c689' size-in-bits='32' id='7da10fe5'/>
    <pointer-type-def type-id='078f62bd' size-in-bits='32' id='7db833b5'/>
    <pointer-type-def type-id='ee2227b4' size-in-bits='32' id='7dc45dba'/>
    <class-decl name='ACameraIdList' size-in-bits='64' is-struct='yes' visibility='default' id='7dd51c1a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numCameras' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cameraIds' type-id='7d3cd834' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='8d01d01b' size-in-bits='32' id='7dd791eb'/>
    <reference-type-def kind='lvalue' type-id='3a2c66cc' size-in-bits='32' id='7de6025e'/>
    <function-type size-in-bits='32' id='7de99def'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='3b4676f4'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='5b7c7bab'/>
    </function-type>
    <pointer-type-def type-id='3938035d' size-in-bits='32' id='7def7cfd'/>
    <qualified-type-def type-id='0280fe4d' const='yes' id='7e3c271d'/>
    <qualified-type-def type-id='e2bfa0a2' const='yes' id='7e592d73'/>
    <reference-type-def kind='lvalue' type-id='472db454' size-in-bits='32' id='7ef30f76'/>
    <pointer-type-def type-id='6366ace4' size-in-bits='32' id='7f0233a2'/>
    <pointer-type-def type-id='60e6a162' size-in-bits='32' id='7f0ac28c'/>
    <function-type size-in-bits='32' id='7f57b6c0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='90431a3b' size-in-bits='32' id='7f5dad0b'/>
    <reference-type-def kind='lvalue' type-id='769cfaf0' size-in-bits='32' id='7f794fe1'/>
    <pointer-type-def type-id='0b9c02cb' size-in-bits='32' id='7f83e8c4'/>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' id='7f896fb4'/>
    <function-type size-in-bits='32' id='7f8ca3fe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='0bfe617a' size-in-bits='32' id='7faa5e08'/>
    <pointer-type-def type-id='4bd440f5' size-in-bits='32' id='7fdf58e1'/>
    <reference-type-def kind='lvalue' type-id='978cf3cb' size-in-bits='32' id='7fe3fe17'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <pointer-type-def type-id='f0981eeb' size-in-bits='32' id='807869d3'/>
    <pointer-type-def type-id='7816db5b' size-in-bits='32' id='80d5207b'/>
    <qualified-type-def type-id='782c08bc' const='yes' id='80e9e90d'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <pointer-type-def type-id='fda39aa9' size-in-bits='32' id='8102f025'/>
    <qualified-type-def type-id='c144f585' const='yes' id='810dc035'/>
    <reference-type-def kind='lvalue' type-id='8b4f04b0' size-in-bits='32' id='8113931a'/>
    <function-type size-in-bits='32' id='81719d6d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='127e5d6c' const='yes' id='8180ab5c'/>
    <reference-type-def kind='lvalue' type-id='078f62bd' size-in-bits='32' id='81b83a01'/>
    <reference-type-def kind='rvalue' type-id='bf774091' size-in-bits='32' id='81cf70d1'/>
    <pointer-type-def type-id='a1f9d805' size-in-bits='32' id='82303925'/>
    <reference-type-def kind='lvalue' type-id='4b24591e' size-in-bits='32' id='82387328'/>
    <reference-type-def kind='lvalue' type-id='6a57413d' size-in-bits='32' id='825b7d81'/>
    <pointer-type-def type-id='3580c168' size-in-bits='32' id='8260f5be'/>
    <function-type size-in-bits='32' id='82d29439'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <typedef-decl name='ACameraDevice' type-id='5c6f4069' id='82f40932'/>
    <qualified-type-def type-id='749118ad' const='yes' id='82f4b55d'/>
    <function-type size-in-bits='32' id='83574fe4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='837777dd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='c2e7c99b' size-in-bits='32' id='83e281a3'/>
    <pointer-type-def type-id='eb155bf9' size-in-bits='32' id='83e3eae1'/>
    <pointer-type-def type-id='4cef1d7f' size-in-bits='32' id='83f90177'/>
    <reference-type-def kind='lvalue' type-id='211b0af5' size-in-bits='32' id='84027c3a'/>
    <function-type size-in-bits='32' id='84110544'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='d8263a65'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='d040f4c1' size-in-bits='32' id='843b8c61'/>
    <qualified-type-def type-id='99463423' const='yes' id='84e91272'/>
    <pointer-type-def type-id='789b3273' size-in-bits='32' id='85027b83'/>
    <function-type size-in-bits='32' id='8570b09c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='20704346' size-in-bits='32' id='85bea75c'/>
    <pointer-type-def type-id='440aaf49' size-in-bits='32' id='85c463b1'/>
    <function-type size-in-bits='32' id='85d5402e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='a96a9df5' size-in-bits='32' id='85d67329'/>
    <reference-type-def kind='rvalue' type-id='4478a14f' size-in-bits='32' id='85e0908f'/>
    <reference-type-def kind='lvalue' type-id='ea66eda0' size-in-bits='32' id='8607e9f2'/>
    <reference-type-def kind='lvalue' type-id='062c8fe8' size-in-bits='32' id='8626614a'/>
    <qualified-type-def type-id='38f21f8c' const='yes' id='862784c9'/>
    <enum-decl name='__anonymous_enum__' id='864355ef' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='TEMPLATE_PREVIEW' value='1'/>
      <enumerator name='TEMPLATE_STILL_CAPTURE' value='2'/>
      <enumerator name='TEMPLATE_RECORD' value='3'/>
      <enumerator name='TEMPLATE_VIDEO_SNAPSHOT' value='4'/>
      <enumerator name='TEMPLATE_ZERO_SHUTTER_LAG' value='5'/>
      <enumerator name='TEMPLATE_MANUAL' value='6'/>
    </enum-decl>
    <pointer-type-def type-id='248dded1' size-in-bits='32' id='86560521'/>
    <function-type size-in-bits='32' id='86910635'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='69d41a4a'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='f8435afc' size-in-bits='32' id='86b1526a'/>
    <pointer-type-def type-id='3a2a87e3' size-in-bits='32' id='86e8c533'/>
    <pointer-type-def type-id='c36a3acd' size-in-bits='32' id='873ab9a5'/>
    <reference-type-def kind='rvalue' type-id='8d01d01b' size-in-bits='32' id='8750f43b'/>
    <pointer-type-def type-id='318ccb6c' size-in-bits='32' id='8769ea9a'/>
    <typedef-decl name='ACameraDevice_StateCallback' type-id='b1dfda36' id='87c9e0a3'/>
    <pointer-type-def type-id='de49cf79' size-in-bits='32' id='87cb9261'/>
    <pointer-type-def type-id='02a81098' size-in-bits='32' id='87e0b5ea'/>
    <reference-type-def kind='lvalue' type-id='435025b7' size-in-bits='32' id='882b2343'/>
    <function-type size-in-bits='32' id='8833c461'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <class-decl name='ACaptureRequest' size-in-bits='256' is-struct='yes' visibility='default' id='8834d82b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='settings' type-id='3ae07df8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='physicalSettings' type-id='7c6c74ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='targets' type-id='32901832' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='7c1d680c' size-in-bits='32' id='884af3d2'/>
    <pointer-type-def type-id='b7d01ad5' size-in-bits='32' id='88d99751'/>
    <function-type size-in-bits='32' id='88f16d4f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='69f91e90' size-in-bits='32' id='892b5882'/>
    <reference-type-def kind='lvalue' type-id='b8f5f378' size-in-bits='32' id='892e1cfa'/>
    <qualified-type-def type-id='0ed36368' const='yes' id='89669498'/>
    <qualified-type-def type-id='0b9c02cb' const='yes' id='897a51fb'/>
    <enum-decl name='__anonymous_enum__' id='89c27d39' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ACAMERA_OK' value='0'/>
      <enumerator name='ACAMERA_ERROR_BASE' value='-10000'/>
      <enumerator name='ACAMERA_ERROR_UNKNOWN' value='-10000'/>
      <enumerator name='ACAMERA_ERROR_INVALID_PARAMETER' value='-10001'/>
      <enumerator name='ACAMERA_ERROR_CAMERA_DISCONNECTED' value='-10002'/>
      <enumerator name='ACAMERA_ERROR_NOT_ENOUGH_MEMORY' value='-10003'/>
      <enumerator name='ACAMERA_ERROR_METADATA_NOT_FOUND' value='-10004'/>
      <enumerator name='ACAMERA_ERROR_CAMERA_DEVICE' value='-10005'/>
      <enumerator name='ACAMERA_ERROR_CAMERA_SERVICE' value='-10006'/>
      <enumerator name='ACAMERA_ERROR_SESSION_CLOSED' value='-10007'/>
      <enumerator name='ACAMERA_ERROR_INVALID_OPERATION' value='-10008'/>
      <enumerator name='ACAMERA_ERROR_STREAM_CONFIGURE_FAIL' value='-10009'/>
      <enumerator name='ACAMERA_ERROR_CAMERA_IN_USE' value='-10010'/>
      <enumerator name='ACAMERA_ERROR_MAX_CAMERA_IN_USE' value='-10011'/>
      <enumerator name='ACAMERA_ERROR_CAMERA_DISABLED' value='-10012'/>
      <enumerator name='ACAMERA_ERROR_PERMISSION_DENIED' value='-10013'/>
      <enumerator name='ACAMERA_ERROR_UNSUPPORTED_OPERATION' value='-10014'/>
    </enum-decl>
    <reference-type-def kind='lvalue' type-id='8a2b242e' size-in-bits='32' id='89e9b898'/>
    <qualified-type-def type-id='bf774091' const='yes' id='8a1a5b50'/>
    <pointer-type-def type-id='becc631c' size-in-bits='32' id='8a1f7e9e'/>
    <qualified-type-def type-id='75a8287e' const='yes' id='8a2b242e'/>
    <reference-type-def kind='rvalue' type-id='1f6df83a' size-in-bits='32' id='8a7f3cce'/>
    <qualified-type-def type-id='0b1c0fcb' const='yes' id='8a8005ea'/>
    <pointer-type-def type-id='936a69c9' size-in-bits='32' id='8a922b71'/>
    <qualified-type-def type-id='1afd9f8b' const='yes' id='8af79632'/>
    <reference-type-def kind='lvalue' type-id='2555c0e3' size-in-bits='32' id='8afe761f'/>
    <reference-type-def kind='lvalue' type-id='c36a3acd' size-in-bits='32' id='8b3abff1'/>
    <pointer-type-def type-id='1c8a21a2' size-in-bits='32' id='8b45d6c0'/>
    <pointer-type-def type-id='199fc21a' size-in-bits='32' id='8b55c6d8'/>
    <reference-type-def kind='lvalue' type-id='486d7da1' size-in-bits='32' id='8b5c9b85'/>
    <reference-type-def kind='lvalue' type-id='cb97722a' size-in-bits='32' id='8b6888e4'/>
    <reference-type-def kind='rvalue' type-id='d011aefa' size-in-bits='32' id='8b90a88e'/>
    <pointer-type-def type-id='1eb56b1e' size-in-bits='32' id='8b97c2dc'/>
    <qualified-type-def type-id='973e3c3f' const='yes' id='8bac99cf'/>
    <pointer-type-def type-id='27f93391' size-in-bits='32' id='8bbc8c49'/>
    <qualified-type-def type-id='af50bada' const='yes' id='8bc2cf8a'/>
    <pointer-type-def type-id='03e3ce24' size-in-bits='32' id='8bc971a6'/>
    <array-type-def dimensions='1' type-id='97219ec5' size-in-bits='88' id='8c04a868'>
      <subrange length='11' type-id='7ff19f0f' id='847bc017'/>
    </array-type-def>
    <pointer-type-def type-id='5d529e9d' size-in-bits='32' id='8c22ffe9'/>
    <function-type size-in-bits='32' id='8c344f84'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='413b072a' size-in-bits='32' id='8c4e1254'/>
    <reference-type-def kind='rvalue' type-id='7816db5b' size-in-bits='32' id='8c77fc2b'/>
    <reference-type-def kind='lvalue' type-id='f0981eeb' size-in-bits='32' id='8c787cb7'/>
    <reference-type-def kind='rvalue' type-id='06ee45bd' size-in-bits='32' id='8caa2fad'/>
    <qualified-type-def type-id='37d9218c' const='yes' id='8cdb81b9'/>
    <pointer-type-def type-id='551a3c84' size-in-bits='32' id='8ced7af2'/>
    <reference-type-def kind='lvalue' type-id='9b45d938' size-in-bits='32' id='8cf4ca3a'/>
    <pointer-type-def type-id='69f91e90' size-in-bits='32' id='8d2b5ece'/>
    <qualified-type-def type-id='e4ac11d4' const='yes' id='8d3e5945'/>
    <qualified-type-def type-id='3f4f8178' const='yes' id='8da47f48'/>
    <qualified-type-def type-id='60cdedd2' const='yes' id='8de1b933'/>
    <qualified-type-def type-id='de55bd52' const='yes' id='8df03b5d'/>
    <typedef-decl name='jchar' type-id='149c6638' id='8dfe2e06'/>
    <pointer-type-def type-id='0a1605f7' size-in-bits='32' id='8e0aa20f'/>
    <qualified-type-def type-id='14a5725b' const='yes' id='8e2b6dd6'/>
    <function-type size-in-bits='32' id='8e80bdd8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='f62c522d' size-in-bits='32' id='8ec52105'/>
    <reference-type-def kind='lvalue' type-id='639eaa9a' size-in-bits='32' id='8ec6c5f4'/>
    <qualified-type-def type-id='4cb51eb6' const='yes' id='8ee001a9'/>
    <reference-type-def kind='lvalue' type-id='84e91272' size-in-bits='32' id='8ee7da3c'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <reference-type-def kind='lvalue' type-id='02ff77f1' size-in-bits='32' id='8f29a775'/>
    <function-type size-in-bits='32' id='8f71b7e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='61dc2b35'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='85670b6f' size-in-bits='32' id='8f83a0b3'/>
    <reference-type-def kind='lvalue' type-id='95b746c6' size-in-bits='32' id='8f8492a0'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <reference-type-def kind='lvalue' type-id='584de2ab' size-in-bits='32' id='8f9ba3f7'/>
    <reference-type-def kind='lvalue' type-id='47ae819e' size-in-bits='32' id='8fb634a8'/>
    <reference-type-def kind='lvalue' type-id='7d00ae45' size-in-bits='32' id='8fc07e8a'/>
    <reference-type-def kind='lvalue' type-id='270b873f' size-in-bits='32' id='9025ac5b'/>
    <qualified-type-def type-id='d5c4ab4c' const='yes' id='906fbca9'/>
    <reference-type-def kind='lvalue' type-id='27619c1c' size-in-bits='32' id='908b8f66'/>
    <function-type size-in-bits='32' id='90c673e3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <qualified-type-def type-id='6e84a657' const='yes' id='90c6c04a'/>
    <pointer-type-def type-id='9226d908' size-in-bits='32' id='90d7be2e'/>
    <reference-type-def kind='lvalue' type-id='789b3273' size-in-bits='32' id='91028e67'/>
    <pointer-type-def type-id='1a9d598b' size-in-bits='32' id='916299d7'/>
    <reference-type-def kind='rvalue' type-id='4cef1d7f' size-in-bits='32' id='91dfc6ef'/>
    <pointer-type-def type-id='59da7e0d' size-in-bits='32' id='921cf101'/>
    <qualified-type-def type-id='3ff5601b' const='yes' id='922df12b'/>
    <reference-type-def kind='rvalue' type-id='760319b5' size-in-bits='32' id='923a5af5'/>
    <reference-type-def kind='rvalue' type-id='6e679e09' size-in-bits='32' id='9276e559'/>
    <reference-type-def kind='rvalue' type-id='7940fa8d' size-in-bits='32' id='929e349d'/>
    <typedef-decl name='ACameraDevice_StateCallbacks' type-id='293e73a9' id='92cce770'/>
    <reference-type-def kind='lvalue' type-id='3a2a87e3' size-in-bits='32' id='92e8d817'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='92fa54c8' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='b3b907e8' size-in-bits='32' id='93737cc2'/>
    <qualified-type-def type-id='f76a9935' const='yes' id='93f1ab6e'/>
    <reference-type-def kind='rvalue' type-id='3984ca64' size-in-bits='32' id='93f3f738'/>
    <qualified-type-def type-id='484a53e3' const='yes' id='9405cf8c'/>
    <reference-type-def kind='lvalue' type-id='b7cf3a1f' size-in-bits='32' id='9438a7bb'/>
    <function-type size-in-bits='32' id='9441d304'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='b43b1271'/>
    </function-type>
    <pointer-type-def type-id='fcac2709' size-in-bits='32' id='9447819d'/>
    <pointer-type-def type-id='2638336c' size-in-bits='32' id='9518f98a'/>
    <function-type size-in-bits='32' id='9539c406'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='782c08bc' size-in-bits='32' id='95599970'/>
    <qualified-type-def type-id='f56bc8f9' const='yes' id='95b746c6'/>
    <reference-type-def kind='lvalue' type-id='96ae8d47' size-in-bits='32' id='95c88fb3'/>
    <function-type size-in-bits='32' id='95d32fc8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='9a10f134'/>
      <return type-id='48b5725f'/>
    </function-type>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <pointer-type-def type-id='2f02ea7a' size-in-bits='32' id='95fba39c'/>
    <pointer-type-def type-id='b8d27941' size-in-bits='32' id='96190689'/>
    <function-type size-in-bits='32' id='968ef04b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='baa375c2' size-in-bits='32' id='96975fa0'/>
    <class-decl name='ACameraMetadata_const_entry' size-in-bits='128' is-struct='yes' visibility='default' id='96a92ccd'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab598'>
          <data-member access='public'>
            <var-decl name='u8' type-id='9f7200cf' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='i32' type-id='1f526493' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='f' type-id='bc47ccdc' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='i64' type-id='505bed1a' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='d' type-id='a6370261' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='r' type-id='fb237c02' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='data' type-id='ac5ab598' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='4d637dbf' size-in-bits='32' id='96ae8d47'/>
    <pointer-type-def type-id='5c3c7795' size-in-bits='32' id='96ca2a2e'/>
    <class-decl name='camera_metadata' is-struct='yes' visibility='default' is-declaration-only='yes' id='96e4f1e6'/>
    <typedef-decl name='jobject' type-id='478e3663' id='96f3d089'/>
    <function-type size-in-bits='32' id='96fb4d64'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <typedef-decl name='ACameraCaptureSession_logicalCamera_captureCallback_failed' type-id='19672083' id='9715c851'/>
    <typedef-decl name='jdouble' type-id='a0eb0f08' id='973e3c3f'/>
    <pointer-type-def type-id='558a0aa4' size-in-bits='32' id='978c735e'/>
    <qualified-type-def type-id='bc8fd08c' const='yes' id='978cf3cb'/>
    <reference-type-def kind='lvalue' type-id='6078709c' size-in-bits='32' id='979974ce'/>
    <qualified-type-def type-id='291a51eb' const='yes' id='97b3d57a'/>
    <pointer-type-def type-id='fa9ac149' size-in-bits='32' id='980c4e21'/>
    <function-type size-in-bits='32' id='9863e9ef'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='ffad5b33' const='yes' id='987d77c3'/>
    <pointer-type-def type-id='92cce770' size-in-bits='32' id='987fd631'/>
    <pointer-type-def type-id='c5655405' size-in-bits='32' id='988f81c5'/>
    <reference-type-def kind='lvalue' type-id='b374073f' size-in-bits='32' id='98a72c5b'/>
    <function-type size-in-bits='32' id='98accb07'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='98f7aa67'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='8051cbec' size-in-bits='32' id='990b291a'/>
    <pointer-type-def type-id='2e19a82f' size-in-bits='32' id='99167093'/>
    <function-type size-in-bits='32' id='995d71ea'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='071e4e5d'/>
    </function-type>
    <typedef-decl name='jshort' type-id='23bd8cb5' id='9a10f134'/>
    <reference-type-def kind='rvalue' type-id='f23f6a00' size-in-bits='32' id='9a1d00d4'/>
    <qualified-type-def type-id='18165859' const='yes' id='9a271c44'/>
    <typedef-decl name='ACameraCaptureSession_captureCallback_sequenceEnd' type-id='34bd81ae' id='9a359a61'/>
    <reference-type-def kind='lvalue' type-id='75c1fb1c' size-in-bits='32' id='9a5e7c4e'/>
    <reference-type-def kind='lvalue' type-id='02809e8c' size-in-bits='32' id='9a79c59e'/>
    <pointer-type-def type-id='fba5b0d7' size-in-bits='32' id='9ac8b1e3'/>
    <pointer-type-def type-id='60637fec' size-in-bits='32' id='9acd858a'/>
    <pointer-type-def type-id='f4d3e94e' size-in-bits='32' id='9aeb7958'/>
    <pointer-type-def type-id='6b5c9008' size-in-bits='32' id='9b3c0ac2'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <reference-type-def kind='lvalue' type-id='f9e4b3e7' size-in-bits='32' id='9b5e46db'/>
    <reference-type-def kind='lvalue' type-id='74f1a4a5' size-in-bits='32' id='9b65fa39'/>
    <reference-type-def kind='lvalue' type-id='2b544340' size-in-bits='32' id='9ba61992'/>
    <pointer-type-def type-id='4d159548' size-in-bits='32' id='9bca647e'/>
    <qualified-type-def type-id='8dfe2e06' const='yes' id='9bf2d596'/>
    <qualified-type-def type-id='a0a3c555' const='yes' id='9c45b746'/>
    <reference-type-def kind='lvalue' type-id='e26aec08' size-in-bits='32' id='9c51cc6a'/>
    <qualified-type-def type-id='c0958ab1' const='yes' id='9c6e9081'/>
    <reference-type-def kind='lvalue' type-id='0b9a0a7f' size-in-bits='32' id='9c7e4a1b'/>
    <pointer-type-def type-id='3984ca64' size-in-bits='32' id='9c818882'/>
    <pointer-type-def type-id='27619c1c' size-in-bits='32' id='9c8ba24a'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <pointer-type-def type-id='46767cd5' size-in-bits='32' id='9d474d15'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <reference-type-def kind='rvalue' type-id='91dc52f9' size-in-bits='32' id='9e47fbb9'/>
    <qualified-type-def type-id='4478a14f' const='yes' id='9f2377bc'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='32' id='9f7200cf'/>
    <pointer-type-def type-id='44f4c31c' size-in-bits='32' id='9f8a208a'/>
    <reference-type-def kind='lvalue' type-id='579090e1' size-in-bits='32' id='9f93e945'/>
    <reference-type-def kind='lvalue' type-id='f22a5c41' size-in-bits='32' id='9faf7625'/>
    <pointer-type-def type-id='00e95b92' size-in-bits='32' id='9fb30f00'/>
    <qualified-type-def type-id='9c95d3a7' const='yes' id='9fee0a37'/>
    <pointer-type-def type-id='44c5857c' size-in-bits='32' id='9ff0e1ba'/>
    <function-type size-in-bits='32' id='a017e9d1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='e612672d' size-in-bits='32' id='a01a6e09'/>
    <pointer-type-def type-id='1e5a3259' size-in-bits='32' id='a031a791'/>
    <pointer-type-def type-id='ec89011e' size-in-bits='32' id='a049f9b0'/>
    <pointer-type-def type-id='2e613a3e' size-in-bits='32' id='a0ba6dc8'/>
    <pointer-type-def type-id='3197286d' size-in-bits='32' id='a0bc56e9'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <reference-type-def kind='lvalue' type-id='2f804dfc' size-in-bits='32' id='a0fa8e2e'/>
    <function-type size-in-bits='32' id='a1159711'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='a1390ee9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='70de5c42'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='6bdd0cef' size-in-bits='32' id='a16c036a'/>
    <reference-type-def kind='lvalue' type-id='082cc7e5' size-in-bits='32' id='a17e77f9'/>
    <function-type size-in-bits='32' id='a18ab994'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='7199b55d' size-in-bits='32' id='a1962658'/>
    <pointer-type-def type-id='6460c12a' size-in-bits='32' id='a1abad78'/>
    <reference-type-def kind='lvalue' type-id='745c9152' size-in-bits='32' id='a1b8f99c'/>
    <pointer-type-def type-id='96ae8d47' size-in-bits='32' id='a1c8a297'/>
    <reference-type-def kind='lvalue' type-id='f4513120' size-in-bits='32' id='a1d02c72'/>
    <reference-type-def kind='lvalue' type-id='f7fad164' size-in-bits='32' id='a1d76ae6'/>
    <class-decl name='ACameraCaptureSession' size-in-bits='448' is-struct='yes' visibility='default' id='a1f9d805'>
      <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mId' type-id='2448a865' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='mOutput' type-id='da25cb17' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='mUserSessionCallback' type-id='f5098ab4' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='mDevice' type-id='71ed2026' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='mIsClosed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='392'>
        <var-decl name='mClosedByApp' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='mSessionLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACameraCaptureSession' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='82303925' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='a67ef107'/>
          <parameter type-id='5c0536ba'/>
          <parameter type-id='25dbb38b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='0'>
        <function-decl name='~ACameraCaptureSession' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='82303925' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <qualified-type-def type-id='2637f885' const='yes' id='a22e6735'/>
    <reference-type-def kind='lvalue' type-id='82f4b55d' size-in-bits='32' id='a239b0a1'/>
    <pointer-type-def type-id='5d4b6f06' size-in-bits='32' id='a23a76e0'/>
    <pointer-type-def type-id='5e6dc2f4' size-in-bits='32' id='a2afccb2'/>
    <pointer-type-def type-id='ebc98183' size-in-bits='32' id='a2c0e6bf'/>
    <pointer-type-def type-id='42d681db' size-in-bits='32' id='a2db10bb'/>
    <reference-type-def kind='rvalue' type-id='a85d4248' size-in-bits='32' id='a2ec3bf1'/>
    <reference-type-def kind='rvalue' type-id='2aea98eb' size-in-bits='32' id='a3098b0b'/>
    <qualified-type-def type-id='85670b6f' const='yes' id='a32c4876'/>
    <qualified-type-def type-id='769cfaf0' const='yes' id='a3326720'/>
    <qualified-type-def type-id='b96df400' const='yes' id='a33d1010'/>
    <qualified-type-def type-id='ae098004' const='yes' id='a34554c3'/>
    <reference-type-def kind='lvalue' type-id='5d6edba8' size-in-bits='32' id='a383a08a'/>
    <pointer-type-def type-id='579090e1' size-in-bits='32' id='a393ef91'/>
    <pointer-type-def type-id='8bc2cf8a' size-in-bits='32' id='a3acd8e0'/>
    <pointer-type-def type-id='837777dd' size-in-bits='32' id='a3ea0661'/>
    <qualified-type-def type-id='406f4753' const='yes' id='a3f5ae0e'/>
    <reference-type-def kind='lvalue' type-id='6e81b4be' size-in-bits='32' id='a3faa290'/>
    <qualified-type-def type-id='bfa0e315' const='yes' id='a42e64e6'/>
    <pointer-type-def type-id='74d49702' size-in-bits='32' id='a4354b90'/>
    <pointer-type-def type-id='1ded82e5' size-in-bits='32' id='a4a48a09'/>
    <function-type size-in-bits='32' id='a4a61472'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='467aaa2c' size-in-bits='32' id='a4a6a786'/>
    <pointer-type-def type-id='ee0744fc' size-in-bits='32' id='a55b35a6'/>
    <pointer-type-def type-id='e53ab91c' size-in-bits='32' id='a5a1fc5a'/>
    <pointer-type-def type-id='745c9152' size-in-bits='32' id='a5b8ffe8'/>
    <typedef-decl name='ACameraCaptureSession_stateCallbacks' type-id='b155ca0d' id='a5bda984'/>
    <pointer-type-def type-id='07f10124' size-in-bits='32' id='a5fd6882'/>
    <pointer-type-def type-id='4aec61f6' size-in-bits='32' id='a60dd490'/>
    <reference-type-def kind='lvalue' type-id='dea3ef0c' size-in-bits='32' id='a6117f1e'/>
    <pointer-type-def type-id='6bb2df61' size-in-bits='32' id='a617346d'/>
    <pointer-type-def type-id='c80c3491' size-in-bits='32' id='a6370261'/>
    <pointer-type-def type-id='461d0e9f' size-in-bits='32' id='a642a393'/>
    <reference-type-def kind='lvalue' type-id='64e308f3' size-in-bits='32' id='a666e74f'/>
    <pointer-type-def type-id='b9930aae' size-in-bits='32' id='a6798dcc'/>
    <pointer-type-def type-id='da25cb17' size-in-bits='32' id='a67ef107'/>
    <pointer-type-def type-id='adf18958' size-in-bits='32' id='a6979e77'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <pointer-type-def type-id='87e0363f' size-in-bits='32' id='a72a21b7'/>
    <pointer-type-def type-id='74f1a4a5' size-in-bits='32' id='a7660d1d'/>
    <qualified-type-def type-id='03a1b690' const='yes' id='a7aa3ae5'/>
    <pointer-type-def type-id='4cd79d79' size-in-bits='32' id='a7ae3431'/>
    <pointer-type-def type-id='d318157e' size-in-bits='32' id='a7d6acc8'/>
    <reference-type-def kind='rvalue' type-id='41c7e19d' size-in-bits='32' id='a8048ac5'/>
    <function-type size-in-bits='32' id='a8186878'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <pointer-type-def type-id='27a87596' size-in-bits='32' id='a86eb340'/>
    <class-decl name='_jfloatArray' visibility='default' is-declaration-only='yes' id='a87003ef'/>
    <reference-type-def kind='lvalue' type-id='1b40f38a' size-in-bits='32' id='a8a7390c'/>
    <qualified-type-def type-id='64606595' const='yes' id='a8b69e1e'/>
    <pointer-type-def type-id='3ebf19c8' size-in-bits='32' id='a8d5bec6'/>
    <reference-type-def kind='lvalue' type-id='7c16c677' size-in-bits='32' id='a8da3183'/>
    <qualified-type-def type-id='b6619ae5' const='yes' id='a8e48eb5'/>
    <pointer-type-def type-id='a419a827' size-in-bits='32' id='a8ec907f'/>
    <qualified-type-def type-id='42d681db' const='yes' id='a9189dc2'/>
    <pointer-type-def type-id='0bf89381' size-in-bits='32' id='a9278ed9'/>
    <pointer-type-def type-id='a8186878' size-in-bits='32' id='a937264a'/>
    <qualified-type-def type-id='2ad232aa' const='yes' id='a96a9df5'/>
    <pointer-type-def type-id='26ee7735' size-in-bits='32' id='a975aa19'/>
    <qualified-type-def type-id='0994533b' const='yes' id='a981db8b'/>
    <pointer-type-def type-id='f751e8e5' size-in-bits='32' id='a9986e45'/>
    <pointer-type-def type-id='9a10f134' size-in-bits='32' id='aa210e95'/>
    <reference-type-def kind='lvalue' type-id='b43d11c8' size-in-bits='32' id='aa2339aa'/>
    <pointer-type-def type-id='91dc52f9' size-in-bits='32' id='aa2e9371'/>
    <reference-type-def kind='lvalue' type-id='7062dc99' size-in-bits='32' id='aaa180ad'/>
    <pointer-type-def type-id='bf774091' size-in-bits='32' id='aaecbfc9'/>
    <qualified-type-def type-id='97219ec5' const='yes' id='aaf9e895'/>
    <pointer-type-def type-id='c2479237' size-in-bits='32' id='ab3d6d1f'/>
    <function-type size-in-bits='32' id='ab5a280f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <class-decl name='ACameraCaptureSession_captureCallbacks' size-in-bits='256' is-struct='yes' visibility='default' id='ab6760dc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onCaptureStarted' type-id='1280ba53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='onCaptureProgressed' type-id='e5263ed0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='onCaptureCompleted' type-id='e5263ed0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='onCaptureFailed' type-id='253d86a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='onCaptureSequenceCompleted' type-id='9a359a61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='onCaptureSequenceAborted' type-id='5b12dd86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='onCaptureBufferLost' type-id='f2bba1dd' visibility='default'/>
      </data-member>
    </class-decl>
    <reference-type-def kind='rvalue' type-id='74a83c45' size-in-bits='32' id='aba48405'/>
    <reference-type-def kind='lvalue' type-id='d8498116' size-in-bits='32' id='abb65e90'/>
    <reference-type-def kind='lvalue' type-id='640e6f0f' size-in-bits='32' id='abb8fd8b'/>
    <pointer-type-def type-id='98accb07' size-in-bits='32' id='ac33476b'/>
    <pointer-type-def type-id='4e053e6d' size-in-bits='32' id='ac4ad749'/>
    <pointer-type-def type-id='98f7aa67' size-in-bits='32' id='ac4e6cb3'/>
    <pointer-type-def type-id='735576a1' size-in-bits='32' id='ac63eea9'/>
    <pointer-type-def type-id='717ad472' size-in-bits='32' id='ac74c0c4'/>
    <reference-type-def kind='lvalue' type-id='368848f2' size-in-bits='32' id='ac8aa5bc'/>
    <function-type size-in-bits='32' id='aca2cd7e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='e825b06b'/>
    </function-type>
    <pointer-type-def type-id='1b40f38a' size-in-bits='32' id='aca73f58'/>
    <reference-type-def kind='lvalue' type-id='c8c1ab82' size-in-bits='32' id='ace1332c'/>
    <class-decl name='JNINativeInterface' size-in-bits='7456' is-struct='yes' visibility='default' id='ad414f12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved0' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved3' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='GetVersion' type-id='4b15419a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='DefineClass' type-id='3358ddb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='FindClass' type-id='e905d0ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='FromReflectedMethod' type-id='09176273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='FromReflectedField' type-id='04aa9df2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ToReflectedMethod' type-id='582ba311' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='GetSuperclass' type-id='93737cc2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='IsAssignableFrom' type-id='f39f8bbd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ToReflectedField' type-id='58398eee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='Throw' type-id='4a0b9bf1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ThrowNew' type-id='0571aa74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ExceptionOccurred' type-id='7fdf58e1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ExceptionDescribe' type-id='8bc971a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='ExceptionClear' type-id='8bc971a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='FatalError' type-id='2deb20e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='PushLocalFrame' type-id='9aeb7958' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PopLocalFrame' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='NewGlobalRef' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='DeleteGlobalRef' type-id='8a1f7e9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='DeleteLocalRef' type-id='8a1f7e9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='IsSameObject' type-id='782c53f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='NewLocalRef' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='EnsureLocalCapacity' type-id='9aeb7958' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='AllocObject' type-id='151a1d63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='NewObject' type-id='f8af7982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='NewObjectV' type-id='a01a6e09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='NewObjectA' type-id='f0a0ff54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='GetObjectClass' type-id='b5f4f133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='IsInstanceOf' type-id='bcee08ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='GetMethodID' type-id='30974818' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='CallObjectMethod' type-id='2dab161d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='CallObjectMethodV' type-id='0290ef52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='CallObjectMethodA' type-id='4278623b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='CallBooleanMethod' type-id='461c5f2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='CallBooleanMethodV' type-id='88d99751' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='CallBooleanMethodA' type-id='74823d0c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='CallByteMethod' type-id='17d955f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='CallByteMethodV' type-id='44bea17b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='CallByteMethodA' type-id='ed0795aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='CallCharMethod' type-id='e747dee6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='CallCharMethodV' type-id='d31f1c35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='CallCharMethodA' type-id='b0061f70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='CallShortMethod' type-id='bf87e894' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='CallShortMethodV' type-id='5da2c37f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='CallShortMethodA' type-id='5db5877e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='CallIntMethod' type-id='3271bf2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='CallIntMethodV' type-id='66ebe6b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='CallIntMethodA' type-id='6c56e815' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='CallLongMethod' type-id='ea8867ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='CallLongMethodV' type-id='5f929ab7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='CallLongMethodA' type-id='a55b35a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='CallFloatMethod' type-id='e8139a80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='CallFloatMethodV' type-id='9ac8b1e3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='CallFloatMethodA' type-id='413559e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='CallDoubleMethod' type-id='a642a393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='CallDoubleMethodV' type-id='95fba39c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='CallDoubleMethodA' type-id='a3ea0661' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='CallVoidMethod' type-id='d696f7b3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='CallVoidMethodV' type-id='bbecc3fc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='CallVoidMethodA' type-id='921cf101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='CallNonvirtualObjectMethod' type-id='4f7677f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='CallNonvirtualObjectMethodV' type-id='15887ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='CallNonvirtualObjectMethodA' type-id='34c67260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='CallNonvirtualBooleanMethod' type-id='f1191df9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='CallNonvirtualBooleanMethodV' type-id='ff535cb6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='CallNonvirtualBooleanMethodA' type-id='fb38167f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='CallNonvirtualByteMethod' type-id='377b5e63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='CallNonvirtualByteMethodV' type-id='1930d02c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='CallNonvirtualByteMethodA' type-id='1d2f8a91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='CallNonvirtualCharMethod' type-id='63f7d65d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='CallNonvirtualCharMethodV' type-id='c32cfa12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='CallNonvirtualCharMethodA' type-id='c2280e7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='CallNonvirtualShortMethod' type-id='0de4af77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='CallNonvirtualShortMethodV' type-id='255ff5d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='CallNonvirtualShortMethodA' type-id='f4bbad8d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='CallNonvirtualIntMethod' type-id='ce1853bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='CallNonvirtualIntMethodV' type-id='d5b0b547' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='CallNonvirtualIntMethodA' type-id='3318dad6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='CallNonvirtualLongMethod' type-id='3459b4cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='CallNonvirtualLongMethodV' type-id='a60dd490' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='CallNonvirtualLongMethodA' type-id='326df5b5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='CallNonvirtualFloatMethod' type-id='eb164d0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='CallNonvirtualFloatMethodV' type-id='8c4e1254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='CallNonvirtualFloatMethodA' type-id='a0bc56e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='CallNonvirtualDoubleMethod' type-id='2dcc8b98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='CallNonvirtualDoubleMethodV' type-id='0e5e0cdb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='CallNonvirtualDoubleMethodA' type-id='a937264a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='CallNonvirtualVoidMethod' type-id='c14258b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='CallNonvirtualVoidMethodV' type-id='1db4c5bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='CallNonvirtualVoidMethodA' type-id='41d61b6a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='GetFieldID' type-id='5d99509b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='GetObjectField' type-id='7139225a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='GetBooleanField' type-id='13196dfd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='GetByteField' type-id='c8bc780f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='GetCharField' type-id='239d7ad9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='GetShortField' type-id='476f48bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='GetIntField' type-id='f7e564c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='GetLongField' type-id='ac4e6cb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GetFloatField' type-id='06fbd437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='GetDoubleField' type-id='47bc557c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='SetObjectField' type-id='e333ff60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='SetBooleanField' type-id='b263848f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='SetByteField' type-id='a4a48a09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='SetCharField' type-id='e4b27ecf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='SetShortField' type-id='090a6901' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='SetIntField' type-id='d3651c96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='SetLongField' type-id='09b49e9d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='SetFloatField' type-id='ac4ad749' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='SetDoubleField' type-id='195d3e42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='GetStaticMethodID' type-id='30974818' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='CallStaticObjectMethod' type-id='f8af7982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='CallStaticObjectMethodV' type-id='a01a6e09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='CallStaticObjectMethodA' type-id='f0a0ff54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='CallStaticBooleanMethod' type-id='916299d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='CallStaticBooleanMethodV' type-id='412650f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='CallStaticBooleanMethodA' type-id='339f696d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='CallStaticByteMethod' type-id='ce9d67cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='CallStaticByteMethodV' type-id='478facc2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='CallStaticByteMethodA' type-id='db28fdcb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='CallStaticCharMethod' type-id='3bd86cfb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='CallStaticCharMethodV' type-id='dddcefc4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='CallStaticCharMethodA' type-id='692552f9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='CallStaticShortMethod' type-id='362e2831' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='CallStaticShortMethodV' type-id='d1173c4e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='CallStaticShortMethodA' type-id='097c7407' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='CallStaticIntMethod' type-id='64ca4b84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='CallStaticIntMethodV' type-id='0323d66f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='CallStaticIntMethodA' type-id='30b9a8ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='CallStaticLongMethod' type-id='8c22ffe9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='CallStaticLongMethodV' type-id='60306f66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='CallStaticLongMethodA' type-id='1fda464f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='CallStaticFloatMethod' type-id='4ed90115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='CallStaticFloatMethodV' type-id='87e0b5ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='CallStaticFloatMethodA' type-id='caa57963' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='CallStaticDoubleMethod' type-id='04b3e5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='CallStaticDoubleMethodV' type-id='be0ed943' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='CallStaticDoubleMethodA' type-id='df8dc702' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='CallStaticVoidMethod' type-id='a86eb340' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='CallStaticVoidMethodV' type-id='cf05fa23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='CallStaticVoidMethodA' type-id='6fc0eca2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='GetStaticFieldID' type-id='5d99509b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='GetStaticObjectField' type-id='d7560895' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='GetStaticBooleanField' type-id='4127a730' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='GetStaticByteField' type-id='c404650a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='GetStaticCharField' type-id='0736b484' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4768'>
        <var-decl name='GetStaticShortField' type-id='0d5970ee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='GetStaticIntField' type-id='771014ab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='GetStaticLongField' type-id='a4a6a786' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='GetStaticFloatField' type-id='337e1672' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4896'>
        <var-decl name='GetStaticDoubleField' type-id='bd4849d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='SetStaticObjectField' type-id='6c160b51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='SetStaticBooleanField' type-id='0a7e4740' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='SetStaticByteField' type-id='0cb5bb00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='SetStaticCharField' type-id='bbfff1aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='SetStaticShortField' type-id='187251e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='SetStaticIntField' type-id='3a8fe115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='SetStaticLongField' type-id='72f7c194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='SetStaticFloatField' type-id='e0227512' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='SetStaticDoubleField' type-id='30411993' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='NewString' type-id='40f183ab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='GetStringLength' type-id='a7d6acc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5280'>
        <var-decl name='GetStringChars' type-id='e5a87447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ReleaseStringChars' type-id='61d681d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5344'>
        <var-decl name='NewStringUTF' type-id='691ba251' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='GetStringUTFLength' type-id='a7d6acc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5408'>
        <var-decl name='GetStringUTFChars' type-id='08565ebd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='ReleaseStringUTFChars' type-id='ac33476b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5472'>
        <var-decl name='GetArrayLength' type-id='a23a76e0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='NewObjectArray' type-id='e4f2ab66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5536'>
        <var-decl name='GetObjectArrayElement' type-id='0ae13aef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='SetObjectArrayElement' type-id='99167093' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5600'>
        <var-decl name='NewBooleanArray' type-id='162473c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='NewByteArray' type-id='be49c182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5664'>
        <var-decl name='NewCharArray' type-id='ac74c0c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='NewShortArray' type-id='978c735e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='NewIntArray' type-id='2041a8d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='NewLongArray' type-id='d7ea3436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5792'>
        <var-decl name='NewFloatArray' type-id='69b7386a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='NewDoubleArray' type-id='31ebf17b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5856'>
        <var-decl name='GetBooleanArrayElements' type-id='9b3c0ac2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='GetByteArrayElements' type-id='33683384' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5920'>
        <var-decl name='GetCharArrayElements' type-id='be2cecec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='GetShortArrayElements' type-id='5353c67e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5984'>
        <var-decl name='GetIntArrayElements' type-id='4f68d4b2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='GetLongArrayElements' type-id='b286ae14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6048'>
        <var-decl name='GetFloatArrayElements' type-id='210c37a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='GetDoubleArrayElements' type-id='b181362a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6112'>
        <var-decl name='ReleaseBooleanArrayElements' type-id='666fc788' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='ReleaseByteArrayElements' type-id='59e7b6c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6176'>
        <var-decl name='ReleaseCharArrayElements' type-id='01eb6566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='ReleaseShortArrayElements' type-id='075b7a00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='ReleaseIntArrayElements' type-id='bc4a7a06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ReleaseLongArrayElements' type-id='0ba6a8b6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='ReleaseFloatArrayElements' type-id='c503a924' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ReleaseDoubleArrayElements' type-id='c8abb79e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6368'>
        <var-decl name='GetBooleanArrayRegion' type-id='67514b72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='GetByteArrayRegion' type-id='c541e6a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6432'>
        <var-decl name='GetCharArrayRegion' type-id='af95e824' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='GetShortArrayRegion' type-id='1f57b15a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='GetIntArrayRegion' type-id='7f0ac28c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='GetLongArrayRegion' type-id='747a49e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='GetFloatArrayRegion' type-id='060c7d5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='GetDoubleArrayRegion' type-id='fce8e074' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='SetBooleanArrayRegion' type-id='a617346d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='SetByteArrayRegion' type-id='5ee69201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='SetCharArrayRegion' type-id='b049b821' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='SetShortArrayRegion' type-id='62d9dee9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='SetIntArrayRegion' type-id='f569444f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='SetLongArrayRegion' type-id='10182119' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='SetFloatArrayRegion' type-id='a975aa19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='SetDoubleArrayRegion' type-id='348c02e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='RegisterNatives' type-id='764ac7bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='UnregisterNatives' type-id='9447819d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='MonitorEnter' type-id='67a46ff2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='MonitorExit' type-id='67a46ff2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7008'>
        <var-decl name='GetJavaVM' type-id='5a4c25bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='GetStringRegion' type-id='fb79cfe8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7072'>
        <var-decl name='GetStringUTFRegion' type-id='629961b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='GetPrimitiveArrayCritical' type-id='d82ed742' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <var-decl name='ReleasePrimitiveArrayCritical' type-id='601f438c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='GetStringCritical' type-id='e5a87447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7200'>
        <var-decl name='ReleaseStringCritical' type-id='61d681d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='NewWeakGlobalRef' type-id='03bcacf3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='DeleteWeakGlobalRef' type-id='ccc141a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='ExceptionCheck' type-id='5796afad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7328'>
        <var-decl name='NewDirectByteBuffer' type-id='2c684c9f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='GetDirectBufferAddress' type-id='bd98ffce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7392'>
        <var-decl name='GetDirectBufferCapacity' type-id='47653e05' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='GetObjectRefType' type-id='500eebf7' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='e5dbe592' const='yes' id='ad5227a3'/>
    <pointer-type-def type-id='225e915e' size-in-bits='32' id='ad5df6b4'/>
    <typedef-decl name='jbyte' type-id='ee31ee44' id='adf18958'/>
    <pointer-type-def type-id='693ee6ab' size-in-bits='32' id='adfb60db'/>
    <function-type size-in-bits='32' id='ae2834f4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <class-decl name='_jstring' visibility='default' is-declaration-only='yes' id='ae6a1c55'/>
    <reference-type-def kind='lvalue' type-id='c3332543' size-in-bits='32' id='ae83ddff'/>
    <reference-type-def kind='lvalue' type-id='05623813' size-in-bits='32' id='ae9e7b6f'/>
    <pointer-type-def type-id='af129cdf' size-in-bits='32' id='af1731c7'/>
    <reference-type-def kind='lvalue' type-id='9405cf8c' size-in-bits='32' id='af25e89e'/>
    <pointer-type-def type-id='0036a166' size-in-bits='32' id='af3b333c'/>
    <pointer-type-def type-id='cc9700de' size-in-bits='32' id='af46b704'/>
    <typedef-decl name='ACameraManager_ExtendedAvailabilityCallbacks' type-id='190d429d' id='af50bada'/>
    <qualified-type-def type-id='1a7fe6b0' const='yes' id='af8c6a20'/>
    <pointer-type-def type-id='c8bb07fa' size-in-bits='32' id='af95e824'/>
    <reference-type-def kind='lvalue' type-id='c29de977' size-in-bits='32' id='af964a83'/>
    <pointer-type-def type-id='6e81b4be' size-in-bits='32' id='affab574'/>
    <pointer-type-def type-id='85d5402e' size-in-bits='32' id='b0061f70'/>
    <function-type size-in-bits='32' id='b01f64aa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <pointer-type-def type-id='c4cf512d' size-in-bits='32' id='b049b821'/>
    <pointer-type-def type-id='519d1950' size-in-bits='32' id='b0692026'/>
    <class-decl name='_jintArray' visibility='default' is-declaration-only='yes' id='b0749e8e'/>
    <pointer-type-def type-id='d988e2e8' size-in-bits='32' id='b09bab5e'/>
    <reference-type-def kind='lvalue' type-id='4c0de1d1' size-in-bits='32' id='b0dab7d5'/>
    <reference-type-def kind='rvalue' type-id='aad38483' size-in-bits='32' id='b0df7f43'/>
    <function-type size-in-bits='32' id='b10103d8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='bd2efa93' size-in-bits='32' id='b12017c2'/>
    <function-type size-in-bits='32' id='b142692f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <class-decl name='ACameraCaptureSession_stateCallbacks' size-in-bits='128' is-struct='yes' visibility='default' id='b155ca0d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onClosed' type-id='5b4cb29f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='onReady' type-id='5b4cb29f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='onActive' type-id='5b4cb29f' visibility='default'/>
      </data-member>
    </class-decl>
    <reference-type-def kind='lvalue' type-id='c956a398' size-in-bits='32' id='b163c41a'/>
    <qualified-type-def type-id='2e71668d' const='yes' id='b16ea9dd'/>
    <pointer-type-def type-id='f5043860' size-in-bits='32' id='b181362a'/>
    <reference-type-def kind='lvalue' type-id='fff6e2e6' size-in-bits='32' id='b1a6f440'/>
    <pointer-type-def type-id='57d663c4' size-in-bits='32' id='b1dfda36'/>
    <qualified-type-def type-id='d88c39bb' const='yes' id='b2300bca'/>
    <pointer-type-def type-id='c5a3852b' size-in-bits='32' id='b263848f'/>
    <pointer-type-def type-id='e67d8190' size-in-bits='32' id='b278c6b6'/>
    <pointer-type-def type-id='c3332543' size-in-bits='32' id='b283e44b'/>
    <pointer-type-def type-id='02c4e402' size-in-bits='32' id='b286ae14'/>
    <reference-type-def kind='lvalue' type-id='72e763a3' size-in-bits='32' id='b2c33f52'/>
    <function-type size-in-bits='32' id='b2cf38da'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <qualified-type-def type-id='9a70948f' const='yes' id='b374073f'/>
    <qualified-type-def type-id='3efa4404' const='yes' id='b396e89b'/>
    <function-type size-in-bits='32' id='b3b907e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='b3d5cbab'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='3b4676f4'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='a7aa3ae5' size-in-bits='32' id='b3fa80f9'/>
    <pointer-type-def type-id='d523b107' size-in-bits='32' id='b42fe9d7'/>
    <typedef-decl name='jlongArray' type-id='15b6e673' id='b43b1271'/>
    <qualified-type-def type-id='08f7445f' const='yes' id='b43d11c8'/>
    <reference-type-def kind='lvalue' type-id='1377b429' size-in-bits='32' id='b470739d'/>
    <reference-type-def kind='rvalue' type-id='b39df991' size-in-bits='32' id='b494aef1'/>
    <reference-type-def kind='rvalue' type-id='8ccfa95d' size-in-bits='32' id='b4f4965d'/>
    <reference-type-def kind='rvalue' type-id='cf567cb8' size-in-bits='32' id='b581d01c'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <pointer-type-def type-id='92e4cc3e' size-in-bits='32' id='b5c4f664'/>
    <pointer-type-def type-id='caf8409f' size-in-bits='32' id='b5f4f133'/>
    <reference-type-def kind='rvalue' type-id='74d49702' size-in-bits='32' id='b6037b16'/>
    <pointer-type-def type-id='cd326051' size-in-bits='32' id='b6666789'/>
    <function-type size-in-bits='32' id='b66924e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='31fb592e' size-in-bits='32' id='b6ad2798'/>
    <function-type size-in-bits='32' id='b6d76995'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='60cdedd2' size-in-bits='32' id='b6daba50'/>
    <function-type size-in-bits='32' id='b6e5053d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='a8d5bec6'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='a19580db' size-in-bits='32' id='b6eceb9b'/>
    <pointer-type-def type-id='99dc68fb' size-in-bits='32' id='b6f6727b'/>
    <qualified-type-def type-id='d21cc6ce' const='yes' id='b737c55e'/>
    <reference-type-def kind='rvalue' type-id='6b4a65cd' size-in-bits='32' id='b74e782d'/>
    <reference-type-def kind='lvalue' type-id='bbc92c3c' size-in-bits='32' id='b7b06cee'/>
    <typedef-decl name='JNINativeMethod' type-id='56f71ed3' id='b7b5d51d'/>
    <class-decl name='ACaptureSessionOutputContainer' size-in-bits='96' is-struct='yes' visibility='default' id='b7bcdd66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mOutputs' type-id='18165859' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='c1aa2e6a' const='yes' id='b7cf3a1f'/>
    <function-type size-in-bits='32' id='b7d01ad5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='b7e7edbe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='32' id='b7f9d8e6'/>
    <pointer-type-def type-id='53c9736c' size-in-bits='32' id='b81502ba'/>
    <reference-type-def kind='rvalue' type-id='d6a92829' size-in-bits='32' id='b817cb79'/>
    <reference-type-def kind='lvalue' type-id='c8491dd8' size-in-bits='32' id='b8cb9312'/>
    <qualified-type-def type-id='3d74e87c' const='yes' id='b8d5136c'/>
    <function-type size-in-bits='32' id='b8f37837'>
      <parameter type-id='0052b394'/>
      <parameter type-id='0052b394'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <qualified-type-def type-id='18b0cc4f' const='yes' id='b8f5f378'/>
    <pointer-type-def type-id='678452de' size-in-bits='32' id='b962da64'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <qualified-type-def type-id='80f4b756' const='yes' id='b99c00c9'/>
    <function-type size-in-bits='32' id='b9c972b8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='64606595' size-in-bits='32' id='bafcf955'/>
    <class-decl name='_jobject' size-in-bits='8' visibility='default' id='baffb083'/>
    <reference-type-def kind='lvalue' type-id='33734e9b' size-in-bits='32' id='bb84f387'/>
    <function-type size-in-bits='32' id='bbab09bf'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='6f4c521b'/>
      <parameter type-id='2d8486a3'/>
      <parameter type-id='9da381c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='71b7128c' const='yes' id='bbc92c3c'/>
    <pointer-type-def type-id='59b5ee8a' size-in-bits='32' id='bbecc3fc'/>
    <pointer-type-def type-id='e81ac6f8' size-in-bits='32' id='bbfff1aa'/>
    <pointer-type-def type-id='ec531f42' size-in-bits='32' id='bc1e1c10'/>
    <pointer-type-def type-id='73f3791e' size-in-bits='32' id='bc47ccdc'/>
    <pointer-type-def type-id='5368e5fc' size-in-bits='32' id='bc4a7a06'/>
    <reference-type-def kind='lvalue' type-id='519d1950' size-in-bits='32' id='bc69330a'/>
    <pointer-type-def type-id='c8491dd8' size-in-bits='32' id='bccb995e'/>
    <pointer-type-def type-id='fe002283' size-in-bits='32' id='bcd102c3'/>
    <pointer-type-def type-id='2bf893d9' size-in-bits='32' id='bcd4e701'/>
    <qualified-type-def type-id='5fbf0404' const='yes' id='bcd6c637'/>
    <pointer-type-def type-id='603f72de' size-in-bits='32' id='bced0ca4'/>
    <pointer-type-def type-id='6935722a' size-in-bits='32' id='bcee08ac'/>
    <reference-type-def kind='rvalue' type-id='1317e1fb' size-in-bits='32' id='bcf314ab'/>
    <function-type size-in-bits='32' id='bcf91e7a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='d8263a65'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='ed3044e3' size-in-bits='32' id='bd4849d7'/>
    <type-decl name='long int' size-in-bits='32' id='bd54fe1a'/>
    <pointer-type-def type-id='a18ab994' size-in-bits='32' id='bd98ffce'/>
    <pointer-type-def type-id='61b3f609' size-in-bits='32' id='bdcd0e21'/>
    <reference-type-def kind='rvalue' type-id='af9f9143' size-in-bits='32' id='bddda253'/>
    <qualified-type-def type-id='fe61024e' const='yes' id='bde7be41'/>
    <pointer-type-def type-id='dad530df' size-in-bits='32' id='be0ed943'/>
    <pointer-type-def type-id='995d71ea' size-in-bits='32' id='be2cecec'/>
    <qualified-type-def type-id='680601aa' const='yes' id='be3e2187'/>
    <pointer-type-def type-id='8f71b7e8' size-in-bits='32' id='be49c182'/>
    <reference-type-def kind='lvalue' type-id='8e2b6dd6' size-in-bits='32' id='be5e10d0'/>
    <qualified-type-def type-id='ad414f12' const='yes' id='bebf8fb7'/>
    <function-type size-in-bits='32' id='becc631c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='becc7143'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='bed9a8c1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='bf1e0391'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='f552d3a8' size-in-bits='32' id='bf63088a'/>
    <pointer-type-def type-id='6cb62dc6' size-in-bits='32' id='bf84559c'/>
    <pointer-type-def type-id='f6de0a0a' size-in-bits='32' id='bf87e894'/>
    <qualified-type-def type-id='4e0bfe8e' const='yes' id='bfb3c4b3'/>
    <pointer-type-def type-id='5fbf0404' size-in-bits='32' id='bfd7e242'/>
    <reference-type-def kind='lvalue' type-id='73f3791e' size-in-bits='32' id='c047d328'/>
    <reference-type-def kind='lvalue' type-id='69d84107' size-in-bits='32' id='c06e86f3'/>
    <reference-type-def kind='lvalue' type-id='c833d2f8' size-in-bits='32' id='c0884412'/>
    <qualified-type-def type-id='3984ca64' const='yes' id='c0d39641'/>
    <reference-type-def kind='lvalue' type-id='8d551f68' size-in-bits='32' id='c0d93742'/>
    <pointer-type-def type-id='cb1a2fc9' size-in-bits='32' id='c0dca6d1'/>
    <pointer-type-def type-id='07da9dcb' size-in-bits='32' id='c10e4dfb'/>
    <function-type size-in-bits='32' id='c12bf182'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <pointer-type-def type-id='d47f2e6e' size-in-bits='32' id='c14258b8'/>
    <qualified-type-def type-id='60514a0b' const='yes' id='c1647b90'/>
    <qualified-type-def type-id='b28eb34a' const='yes' id='c16f8eef'/>
    <qualified-type-def type-id='9a10f134' const='yes' id='c17f92e4'/>
    <pointer-type-def type-id='0944aa01' size-in-bits='32' id='c217e1b1'/>
    <pointer-type-def type-id='ab5a280f' size-in-bits='32' id='c2280e7b'/>
    <qualified-type-def type-id='0f3165aa' const='yes' id='c29de977'/>
    <reference-type-def kind='lvalue' type-id='f935ea55' size-in-bits='32' id='c2e01309'/>
    <pointer-type-def type-id='60514a0b' size-in-bits='32' id='c2e7c99b'/>
    <class-decl name='ACameraCaptureFailure' size-in-bits='192' is-struct='yes' visibility='default' id='c2f20afb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='frameNumber' type-id='9da381c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reason' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sequenceId' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='wasImageCaptured' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c8745fdc' size-in-bits='32' id='c2fb5303'/>
    <qualified-type-def type-id='651a401a' const='yes' id='c31acdea'/>
    <pointer-type-def type-id='b10103d8' size-in-bits='32' id='c32cfa12'/>
    <qualified-type-def type-id='27619c1c' const='yes' id='c3332543'/>
    <reference-type-def kind='rvalue' type-id='680601aa' size-in-bits='32' id='c35370ae'/>
    <function-type size-in-bits='32' id='c355496b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='3c8ecc03'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='ae4964f6' const='yes' id='c36a3acd'/>
    <typedef-decl name='jobjectRefType' type-id='4f771c8a' id='c36bf49e'/>
    <qualified-type-def type-id='40660a2d' const='yes' id='c380fa52'/>
    <reference-type-def kind='lvalue' type-id='6cb62dc6' size-in-bits='32' id='c3845be8'/>
    <pointer-type-def type-id='ebc81181' size-in-bits='32' id='c3a70532'/>
    <qualified-type-def type-id='e89f4e25' const='yes' id='c3ed119a'/>
    <pointer-type-def type-id='34a8f4c1' size-in-bits='32' id='c3f5d219'/>
    <pointer-type-def type-id='8e80bdd8' size-in-bits='32' id='c404650a'/>
    <pointer-type-def type-id='c833d2f8' size-in-bits='32' id='c4884a5e'/>
    <function-type size-in-bits='32' id='c4cf512d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='3b4676f4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='8d551f68' size-in-bits='32' id='c4d93d8e'/>
    <qualified-type-def type-id='5d9f8274' const='yes' id='c4f086e1'/>
    <pointer-type-def type-id='bcf91e7a' size-in-bits='32' id='c503a924'/>
    <class-decl name='ACameraManager' size-in-bits='64' is-struct='yes' visibility='default' id='c51a15f2'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='mGlobalManager' type-id='0306a627' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACameraManager' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='ea9dd6f0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~ACameraManager' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='ea9dd6f0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <pointer-type-def type-id='386e18fa' size-in-bits='32' id='c541e6a4'/>
    <function-type size-in-bits='32' id='c5a3852b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='8bac99cf' size-in-bits='32' id='c5b6437f'/>
    <function-type size-in-bits='32' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c5c8084e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='26a90f95'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='c70437bc' size-in-bits='32' id='c5d4ea86'/>
    <qualified-type-def type-id='0ad725ff' const='yes' id='c5dfd76f'/>
    <reference-type-def kind='lvalue' type-id='fe2abd8f' size-in-bits='32' id='c648910b'/>
    <qualified-type-def type-id='e82ccd38' const='yes' id='c6b5bf17'/>
    <pointer-type-def type-id='b8f37837' size-in-bits='32' id='c6e85893'/>
    <pointer-type-def type-id='bab2a3d8' size-in-bits='32' id='c72c95ae'/>
    <pointer-type-def type-id='5a723bc9' size-in-bits='32' id='c7368ea1'/>
    <pointer-type-def type-id='8a8005ea' size-in-bits='32' id='c7890d40'/>
    <reference-type-def kind='lvalue' type-id='abb85f22' size-in-bits='32' id='c7c36bf4'/>
    <pointer-type-def type-id='7abe72a4' size-in-bits='32' id='c7ce558a'/>
    <pointer-type-def type-id='c5a79417' size-in-bits='32' id='c7fb5dcf'/>
    <qualified-type-def type-id='a0eb0f08' const='yes' id='c80c3491'/>
    <pointer-type-def type-id='8d3e5945' size-in-bits='32' id='c826c9bd'/>
    <pointer-type-def type-id='7dee695e' size-in-bits='32' id='c83ed0e4'/>
    <typedef-decl name='jlong' type-id='9da381c4' id='c8745fdc'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <pointer-type-def type-id='792136c4' size-in-bits='32' id='c8abb79e'/>
    <function-type size-in-bits='32' id='c8bb07fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='071e4e5d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='4142d35b' size-in-bits='32' id='c8bc780f'/>
    <qualified-type-def type-id='2c1e9072' const='yes' id='c8c1ab82'/>
    <qualified-type-def type-id='96c05a9a' const='yes' id='c8f2ae2a'/>
    <reference-type-def kind='lvalue' type-id='ea6782df' size-in-bits='32' id='c90313b3'/>
    <class-decl name='_JNIEnv' size-in-bits='32' is-struct='yes' visibility='default' id='c9459134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='functions' type-id='e48f1427' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='d6a92829' const='yes' id='c956a398'/>
    <reference-type-def kind='lvalue' type-id='13c66d8e' size-in-bits='32' id='c95e9f78'/>
    <reference-type-def kind='lvalue' type-id='d8a9e490' size-in-bits='32' id='c9730a82'/>
    <pointer-type-def type-id='348c1658' size-in-bits='32' id='c997ab5e'/>
    <pointer-type-def type-id='95dcad92' size-in-bits='32' id='c99f3fc0'/>
    <pointer-type-def type-id='7c6c74ea' size-in-bits='32' id='c9ce7b38'/>
    <typedef-decl name='ACameraCaptureSession_logicalCamera_captureCallback_result' type-id='1af20502' id='c9e023e5'/>
    <qualified-type-def type-id='b96bb15f' const='yes' id='c9e564b8'/>
    <function-type size-in-bits='32' id='c9f7d0f5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='9a10f134'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='14a5725b' size-in-bits='32' id='ca2503ab'/>
    <function-type size-in-bits='32' id='ca62bfca'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <qualified-type-def type-id='1eb56b1e' const='yes' id='ca7c9639'/>
    <pointer-type-def type-id='88f16d4f' size-in-bits='32' id='caa57963'/>
    <function-type size-in-bits='32' id='caf8409f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='70de5c42'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='51468fff' size-in-bits='32' id='cb14729b'/>
    <reference-type-def kind='lvalue' type-id='27c2393d' size-in-bits='32' id='cb279019'/>
    <function-type size-in-bits='32' id='cb425c26'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='071e4e5d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='d660ba77' size-in-bits='32' id='cb454d83'/>
    <qualified-type-def type-id='74a83c45' const='yes' id='cb97722a'/>
    <reference-type-def kind='rvalue' type-id='27619c1c' size-in-bits='32' id='cbb281c0'/>
    <pointer-type-def type-id='291a51eb' size-in-bits='32' id='cc103f6b'/>
    <typedef-decl name='jboolean' type-id='b96825af' id='cc6e09ca'/>
    <reference-type-def kind='lvalue' type-id='47351492' size-in-bits='32' id='cc8f975c'/>
    <pointer-type-def type-id='23af9275' size-in-bits='32' id='ccbbffb5'/>
    <pointer-type-def type-id='5432adc5' size-in-bits='32' id='ccc141a1'/>
    <reference-type-def kind='lvalue' type-id='db4d5c20' size-in-bits='32' id='cccc985a'/>
    <qualified-type-def type-id='c8491dd8' const='yes' id='cce517cd'/>
    <qualified-type-def type-id='4cef1d7f' const='yes' id='ccec19b6'/>
    <function-type size-in-bits='32' id='cd5e6e48'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='6e9854cd'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='c4f086e1' size-in-bits='32' id='cda42b45'/>
    <pointer-type-def type-id='c2ad429c' size-in-bits='32' id='cdd4b80a'/>
    <pointer-type-def type-id='79744773' size-in-bits='32' id='cde873c3'/>
    <pointer-type-def type-id='b2cf38da' size-in-bits='32' id='ce1853bc'/>
    <pointer-type-def type-id='7792dc45' size-in-bits='32' id='ce482e45'/>
    <pointer-type-def type-id='f1c99104' size-in-bits='32' id='ce4f8b6a'/>
    <reference-type-def kind='lvalue' type-id='42021ec3' size-in-bits='32' id='ce56a27f'/>
    <pointer-type-def type-id='e6efff49' size-in-bits='32' id='ce9d67cd'/>
    <pointer-type-def type-id='9863e9ef' size-in-bits='32' id='cf05fa23'/>
    <pointer-type-def type-id='958975c8' size-in-bits='32' id='cf26984e'/>
    <reference-type-def kind='lvalue' type-id='a8b69e1e' size-in-bits='32' id='cf7b1228'/>
    <reference-type-def kind='lvalue' type-id='71d42656' size-in-bits='32' id='cf8ad577'/>
    <reference-type-def kind='lvalue' type-id='19a9b64c' size-in-bits='32' id='d02a28de'/>
    <pointer-type-def type-id='0307a520' size-in-bits='32' id='d0412bf6'/>
    <reference-type-def kind='lvalue' type-id='23af9275' size-in-bits='32' id='d0bc0601'/>
    <pointer-type-def type-id='da5acea4' size-in-bits='32' id='d1173c4e'/>
    <reference-type-def kind='lvalue' type-id='208677b8' size-in-bits='32' id='d1ae4dba'/>
    <pointer-type-def type-id='c70437bc' size-in-bits='32' id='d1d4fd6a'/>
    <function-type size-in-bits='32' id='d1ff2147'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='79c6b8a9' size-in-bits='32' id='d201ee29'/>
    <qualified-type-def type-id='a55d7682' const='yes' id='d2169ba1'/>
    <qualified-type-def type-id='2186eb60' const='yes' id='d2367b70'/>
    <pointer-type-def type-id='509d841e' size-in-bits='32' id='d2505f64'/>
    <function-type size-in-bits='32' id='d318157e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <return type-id='2c2f1adb'/>
    </function-type>
    <pointer-type-def type-id='8833c461' size-in-bits='32' id='d31f1c35'/>
    <typedef-decl name='JNIEnv' type-id='c9459134' id='d357872a'/>
    <pointer-type-def type-id='8570b09c' size-in-bits='32' id='d3651c96'/>
    <pointer-type-def type-id='1637cc88' size-in-bits='32' id='d369d34e'/>
    <pointer-type-def type-id='c2ee113a' size-in-bits='32' id='d3799368'/>
    <reference-type-def kind='lvalue' type-id='f02ffb9e' size-in-bits='32' id='d38942a8'/>
    <reference-type-def kind='lvalue' type-id='3623438e' size-in-bits='32' id='d3d274b0'/>
    <function-type size-in-bits='32' id='d413ac7e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='adf18958'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='9c8ba24a' const='yes' id='d42b1915'/>
    <pointer-type-def type-id='ae098004' size-in-bits='32' id='d42e47b2'/>
    <reference-type-def kind='lvalue' type-id='0f1d872f' size-in-bits='32' id='d47b932b'/>
    <function-type size-in-bits='32' id='d47c1022'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d47f2e6e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='cc6e09ca' size-in-bits='32' id='d4a328b7'/>
    <reference-type-def kind='lvalue' type-id='9fee0a37' size-in-bits='32' id='d4b9d8c3'/>
    <pointer-type-def type-id='aad38483' size-in-bits='32' id='d4f3c6d3'/>
    <pointer-type-def type-id='ea6782df' size-in-bits='32' id='d5032697'/>
    <pointer-type-def type-id='ca7c9639' size-in-bits='32' id='d5203fe9'/>
    <pointer-type-def type-id='2357f00f' size-in-bits='32' id='d523b107'/>
    <pointer-type-def type-id='968ef04b' size-in-bits='32' id='d5b0b547'/>
    <class-decl name='_JavaVM' is-struct='yes' visibility='default' is-declaration-only='yes' id='d607eddf'/>
    <qualified-type-def type-id='e4876de7' const='yes' id='d660ba77'/>
    <function-type size-in-bits='32' id='d664a6f7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <pointer-type-def type-id='70b02f6f' size-in-bits='32' id='d696f7b3'/>
    <pointer-type-def type-id='9bc42591' size-in-bits='32' id='d724a559'/>
    <pointer-type-def type-id='27c2393d' size-in-bits='32' id='d727a2fd'/>
    <pointer-type-def type-id='d6a92829' size-in-bits='32' id='d7305cb1'/>
    <reference-type-def kind='lvalue' type-id='85626193' size-in-bits='32' id='d7544b98'/>
    <pointer-type-def type-id='41301cf9' size-in-bits='32' id='d7560895'/>
    <function-type size-in-bits='32' id='d776b039'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='696ef1fd' size-in-bits='32' id='d79dcaad'/>
    <reference-type-def kind='lvalue' type-id='8af79632' size-in-bits='32' id='d7c1417c'/>
    <pointer-type-def type-id='9441d304' size-in-bits='32' id='d7ea3436'/>
    <reference-type-def kind='lvalue' type-id='2a9e3ce7' size-in-bits='32' id='d819a3d3'/>
    <pointer-type-def type-id='08f7445f' size-in-bits='32' id='d820ec07'/>
    <pointer-type-def type-id='1a7fe6b0' size-in-bits='32' id='d8263a65'/>
    <pointer-type-def type-id='7ba71958' size-in-bits='32' id='d82ed742'/>
    <qualified-type-def type-id='46767cd5' const='yes' id='d8498116'/>
    <qualified-type-def type-id='809f25c0' const='yes' id='d8a9e490'/>
    <reference-type-def kind='rvalue' type-id='21eadfd1' size-in-bits='32' id='d94162c1'/>
    <pointer-type-def type-id='c1aa2e6a' size-in-bits='32' id='d94406a8'/>
    <pointer-type-def type-id='56a51e98' size-in-bits='32' id='d97e839e'/>
    <class-decl name='_jmethodID' is-struct='yes' visibility='default' is-declaration-only='yes' id='d988e2e8'/>
    <reference-type-def kind='rvalue' type-id='6e81b4be' size-in-bits='32' id='d98e2482'/>
    <reference-type-def kind='lvalue' type-id='43a1e744' size-in-bits='32' id='d9df3f46'/>
    <reference-type-def kind='lvalue' type-id='79744773' size-in-bits='32' id='d9e886a7'/>
    <function-type size-in-bits='32' id='da11822e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='4c967707' const='yes' id='da25cb17'/>
    <function-type size-in-bits='32' id='da4ac88c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='aa210e95'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='e5a3737c' size-in-bits='32' id='da4e96ae'/>
    <function-type size-in-bits='32' id='da5acea4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='3ae07df8' size-in-bits='32' id='da5d5b9e'/>
    <reference-type-def kind='lvalue' type-id='aaf9e895' size-in-bits='32' id='da6951c9'/>
    <reference-type-def kind='lvalue' type-id='fe61024e' size-in-bits='32' id='dab6c9b8'/>
    <function-type size-in-bits='32' id='dad530df'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <pointer-type-def type-id='3eafa32f' size-in-bits='32' id='db28fdcb'/>
    <pointer-type-def type-id='807abec7' size-in-bits='32' id='db827c5f'/>
    <pointer-type-def type-id='a55d7682' size-in-bits='32' id='db864770'/>
    <qualified-type-def type-id='bf84559c' const='yes' id='db942487'/>
    <function-type size-in-bits='32' id='db9b93fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='9c8ba24a' size-in-bits='32' id='dbd0b004'/>
    <pointer-type-def type-id='72532fc9' size-in-bits='32' id='dbf46259'/>
    <reference-type-def kind='lvalue' type-id='115848a8' size-in-bits='32' id='dbfa378a'/>
    <function-type size-in-bits='32' id='dc0046e1'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0944aa01'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='dc0b1ac7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='feee141c'/>
    </function-type>
    <function-type size-in-bits='32' id='dc1ed48c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='9a10f134'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='46e02796' size-in-bits='32' id='dc7fd0c8'/>
    <pointer-type-def type-id='a54829f9' size-in-bits='32' id='dc8c77c1'/>
    <function-type size-in-bits='32' id='dcbb605e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='c894953d' size-in-bits='32' id='dce6b981'/>
    <pointer-type-def type-id='a114d670' size-in-bits='32' id='dd246876'/>
    <function-type size-in-bits='32' id='dd7295b3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='8a1a5b50' size-in-bits='32' id='dd7dfac2'/>
    <reference-type-def kind='lvalue' type-id='28aa8eff' size-in-bits='32' id='dd7edf9b'/>
    <pointer-type-def type-id='a87003ef' size-in-bits='32' id='dda33667'/>
    <function-type size-in-bits='32' id='ddabd76f'>
      <parameter type-id='8d2b5ece'/>
      <parameter type-id='8d2b5ece'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='e5e01142' size-in-bits='32' id='dddcefc4'/>
    <reference-type-def kind='lvalue' type-id='6aa51dda' size-in-bits='32' id='ddee33b4'/>
    <pointer-type-def type-id='3efa4404' size-in-bits='32' id='de55bd52'/>
    <pointer-type-def type-id='ae4964f6' size-in-bits='32' id='dea3ef0c'/>
    <pointer-type-def type-id='cf37be5f' size-in-bits='32' id='dee797c7'/>
    <reference-type-def kind='lvalue' type-id='551128d3' size-in-bits='32' id='df0379af'/>
    <pointer-type-def type-id='7321a4c8' size-in-bits='32' id='df0a845e'/>
    <qualified-type-def type-id='8d667f35' const='yes' id='df899665'/>
    <pointer-type-def type-id='126e53d0' size-in-bits='32' id='df8dc702'/>
    <pointer-type-def type-id='3623438e' size-in-bits='32' id='dfd28794'/>
    <qualified-type-def type-id='c2479237' const='yes' id='dfdbe536'/>
    <pointer-type-def type-id='76cc2f98' size-in-bits='32' id='e01e49fb'/>
    <pointer-type-def type-id='3d2d0c38' size-in-bits='32' id='e0227512'/>
    <pointer-type-def type-id='03a1b690' size-in-bits='32' id='e03598c6'/>
    <pointer-type-def type-id='23f80699' size-in-bits='32' id='e039fbf1'/>
    <reference-type-def kind='rvalue' type-id='5d9f8274' size-in-bits='32' id='e040fea8'/>
    <pointer-type-def type-id='14a5725b' size-in-bits='32' id='e096aafb'/>
    <pointer-type-def type-id='608cb2fe' size-in-bits='32' id='e0a9b199'/>
    <reference-type-def kind='lvalue' type-id='6c110ee4' size-in-bits='32' id='e0da3b66'/>
    <function-type size-in-bits='32' id='e0efb9de'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='aad38483' size-in-bits='32' id='e0f3d9b7'/>
    <reference-type-def kind='lvalue' type-id='49fc364f' size-in-bits='32' id='e1489074'/>
    <reference-type-def kind='lvalue' type-id='7525625e' size-in-bits='32' id='e1da02e8'/>
    <function-type size-in-bits='32' id='e1e0781a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='70de5c42'/>
    </function-type>
    <pointer-type-def type-id='af9f9143' size-in-bits='32' id='e1e34183'/>
    <function-type size-in-bits='32' id='e24417ff'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='3efa4404' size-in-bits='32' id='e255c39e'/>
    <qualified-type-def type-id='f8299b7f' const='yes' id='e26aec08'/>
    <reference-type-def kind='lvalue' type-id='ae4964f6' size-in-bits='32' id='e2a3f558'/>
    <reference-type-def kind='lvalue' type-id='a165d061' size-in-bits='32' id='e30f34d8'/>
    <pointer-type-def type-id='da11822e' size-in-bits='32' id='e333ff60'/>
    <typedef-decl name='ACameraWindowType' type-id='739fb858' id='e376d34c'/>
    <reference-type-def kind='lvalue' type-id='2e96e5aa' size-in-bits='32' id='e38b5b64'/>
    <pointer-type-def type-id='37981ab7' size-in-bits='32' id='e395fe2f'/>
    <qualified-type-def type-id='1428aabc' const='yes' id='e3c90ea7'/>
    <reference-type-def kind='lvalue' type-id='243d7df1' size-in-bits='32' id='e3cd1975'/>
    <function-type size-in-bits='32' id='e3e7515c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <pointer-type-def type-id='de051d86' size-in-bits='32' id='e3f7c2dc'/>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <reference-type-def kind='lvalue' type-id='991612c1' size-in-bits='32' id='e467c4c4'/>
    <reference-type-def kind='lvalue' type-id='f1088652' size-in-bits='32' id='e46ba89c'/>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='64' id='e46d7c38'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <pointer-type-def type-id='bebf8fb7' size-in-bits='32' id='e48f1427'/>
    <qualified-type-def type-id='fe002283' const='yes' id='e4984704'/>
    <pointer-type-def type-id='0306a627' size-in-bits='32' id='e498eccf'/>
    <pointer-type-def type-id='6e3cf71b' size-in-bits='32' id='e4b27ecf'/>
    <reference-type-def kind='lvalue' type-id='b737c55e' size-in-bits='32' id='e4cbdbe8'/>
    <pointer-type-def type-id='e2bfa0a2' size-in-bits='32' id='e4e736f0'/>
    <reference-type-def kind='lvalue' type-id='58e546d2' size-in-bits='32' id='e4eeb21c'/>
    <pointer-type-def type-id='38edd3d4' size-in-bits='32' id='e4f2ab66'/>
    <typedef-decl name='ACameraCaptureSession_captureCallback_result' type-id='a049f9b0' id='e5263ed0'/>
    <class-decl name='_jclass' visibility='default' is-declaration-only='yes' id='e53ab91c'/>
    <qualified-type-def type-id='07ec7282' const='yes' id='e54f5fd2'/>
    <qualified-type-def type-id='4da3c689' const='yes' id='e5a3737c'/>
    <pointer-type-def type-id='b3d5cbab' size-in-bits='32' id='e5a87447'/>
    <function-type size-in-bits='32' id='e5e01142'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <pointer-type-def type-id='7cca9422' size-in-bits='32' id='e60a2cfc'/>
    <function-type size-in-bits='32' id='e612672d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <pointer-type-def type-id='ae6a1c55' size-in-bits='32' id='e65fd0e5'/>
    <pointer-type-def type-id='0431c7ec' size-in-bits='32' id='e660caaa'/>
    <pointer-type-def type-id='3f1fbea7' size-in-bits='32' id='e680211f'/>
    <qualified-type-def type-id='2357f00f' const='yes' id='e69beb08'/>
    <class-decl name='ACameraMetadata' size-in-bits='544' is-struct='yes' visibility='default' id='e6cb9c9e'>
      <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' id='1e4df03e' is-anonymous='yes'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='ACM_CHARACTERISTICS' value='0'/>
          <enumerator name='ACM_REQUEST' value='1'/>
          <enumerator name='ACM_RESULT' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ACAMERA_METADATA_TYPE' type-id='1e4df03e' id='4e0366aa'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='mData' type-id='cd97f128' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='mTags' type-id='fe002283' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='mType' type-id='ea65511a' visibility='default'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sSystemTags' type-id='760319b5' mangled-name='_ZN15ACameraMetadata11sSystemTagsE' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='mStaticPhysicalCameraIds' type-id='af9f9143' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='mStaticPhysicalCameraIdValues' type-id='14a5725b' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACameraMetadata' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7abe72a4' is-artificial='yes'/>
          <parameter type-id='7aa62f3d'/>
          <parameter type-id='4e0366aa'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACameraMetadata' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7abe72a4' is-artificial='yes'/>
          <parameter type-id='f5965eff'/>
          <parameter type-id='4e0366aa'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='ACameraMetadata' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7abe72a4' is-artificial='yes'/>
          <parameter type-id='f3b1c1e1'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='0'>
        <function-decl name='~ACameraMetadata' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7abe72a4' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-type size-in-bits='32' id='e6efff49'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <qualified-type-def type-id='2e52cf5c' const='yes' id='e703acb5'/>
    <pointer-type-def type-id='5158b6d8' size-in-bits='32' id='e70be48e'/>
    <qualified-type-def type-id='dcd9dabc' const='yes' id='e721dd0c'/>
    <pointer-type-def type-id='866243bd' size-in-bits='32' id='e72df2ed'/>
    <reference-type-def kind='lvalue' type-id='97219ec5' size-in-bits='32' id='e738f724'/>
    <pointer-type-def type-id='4e7eaf04' size-in-bits='32' id='e747dee6'/>
    <reference-type-def kind='lvalue' type-id='a55d7682' size-in-bits='32' id='e7865a54'/>
    <reference-type-def kind='lvalue' type-id='72532fc9' size-in-bits='32' id='e7f4753d'/>
    <pointer-type-def type-id='3fe65779' size-in-bits='32' id='e7f5a651'/>
    <reference-type-def kind='lvalue' type-id='2401143d' size-in-bits='32' id='e801c199'/>
    <pointer-type-def type-id='757515fe' size-in-bits='32' id='e8139a80'/>
    <function-type size-in-bits='32' id='e81ac6f8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='8dfe2e06'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='jbooleanArray' type-id='715a5bad' id='e825b06b'/>
    <reference-type-def kind='lvalue' type-id='faf377fd' size-in-bits='32' id='e845adc1'/>
    <pointer-type-def type-id='08227eee' size-in-bits='32' id='e8583ae4'/>
    <pointer-type-def type-id='f76a9935' size-in-bits='32' id='e89f4e25'/>
    <qualified-type-def type-id='cf05fb5d' const='yes' id='e8bae7ed'/>
    <reference-type-def kind='rvalue' type-id='3ae07df8' size-in-bits='32' id='e8ed859c'/>
    <function-type size-in-bits='32' id='e8f54abb'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='c36bf49e'/>
    </function-type>
    <pointer-type-def type-id='e1e0781a' size-in-bits='32' id='e905d0ac'/>
    <qualified-type-def type-id='2401143d' const='yes' id='e90b7d78'/>
    <reference-type-def kind='lvalue' type-id='9c6e9081' size-in-bits='32' id='e90db6e5'/>
    <reference-type-def kind='lvalue' type-id='5e0b7a1d' size-in-bits='32' id='e9d1a7f9'/>
    <pointer-type-def type-id='39b8e88f' size-in-bits='32' id='ea278677'/>
    <qualified-type-def type-id='4e0366aa' const='yes' id='ea65511a'/>
    <qualified-type-def type-id='79c6b8a9' const='yes' id='ea66eda0'/>
    <pointer-type-def type-id='2ed24a7c' size-in-bits='32' id='ea7b7a1a'/>
    <pointer-type-def type-id='b01f64aa' size-in-bits='32' id='ea8867ec'/>
    <pointer-type-def type-id='c51a15f2' size-in-bits='32' id='ea9dd6f0'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <qualified-type-def type-id='5406357d' const='yes' id='eaca554d'/>
    <reference-type-def kind='lvalue' type-id='e9b0dd70' size-in-bits='32' id='eb0293a9'/>
    <pointer-type-def type-id='1cd86ccf' size-in-bits='32' id='eb164d0b'/>
    <reference-type-def kind='lvalue' type-id='a34554c3' size-in-bits='32' id='eb24a47f'/>
    <pointer-type-def type-id='38a7bde3' size-in-bits='32' id='eb2ab653'/>
    <reference-type-def kind='lvalue' type-id='fab67318' size-in-bits='32' id='eb376a9a'/>
    <function-type size-in-bits='32' id='eb796c24'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='d8263a65'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='43ffacc6' size-in-bits='32' id='eb7d24a0'/>
    <pointer-type-def type-id='ab4b368f' size-in-bits='32' id='eb96a877'/>
    <qualified-type-def type-id='00d599cc' const='yes' id='eb9fd26f'/>
    <pointer-type-def type-id='d4828e6f' size-in-bits='32' id='ebc4ebf7'/>
    <typedef-decl name='JavaVM' type-id='d607eddf' id='ebc81181'/>
    <function-type size-in-bits='32' id='ebc98183'>
      <parameter type-id='0052b394'/>
      <parameter type-id='0052b394'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='f64cf41b' size-in-bits='32' id='ec246923'/>
    <reference-type-def kind='lvalue' type-id='8df03b5d' size-in-bits='32' id='ec2da2a1'/>
    <function-type size-in-bits='32' id='ec89011e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='6f4c521b'/>
      <parameter type-id='efb1bb95'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='f76a9935' size-in-bits='32' id='ec9f5471'/>
    <pointer-type-def type-id='ddabd76f' size-in-bits='32' id='eca91b5b'/>
    <pointer-type-def type-id='88382077' size-in-bits='32' id='ecb820bf'/>
    <pointer-type-def type-id='ed5f0798' size-in-bits='32' id='ed0795aa'/>
    <function-type size-in-bits='32' id='ed3044e3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='ed5f0798'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='c3b520a9' size-in-bits='32' id='ed9692d4'/>
    <qualified-type-def type-id='4b5d8a96' const='yes' id='edbf6dd9'/>
    <function-type size-in-bits='32' id='ee0744fc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <qualified-type-def type-id='96ae8d47' const='yes' id='ee2227b4'/>
    <reference-type-def kind='rvalue' type-id='37981ab7' size-in-bits='32' id='ee28de67'/>
    <pointer-type-def type-id='2e67d715' size-in-bits='32' id='ee3187c5'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <reference-type-def kind='lvalue' type-id='a3326720' size-in-bits='32' id='ee582e72'/>
    <reference-type-def kind='lvalue' type-id='6b448be9' size-in-bits='32' id='ee9519f4'/>
    <qualified-type-def type-id='2aea98eb' const='yes' id='eeb7d5ba'/>
    <pointer-type-def type-id='ed970554' size-in-bits='32' id='eeba0e82'/>
    <reference-type-def kind='lvalue' type-id='906fbca9' size-in-bits='32' id='eee5d51d'/>
    <class-decl name='_jcharArray' visibility='default' is-declaration-only='yes' id='eeed1f5d'/>
    <reference-type-def kind='lvalue' type-id='c31acdea' size-in-bits='32' id='ef31f824'/>
    <function-type size-in-bits='32' id='ef48369b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='ef4ff6eb'>
      <parameter type-id='8d2b5ece'/>
      <parameter type-id='8d2b5ece'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='efa46d99'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='3b4676f4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='7e3c271d' size-in-bits='32' id='efb1bb95'/>
    <reference-type-def kind='lvalue' type-id='e54f5fd2' size-in-bits='32' id='eff40d1c'/>
    <reference-type-def kind='rvalue' type-id='21c31e25' size-in-bits='32' id='f02a1395'/>
    <qualified-type-def type-id='af9f9143' const='yes' id='f02ffb9e'/>
    <reference-type-def kind='lvalue' type-id='1d81be5b' size-in-bits='32' id='f03edec7'/>
    <reference-type-def kind='rvalue' type-id='735576a1' size-in-bits='32' id='f06ea031'/>
    <qualified-type-def type-id='9da381c4' const='yes' id='f07b7694'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <pointer-type-def type-id='21042e4a' size-in-bits='32' id='f0a0ff54'/>
    <pointer-type-def type-id='fafa91c1' size-in-bits='32' id='f0aa1618'/>
    <pointer-type-def type-id='03bdc89d' size-in-bits='32' id='f0c3772d'/>
    <reference-type-def kind='lvalue' type-id='e2bfa0a2' size-in-bits='32' id='f0e749d4'/>
    <reference-type-def kind='lvalue' type-id='500299ab' size-in-bits='32' id='f0f3daef'/>
    <qualified-type-def type-id='f401d47d' const='yes' id='f1088652'/>
    <qualified-type-def type-id='f740934f' const='yes' id='f117c1bf'/>
    <pointer-type-def type-id='6b6501bd' size-in-bits='32' id='f1191df9'/>
    <qualified-type-def type-id='8d05b19d' const='yes' id='f1215fad'/>
    <reference-type-def kind='lvalue' type-id='77ef0602' size-in-bits='32' id='f146aaac'/>
    <qualified-type-def type-id='ab4b368f' const='yes' id='f1c99104'/>
    <pointer-type-def type-id='abfeb1fe' size-in-bits='32' id='f2188c84'/>
    <qualified-type-def type-id='551a3c84' const='yes' id='f22a5c41'/>
    <reference-type-def kind='lvalue' type-id='11ab0d71' size-in-bits='32' id='f26b5964'/>
    <pointer-type-def type-id='ce8d1a45' size-in-bits='32' id='f26e9195'/>
    <reference-type-def kind='lvalue' type-id='987d77c3' size-in-bits='32' id='f283bd7f'/>
    <reference-type-def kind='lvalue' type-id='ed970554' size-in-bits='32' id='f2ba14ce'/>
    <typedef-decl name='ACameraCaptureSession_captureCallback_bufferLost' type-id='77f8e4d3' id='f2bba1dd'/>
    <pointer-type-def type-id='afbe3050' size-in-bits='32' id='f2dba506'/>
    <pointer-type-def type-id='be1e2082' size-in-bits='32' id='f2dd9440'/>
    <qualified-type-def type-id='8d01d01b' const='yes' id='f30500b4'/>
    <pointer-type-def type-id='d5605f7b' size-in-bits='32' id='f32fe5fb'/>
    <function-type size-in-bits='32' id='f341e414'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='96f3d089'/>
    </function-type>
    <qualified-type-def type-id='506429f5' const='yes' id='f3440ea5'/>
    <pointer-type-def type-id='a1390ee9' size-in-bits='32' id='f39f8bbd'/>
    <reference-type-def kind='lvalue' type-id='7e3c271d' size-in-bits='32' id='f3b1c1e1'/>
    <pointer-type-def type-id='484a53e3' size-in-bits='32' id='f3c27ac3'/>
    <pointer-type-def type-id='2401143d' size-in-bits='32' id='f401d47d'/>
    <reference-type-def kind='lvalue' type-id='c0d39641' size-in-bits='32' id='f415c425'/>
    <qualified-type-def type-id='b7323b50' const='yes' id='f4513120'/>
    <reference-type-def kind='lvalue' type-id='3bf60ab6' size-in-bits='32' id='f452a0b0'/>
    <reference-type-def kind='lvalue' type-id='5991d1d2' size-in-bits='32' id='f48d831c'/>
    <pointer-type-def type-id='3fa8e199' size-in-bits='32' id='f4bbad8d'/>
    <function-type size-in-bits='32' id='f4d3e94e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='5fbf0404' size-in-bits='32' id='f4e34078'/>
    <reference-type-def kind='lvalue' type-id='2ad232aa' size-in-bits='32' id='f4e59264'/>
    <pointer-type-def type-id='500299ab' size-in-bits='32' id='f4f3e13b'/>
    <function-type size-in-bits='32' id='f5043860'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='6292c81e'/>
    </function-type>
    <qualified-type-def type-id='a5bda984' const='yes' id='f5098ab4'/>
    <reference-type-def kind='rvalue' type-id='cd97f128' size-in-bits='32' id='f546899c'/>
    <qualified-type-def type-id='b05c3be5' const='yes' id='f552d3a8'/>
    <pointer-type-def type-id='c355496b' size-in-bits='32' id='f569444f'/>
    <reference-type-def kind='lvalue' type-id='51ab4043' size-in-bits='32' id='f5965eff'/>
    <pointer-type-def type-id='5e0b7a1d' size-in-bits='32' id='f5d1badd'/>
    <reference-type-def kind='lvalue' type-id='3e4ed4c6' size-in-bits='32' id='f6191ca0'/>
    <qualified-type-def type-id='b7b5d51d' const='yes' id='f62c522d'/>
    <pointer-type-def type-id='782c08bc' size-in-bits='32' id='f641b9da'/>
    <qualified-type-def type-id='9747f738' const='yes' id='f64cf41b'/>
    <reference-type-def kind='lvalue' type-id='743de5df' size-in-bits='32' id='f67106fb'/>
    <function-type size-in-bits='32' id='f6de0a0a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <typedef-decl name='ACameraManager_PhysicalCameraAvailabilityCallback' type-id='e60a2cfc' id='f708caaa'/>
    <reference-type-def kind='lvalue' type-id='38a7bde3' size-in-bits='32' id='f72ac937'/>
    <pointer-type-def type-id='a6798dcc' size-in-bits='32' id='f75a6112'/>
    <reference-type-def kind='lvalue' type-id='0cebea86' size-in-bits='32' id='f76259e0'/>
    <qualified-type-def type-id='5517258b' const='yes' id='f79d815b'/>
    <reference-type-def kind='lvalue' type-id='1317e1fb' size-in-bits='32' id='f7deefaf'/>
    <pointer-type-def type-id='533df676' size-in-bits='32' id='f7e564c8'/>
    <reference-type-def kind='rvalue' type-id='40660a2d' size-in-bits='32' id='f7f0c84d'/>
    <qualified-type-def type-id='79744773' const='yes' id='f7fad164'/>
    <reference-type-def kind='rvalue' type-id='f56bc8f9' size-in-bits='32' id='f806aae9'/>
    <qualified-type-def type-id='6cb62dc6' const='yes' id='f8193ff5'/>
    <reference-type-def kind='lvalue' type-id='f64cf41b' size-in-bits='32' id='f8247c07'/>
    <pointer-type-def type-id='a3847f1a' size-in-bits='32' id='f8369cf8'/>
    <pointer-type-def type-id='6e3f46eb' size-in-bits='32' id='f8651eeb'/>
    <pointer-type-def type-id='1f8f9f18' size-in-bits='32' id='f8af7982'/>
    <pointer-type-def type-id='4409a3d3' size-in-bits='32' id='f90ab343'/>
    <qualified-type-def type-id='d011aefa' const='yes' id='f935ea55'/>
    <pointer-type-def type-id='6e84a657' size-in-bits='32' id='f941bc4f'/>
    <reference-type-def kind='lvalue' type-id='9747f738' size-in-bits='32' id='fa60fc02'/>
    <qualified-type-def type-id='db4fe188' const='yes' id='fab67318'/>
    <pointer-type-def type-id='d357872a' size-in-bits='32' id='fae49a1f'/>
    <qualified-type-def type-id='c26e7a6d' const='yes' id='faf377fd'/>
    <typedef-decl name='ACameraIdList' type-id='7dd51c1a' id='fafa91c1'/>
    <pointer-type-def type-id='76a49d1c' size-in-bits='32' id='fb237c02'/>
    <reference-type-def kind='lvalue' type-id='98cfc42a' size-in-bits='32' id='fb30b83c'/>
    <pointer-type-def type-id='4dd30b7b' size-in-bits='32' id='fb38167f'/>
    <function-type size-in-bits='32' id='fb38e8e0'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='82303925'/>
      <parameter type-id='6f4c521b'/>
      <parameter type-id='e01e49fb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <class-decl name='_jlongArray' visibility='default' is-declaration-only='yes' id='fb46a283'/>
    <reference-type-def kind='lvalue' type-id='2f65eb78' size-in-bits='32' id='fb7184fa'/>
    <pointer-type-def type-id='cb425c26' size-in-bits='32' id='fb79cfe8'/>
    <function-type size-in-bits='32' id='fba5b0d7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <pointer-type-def type-id='1317e1fb' size-in-bits='32' id='fbdef5fb'/>
    <typedef-decl name='ACameraManager_AvailabilityCallback' type-id='8102f025' id='fbf2ccf4'/>
    <pointer-type-def type-id='58bb0dac' size-in-bits='32' id='fc13723a'/>
    <typedef-decl name='ptrdiff_t' type-id='95e97e5e' id='fc84bffe'/>
    <function-type size-in-bits='32' id='fcac2709'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='38f21f8c' size-in-bits='32' id='fce18146'/>
    <pointer-type-def type-id='6f160e3a' size-in-bits='32' id='fce8e074'/>
    <reference-type-def kind='lvalue' type-id='3ddd2dbc' size-in-bits='32' id='fd2ec96e'/>
    <pointer-type-def type-id='5d9f8274' size-in-bits='32' id='fd5ec952'/>
    <pointer-type-def type-id='2328d49c' size-in-bits='32' id='fd7aecba'/>
    <reference-type-def kind='lvalue' type-id='56cc4c7c' size-in-bits='32' id='fd9c31ae'/>
    <function-type size-in-bits='32' id='fda39aa9'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <reference-type-def kind='lvalue' type-id='e4984704' size-in-bits='32' id='fdb7fa86'/>
    <reference-type-def kind='lvalue' type-id='14ba0a7b' size-in-bits='32' id='fdde5067'/>
    <pointer-type-def type-id='c2cfffb6' size-in-bits='32' id='fde38e1c'/>
    <reference-type-def kind='lvalue' type-id='d02d960f' size-in-bits='32' id='fdf2ef42'/>
    <class-decl name='_jobjectArray' visibility='default' is-declaration-only='yes' id='fdf9f098'/>
    <pointer-type-def type-id='92904d32' size-in-bits='32' id='fe16b3d0'/>
    <function-type size-in-bits='32' id='fe213acd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <qualified-type-def type-id='25f1213f' const='yes' id='fe2abd8f'/>
    <pointer-type-def type-id='8fc0fb3e' size-in-bits='32' id='fe5558a4'/>
    <pointer-type-def type-id='9747f738' size-in-bits='32' id='fe61024e'/>
    <function-type size-in-bits='32' id='fea2690f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='1f3810cb'/>
    </function-type>
    <reference-type-def kind='rvalue' type-id='a098fd0c' size-in-bits='32' id='fec2d4b0'/>
    <typedef-decl name='jdoubleArray' type-id='76b5a6a0' id='feee141c'/>
    <pointer-type-def type-id='98cfc42a' size-in-bits='32' id='ff30be88'/>
    <pointer-type-def type-id='96fb4d64' size-in-bits='32' id='ff535cb6'/>
    <pointer-type-def type-id='21eadfd1' size-in-bits='32' id='ff6dfc19'/>
    <reference-type-def kind='lvalue' type-id='77ccf34e' size-in-bits='32' id='ffa32cb8'/>
    <qualified-type-def type-id='789b3273' const='yes' id='fff6e2e6'/>
    <function-decl name='ACameraCaptureSession_abortCaptures' mangled-name='ACameraCaptureSession_abortCaptures' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_abortCaptures@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_capture' mangled-name='ACameraCaptureSession_capture' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_capture@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <parameter type-id='45fa91ba' name='cbs'/>
      <parameter type-id='95e97e5e' name='numRequests'/>
      <parameter type-id='66256323' name='requests'/>
      <parameter type-id='7292109c' name='captureSequenceId'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_close' mangled-name='ACameraCaptureSession_close' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_close@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_getDevice' mangled-name='ACameraCaptureSession_getDevice' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_getDevice@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <parameter type-id='c217e1b1' name='device'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_logicalCamera_capture' mangled-name='ACameraCaptureSession_logicalCamera_capture' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_logicalCamera_capture@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <parameter type-id='0aae1fa1' name='lcbs'/>
      <parameter type-id='95e97e5e' name='numRequests'/>
      <parameter type-id='66256323' name='requests'/>
      <parameter type-id='7292109c' name='captureSequenceId'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_logicalCamera_setRepeatingRequest' mangled-name='ACameraCaptureSession_logicalCamera_setRepeatingRequest' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_logicalCamera_setRepeatingRequest@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <parameter type-id='0aae1fa1' name='lcbs'/>
      <parameter type-id='95e97e5e' name='numRequests'/>
      <parameter type-id='66256323' name='requests'/>
      <parameter type-id='7292109c' name='captureSequenceId'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_setRepeatingRequest' mangled-name='ACameraCaptureSession_setRepeatingRequest' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_setRepeatingRequest@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <parameter type-id='45fa91ba' name='cbs'/>
      <parameter type-id='95e97e5e' name='numRequests'/>
      <parameter type-id='66256323' name='requests'/>
      <parameter type-id='7292109c' name='captureSequenceId'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_stopRepeating' mangled-name='ACameraCaptureSession_stopRepeating' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_stopRepeating@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraCaptureSession_updateSharedOutput' mangled-name='ACameraCaptureSession_updateSharedOutput' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraCaptureSession_updateSharedOutput@@LIBCAMERA2NDK'>
      <parameter type-id='82303925' name='session'/>
      <parameter type-id='c2e7c99b' name='output'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraDevice_close' mangled-name='ACameraDevice_close' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraDevice_close@@LIBCAMERA2NDK'>
      <parameter type-id='0944aa01' name='device'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraDevice_createCaptureRequest' mangled-name='ACameraDevice_createCaptureRequest' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraDevice_createCaptureRequest@@LIBCAMERA2NDK'>
      <parameter type-id='2876ff98' name='device'/>
      <parameter type-id='77d413bb' name='templateId'/>
      <parameter type-id='66256323' name='request'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraDevice_createCaptureRequest_withPhysicalIds' mangled-name='ACameraDevice_createCaptureRequest_withPhysicalIds' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraDevice_createCaptureRequest_withPhysicalIds@@LIBCAMERA2NDK'>
      <parameter type-id='2876ff98' name='device'/>
      <parameter type-id='77d413bb' name='templateId'/>
      <parameter type-id='86560521' name='physicalCameraIdList'/>
      <parameter type-id='66256323' name='request'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraDevice_createCaptureSession' mangled-name='ACameraDevice_createCaptureSession' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraDevice_createCaptureSession@@LIBCAMERA2NDK'>
      <parameter type-id='0944aa01' name='device'/>
      <parameter type-id='a67ef107' name='outputs'/>
      <parameter type-id='5c0536ba' name='callbacks'/>
      <parameter type-id='00e9d29d' name='session'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraDevice_createCaptureSessionWithSessionParameters' mangled-name='ACameraDevice_createCaptureSessionWithSessionParameters' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraDevice_createCaptureSessionWithSessionParameters@@LIBCAMERA2NDK'>
      <parameter type-id='0944aa01' name='device'/>
      <parameter type-id='a67ef107' name='outputs'/>
      <parameter type-id='45c42eae' name='sessionParameters'/>
      <parameter type-id='5c0536ba' name='callbacks'/>
      <parameter type-id='00e9d29d' name='session'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraDevice_getId' mangled-name='ACameraDevice_getId' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraDevice_getId@@LIBCAMERA2NDK'>
      <parameter type-id='2876ff98' name='device'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='ACameraDevice_isSessionConfigurationSupported' mangled-name='ACameraDevice_isSessionConfigurationSupported' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraDevice_isSessionConfigurationSupported@@LIBCAMERA2NDK'>
      <parameter type-id='2876ff98' name='device'/>
      <parameter type-id='a67ef107' name='sessionOutputContainer'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraManager_create' mangled-name='ACameraManager_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_create@@LIBCAMERA2NDK'>
      <return type-id='ea9dd6f0'/>
    </function-decl>
    <function-decl name='ACameraManager_delete' mangled-name='ACameraManager_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_delete@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0' name='manager'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACameraManager_deleteCameraIdList' mangled-name='ACameraManager_deleteCameraIdList' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_deleteCameraIdList@@LIBCAMERA2NDK'>
      <parameter type-id='f0aa1618' name='cameraIdList'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACameraManager_getCameraCharacteristics' mangled-name='ACameraManager_getCameraCharacteristics' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_getCameraCharacteristics@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0' name='mgr'/>
      <parameter type-id='80f4b756' name='cameraId'/>
      <parameter type-id='c7ce558a' name='chars'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraManager_getCameraIdList' mangled-name='ACameraManager_getCameraIdList' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_getCameraIdList@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0' name='manager'/>
      <parameter type-id='0dc0f0b6' name='cameraIdList'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraManager_openCamera' mangled-name='ACameraManager_openCamera' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_openCamera@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0' name='mgr'/>
      <parameter type-id='80f4b756' name='cameraId'/>
      <parameter type-id='987fd631' name='callback'/>
      <parameter type-id='c217e1b1' name='device'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraManager_registerAvailabilityCallback' mangled-name='ACameraManager_registerAvailabilityCallback' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_registerAvailabilityCallback@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0'/>
      <parameter type-id='6e0c55cd' name='callback'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraManager_registerExtendedAvailabilityCallback' mangled-name='ACameraManager_registerExtendedAvailabilityCallback' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_registerExtendedAvailabilityCallback@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0'/>
      <parameter type-id='a3acd8e0' name='callback'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraManager_unregisterAvailabilityCallback' mangled-name='ACameraManager_unregisterAvailabilityCallback' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_unregisterAvailabilityCallback@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0'/>
      <parameter type-id='6e0c55cd' name='callback'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraManager_unregisterExtendedAvailabilityCallback' mangled-name='ACameraManager_unregisterExtendedAvailabilityCallback' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraManager_unregisterExtendedAvailabilityCallback@@LIBCAMERA2NDK'>
      <parameter type-id='ea9dd6f0'/>
      <parameter type-id='a3acd8e0' name='callback'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraMetadata_copy' mangled-name='ACameraMetadata_copy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraMetadata_copy@@LIBCAMERA2NDK'>
      <parameter type-id='efb1bb95' name='src'/>
      <return type-id='7abe72a4'/>
    </function-decl>
    <function-decl name='ACameraMetadata_free' mangled-name='ACameraMetadata_free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraMetadata_free@@LIBCAMERA2NDK'>
      <parameter type-id='7abe72a4' name='metadata'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACameraMetadata_fromCameraMetadata' mangled-name='ACameraMetadata_fromCameraMetadata' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraMetadata_fromCameraMetadata@@LIBCAMERA2NDK'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='cameraMetadata'/>
      <return type-id='7abe72a4'/>
    </function-decl>
    <function-decl name='ACameraMetadata_getAllTags' mangled-name='ACameraMetadata_getAllTags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraMetadata_getAllTags@@LIBCAMERA2NDK'>
      <parameter type-id='efb1bb95' name='acm'/>
      <parameter type-id='4aafb922' name='numTags'/>
      <parameter type-id='f75a6112' name='tags'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraMetadata_getConstEntry' mangled-name='ACameraMetadata_getConstEntry' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraMetadata_getConstEntry@@LIBCAMERA2NDK'>
      <parameter type-id='efb1bb95' name='acm'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='4183b90d' name='entry'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraMetadata_isLogicalMultiCamera' mangled-name='ACameraMetadata_isLogicalMultiCamera' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraMetadata_isLogicalMultiCamera@@LIBCAMERA2NDK'>
      <parameter type-id='efb1bb95' name='staticMetadata'/>
      <parameter type-id='78c01427' name='numPhysicalCameras'/>
      <parameter type-id='472eb409' name='physicalCameraIds'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='ACameraOutputTarget_create' mangled-name='ACameraOutputTarget_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraOutputTarget_create@@LIBCAMERA2NDK'>
      <parameter type-id='2d8486a3' name='window'/>
      <parameter type-id='b42fe9d7' name='out'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACameraOutputTarget_free' mangled-name='ACameraOutputTarget_free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACameraOutputTarget_free@@LIBCAMERA2NDK'>
      <parameter type-id='d523b107' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACaptureRequest_addTarget' mangled-name='ACaptureRequest_addTarget' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_addTarget@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='29732686' name='target'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_copy' mangled-name='ACaptureRequest_copy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_copy@@LIBCAMERA2NDK'>
      <parameter type-id='45c42eae' name='src'/>
      <return type-id='6f4c521b'/>
    </function-decl>
    <function-decl name='ACaptureRequest_free' mangled-name='ACaptureRequest_free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_free@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='request'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACaptureRequest_getAllTags' mangled-name='ACaptureRequest_getAllTags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_getAllTags@@LIBCAMERA2NDK'>
      <parameter type-id='45c42eae' name='req'/>
      <parameter type-id='4aafb922' name='numTags'/>
      <parameter type-id='f75a6112' name='tags'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_getConstEntry' mangled-name='ACaptureRequest_getConstEntry' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_getConstEntry@@LIBCAMERA2NDK'>
      <parameter type-id='45c42eae' name='req'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='4183b90d' name='entry'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_getConstEntry_physicalCamera' mangled-name='ACaptureRequest_getConstEntry_physicalCamera' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_getConstEntry_physicalCamera@@LIBCAMERA2NDK'>
      <parameter type-id='45c42eae' name='req'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='4183b90d' name='entry'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_getUserContext' mangled-name='ACaptureRequest_getUserContext' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_getUserContext@@LIBCAMERA2NDK'>
      <parameter type-id='45c42eae' name='request'/>
      <parameter type-id='63e171df' name='context'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_removeTarget' mangled-name='ACaptureRequest_removeTarget' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_removeTarget@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='29732686' name='target'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_double' mangled-name='ACaptureRequest_setEntry_double' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_double@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='a6370261' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_float' mangled-name='ACaptureRequest_setEntry_float' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_float@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='bc47ccdc' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_i32' mangled-name='ACaptureRequest_setEntry_i32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_i32@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='1f526493' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_i64' mangled-name='ACaptureRequest_setEntry_i64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_i64@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='505bed1a' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_physicalCamera_double' mangled-name='ACaptureRequest_setEntry_physicalCamera_double' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_physicalCamera_double@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='a6370261' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_physicalCamera_float' mangled-name='ACaptureRequest_setEntry_physicalCamera_float' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_physicalCamera_float@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='bc47ccdc' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_physicalCamera_i32' mangled-name='ACaptureRequest_setEntry_physicalCamera_i32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_physicalCamera_i32@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='1f526493' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_physicalCamera_i64' mangled-name='ACaptureRequest_setEntry_physicalCamera_i64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_physicalCamera_i64@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='505bed1a' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_physicalCamera_rational' mangled-name='ACaptureRequest_setEntry_physicalCamera_rational' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_physicalCamera_rational@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='fb237c02' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_physicalCamera_u8' mangled-name='ACaptureRequest_setEntry_physicalCamera_u8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_physicalCamera_u8@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='9f7200cf' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_rational' mangled-name='ACaptureRequest_setEntry_rational' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_rational@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='fb237c02' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setEntry_u8' mangled-name='ACaptureRequest_setEntry_u8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setEntry_u8@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='req'/>
      <parameter type-id='8f92235e' name='tag'/>
      <parameter type-id='8f92235e' name='count'/>
      <parameter type-id='9f7200cf' name='data'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureRequest_setUserContext' mangled-name='ACaptureRequest_setUserContext' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureRequest_setUserContext@@LIBCAMERA2NDK'>
      <parameter type-id='6f4c521b' name='request'/>
      <parameter type-id='eaa32e2f' name='context'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionOutputContainer_add' mangled-name='ACaptureSessionOutputContainer_add' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionOutputContainer_add@@LIBCAMERA2NDK'>
      <parameter type-id='014ee4dc' name='container'/>
      <parameter type-id='2b2ec5ce' name='output'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionOutputContainer_create' mangled-name='ACaptureSessionOutputContainer_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionOutputContainer_create@@LIBCAMERA2NDK'>
      <parameter type-id='05326f42' name='out'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionOutputContainer_free' mangled-name='ACaptureSessionOutputContainer_free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionOutputContainer_free@@LIBCAMERA2NDK'>
      <parameter type-id='014ee4dc' name='container'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACaptureSessionOutputContainer_remove' mangled-name='ACaptureSessionOutputContainer_remove' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionOutputContainer_remove@@LIBCAMERA2NDK'>
      <parameter type-id='014ee4dc' name='container'/>
      <parameter type-id='2b2ec5ce' name='output'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionOutput_create' mangled-name='ACaptureSessionOutput_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionOutput_create@@LIBCAMERA2NDK'>
      <parameter type-id='2d8486a3' name='window'/>
      <parameter type-id='83e281a3' name='out'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionOutput_free' mangled-name='ACaptureSessionOutput_free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionOutput_free@@LIBCAMERA2NDK'>
      <parameter type-id='c2e7c99b' name='output'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ACaptureSessionPhysicalOutput_create' mangled-name='ACaptureSessionPhysicalOutput_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionPhysicalOutput_create@@LIBCAMERA2NDK'>
      <parameter type-id='2d8486a3' name='window'/>
      <parameter type-id='80f4b756' name='physicalId'/>
      <parameter type-id='83e281a3' name='out'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionSharedOutput_add' mangled-name='ACaptureSessionSharedOutput_add' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionSharedOutput_add@@LIBCAMERA2NDK'>
      <parameter type-id='c2e7c99b' name='out'/>
      <parameter type-id='2d8486a3' name='window'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionSharedOutput_create' mangled-name='ACaptureSessionSharedOutput_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionSharedOutput_create@@LIBCAMERA2NDK'>
      <parameter type-id='2d8486a3' name='window'/>
      <parameter type-id='83e281a3' name='out'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <function-decl name='ACaptureSessionSharedOutput_remove' mangled-name='ACaptureSessionSharedOutput_remove' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ACaptureSessionSharedOutput_remove@@LIBCAMERA2NDK'>
      <parameter type-id='c2e7c99b' name='out'/>
      <parameter type-id='2d8486a3' name='window'/>
      <return type-id='4e73a1ad'/>
    </function-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;android::acam::CameraManagerGlobal&gt;' size-in-bits='32' visibility='default' id='0306a627'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='5d3f91fb' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e498eccf' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e498eccf' is-artificial='yes'/>
            <parameter type-id='5d3f91fb'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e498eccf' is-artificial='yes'/>
            <parameter type-id='1428a7f2'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e498eccf' is-artificial='yes'/>
            <parameter type-id='65c6e907'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e498eccf' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='CaptureRequest' size-in-bits='768' is-struct='yes' visibility='default' id='05fd149f'>
        <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
        <base-class access='public' layout-offset-in-bits='64' type-id='ea2cfdf4'/>
      </class-decl>
      <class-decl name='KeyedVector&lt;unsigned int, unsigned int&gt;' size-in-bits='160' visibility='default' id='07da9dcb'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mVector' type-id='ae098004' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='KeyedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c10e4dfb' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='RefBase' visibility='default' is-declaration-only='yes' id='12f619c0'>
        <member-type access='public'>
          <class-decl name='weakref_type' size-in-bits='8' visibility='default' id='114d3ce2'/>
        </member-type>
      </class-decl>
      <class-decl name='sp&lt;ACameraCaptureSession&gt;' size-in-bits='32' visibility='default' id='23f80699'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='82303925' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e039fbf1' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e039fbf1' is-artificial='yes'/>
            <parameter type-id='82303925'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e039fbf1' is-artificial='yes'/>
            <parameter type-id='892b5882'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e039fbf1' is-artificial='yes'/>
            <parameter type-id='323d7d39'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e039fbf1' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::acam::CameraDevice&gt;' size-in-bits='32' visibility='default' id='37981ab7'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='25dbb38b' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e395fe2f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e395fe2f' is-artificial='yes'/>
            <parameter type-id='25dbb38b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e395fe2f' is-artificial='yes'/>
            <parameter type-id='f146aaac'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e395fe2f' is-artificial='yes'/>
            <parameter type-id='ee28de67'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e395fe2f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;ACameraMetadata&gt;' size-in-bits='32' visibility='default' id='3ae07df8'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='7abe72a4' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='da5d5b9e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='da5d5b9e' is-artificial='yes'/>
            <parameter type-id='7abe72a4'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='da5d5b9e' is-artificial='yes'/>
            <parameter type-id='48c942dd'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='da5d5b9e' is-artificial='yes'/>
            <parameter type-id='e8ed859c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='da5d5b9e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Mutex' size-in-bits='32' visibility='default' id='406f4753'>
        <member-type access='public'>
          <class-decl name='Autolock' size-in-bits='32' visibility='default' id='fd376fcf'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mLock' type-id='665e3247' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='665e3247'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='5a5e1f63'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='e38b5b64'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mMutex' type-id='7a6844eb' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='43c128f8'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::acam::CameraManagerGlobal::CameraServiceListener&gt;' size-in-bits='32' visibility='default' id='42d681db'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='af1731c7' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a2db10bb' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a2db10bb' is-artificial='yes'/>
            <parameter type-id='af1731c7'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a2db10bb' is-artificial='yes'/>
            <parameter type-id='15c08dec'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a2db10bb' is-artificial='yes'/>
            <parameter type-id='5bd130eb'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a2db10bb' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='wp&lt;android::acam::CameraManagerGlobal&gt;' size-in-bits='64' visibility='default' id='484a53e3'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='5d3f91fb' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='m_refs' type-id='7613b793' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f3c27ac3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f3c27ac3' is-artificial='yes'/>
            <parameter type-id='5d3f91fb'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f3c27ac3' is-artificial='yes'/>
            <parameter type-id='af25e89e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f3c27ac3' is-artificial='yes'/>
            <parameter type-id='1428a7f2'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f3c27ac3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='wp&lt;android::ALooper&gt;' size-in-bits='64' visibility='default' id='4d159548'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='a1abad78' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='m_refs' type-id='7613b793' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9bca647e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
