<abi-corpus version='2.1' architecture='elf-arm' soname='liblog.so'>
  <elf-needed>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='__android_log_assert' version='LIBLOG' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_buf_print' version='LIBLOG' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_buf_write' version='LIBLOG' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_call_aborter' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_default_aborter' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_get_minimum_priority' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_is_loggable' version='LIBLOG_M' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_is_loggable_len' version='LIBLOG_O' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_logd_logger' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_print' version='LIBLOG' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_set_aborter' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_set_default_tag' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_set_logger' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_set_minimum_priority' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_stderr_logger' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_vprint' version='LIBLOG' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_write' version='LIBLOG' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__android_log_write_log_message' version='LIBLOG_R' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <pointer-type-def type-id='fa2acc2f' size-in-bits='32' id='17997347'/>
    <pointer-type-def type-id='b77bdc37' size-in-bits='32' id='2363ae2b'/>
    <typedef-decl name='va_list' type-id='7f896fb4' id='2aee9912'/>
    <qualified-type-def type-id='fa2acc2f' const='yes' id='2ebc2b84'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <pointer-type-def type-id='2ebc2b84' size-in-bits='32' id='4038c2ea'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' id='7f896fb4'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <function-type size-in-bits='32' id='8649ba07'>
      <parameter type-id='4038c2ea' name='log_message'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <typedef-decl name='__android_logger_function' type-id='fd35dbeb' id='99bd9e83'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <function-type size-in-bits='32' id='b77bdc37'>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <class-decl name='__android_log_message' size-in-bits='224' is-struct='yes' visibility='default' id='fa2acc2f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='struct_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='buffer_id' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='priority' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tag' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='file' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='line' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='message' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='8649ba07' size-in-bits='32' id='fd35dbeb'/>
    <typedef-decl name='__android_aborter_function' type-id='2363ae2b' id='ff64b67c'/>
    <function-decl name='__android_log_assert' mangled-name='__android_log_assert' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_assert@@LIBLOG'>
      <parameter type-id='80f4b756' name='cond'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_buf_print' mangled-name='__android_log_buf_print' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_buf_print@@LIBLOG'>
      <parameter type-id='95e97e5e' name='bufID'/>
      <parameter type-id='95e97e5e' name='prio'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__android_log_buf_write' mangled-name='__android_log_buf_write' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_buf_write@@LIBLOG'>
      <parameter type-id='95e97e5e' name='bufID'/>
      <parameter type-id='95e97e5e' name='prio'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='80f4b756' name='msg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__android_log_call_aborter' mangled-name='__android_log_call_aborter' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_call_aborter@@LIBLOG_R'>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_default_aborter' mangled-name='__android_log_default_aborter' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_default_aborter@@LIBLOG_R'>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_get_minimum_priority' mangled-name='__android_log_get_minimum_priority' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_get_minimum_priority@@LIBLOG_R'>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='__android_log_is_loggable' mangled-name='__android_log_is_loggable' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_is_loggable@@LIBLOG_M'>
      <parameter type-id='95e97e5e' name='prio'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='95e97e5e' name='default_prio'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__android_log_is_loggable_len' mangled-name='__android_log_is_loggable_len' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_is_loggable_len@@LIBLOG_O'>
      <parameter type-id='95e97e5e' name='prio'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='95e97e5e' name='default_prio'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__android_log_logd_logger' mangled-name='__android_log_logd_logger' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_logd_logger@@LIBLOG_R'>
      <parameter type-id='4038c2ea' name='log_message'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_print' mangled-name='__android_log_print' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_print@@LIBLOG'>
      <parameter type-id='95e97e5e' name='prio'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__android_log_set_aborter' mangled-name='__android_log_set_aborter' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_set_aborter@@LIBLOG_R'>
      <parameter type-id='ff64b67c' name='aborter'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_set_default_tag' mangled-name='__android_log_set_default_tag' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_set_default_tag@@LIBLOG_R'>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_set_logger' mangled-name='__android_log_set_logger' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_set_logger@@LIBLOG_R'>
      <parameter type-id='99bd9e83' name='logger'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_set_minimum_priority' mangled-name='__android_log_set_minimum_priority' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_set_minimum_priority@@LIBLOG_R'>
      <parameter type-id='3ff5601b' name='priority'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='__android_log_stderr_logger' mangled-name='__android_log_stderr_logger' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_stderr_logger@@LIBLOG_R'>
      <parameter type-id='4038c2ea' name='log_message'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__android_log_vprint' mangled-name='__android_log_vprint' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_vprint@@LIBLOG'>
      <parameter type-id='95e97e5e' name='prio'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter type-id='2aee9912' name='ap'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__android_log_write' mangled-name='__android_log_write' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_write@@LIBLOG'>
      <parameter type-id='95e97e5e' name='prio'/>
      <parameter type-id='80f4b756' name='tag'/>
      <parameter type-id='80f4b756' name='msg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__android_log_write_log_message' mangled-name='__android_log_write_log_message' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__android_log_write_log_message@@LIBLOG_R'>
      <parameter type-id='17997347' name='log_message'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <namespace-decl name='std'>
      <class-decl name='__va_list' size-in-bits='32' is-struct='yes' visibility='default' id='30357e0a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='__ap' type-id='eaa32e2f' visibility='default'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
</abi-corpus>
