<abi-corpus version='2.1' architecture='elf-arm' soname='libc.so'>
  <elf-needed>
    <dependency name='ld-android.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='__aeabi_atexit' version='LIBC_N' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__aeabi_atexit' version='LIBC_PRIVATE' is-default-version='no' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__aeabi_memclr4' version='LIBC_N' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__aeabi_memclr4' version='LIBC_PRIVATE' is-default-version='no' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__aeabi_memclr8' version='LIBC_N' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__aeabi_memclr8' version='LIBC_PRIVATE' is-default-version='no' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__aeabi_memclr' version='LIBC_N' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='wcswidth' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcsxfrm' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wctob' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wctype' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcwidth' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wmemchr' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wmemcmp' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wmemcpy' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wmemmove' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wmemset' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wprintf' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='write' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='writev' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wscanf' version='LIBC' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='__isthreaded' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__p_class_syms' size='96' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__p_type_syms' size='828' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__progname' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__sF' size='252' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__stack_chk_guard' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ctype_' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_tolower_tab_' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_toupper_tab_' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='daylight' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='environ' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='optarg' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='opterr' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='optind' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='optopt' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='optreset' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_siglist' size='260' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_signame' size='260' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='timezone' size='4' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tzname' size='8' version='LIBC' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='32' language='various' path='various'>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' visibility='default' id='0009dfd8' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='stack_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stack_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='guard_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sched_policy' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sched_priority' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <pointer-type-def type-id='458596b8' size-in-bits='32' id='00ae9cee'/>
    <class-decl name='group' size-in-bits='128' is-struct='yes' visibility='default' id='01a1b934'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gr_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='gr_passwd' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gr_gid' type-id='2bb2b96f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='gr_mem' type-id='9b23c9ad' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='323d93c1' size-in-bits='32' id='01efdaf1'/>
    <pointer-type-def type-id='4088d420' size-in-bits='32' id='020609db'/>
    <qualified-type-def type-id='a68021ce' restrict='yes' id='03aaab72'/>
    <function-type size-in-bits='32' id='050f23f3'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <typedef-decl name='res_state' type-id='62fb0009' id='05232410'/>
    <typedef-decl name='off64_t' type-id='69bf7bee' id='05d4c620'/>
    <typedef-decl name='id_t' type-id='52c7754c' id='05d99cca'/>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='224' id='0626c76e'>
      <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
    </array-type-def>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' id='0897719a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__clockid_t' type-id='7eb128d4' id='08f9a87a'/>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='32' id='09001d3c'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='24' id='09025bd3'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <pointer-type-def type-id='61e7b2c0' size-in-bits='32' id='09bea65e'/>
    <pointer-type-def type-id='b5618eb0' size-in-bits='32' id='09cddb43'/>
    <pointer-type-def type-id='5919631f' size-in-bits='32' id='09fdfd4b'/>
    <pointer-type-def type-id='e024ff18' size-in-bits='32' id='0c3dbbb6'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' id='0c9942d2'/>
    <typedef-decl name='memset_func' type-id='be53fedc' id='0cac8ffa'/>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='8' id='0d06df4d'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <function-type size-in-bits='32' id='0d7551dc'>
      <parameter type-id='95506cfb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <type-decl name='unsigned long long int' size-in-bits='64' id='0d77e947'/>
    <class-decl name='iovec' size-in-bits='64' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='iov_len' type-id='9e19ad6e' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='32' id='0f32f5b6'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='daeedd90'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='__fsid_t' type-id='ea35c84a' id='0f35d263'/>
    <array-type-def dimensions='1' type-id='aa12d1ba' size-in-bits='2016' id='0f48edf4'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <pointer-type-def type-id='6fdf203b' size-in-bits='32' id='111634da'/>
    <pointer-type-def type-id='acbdbcc6' size-in-bits='32' id='116842ac'/>
    <pointer-type-def type-id='74e0d19e' size-in-bits='32' id='11a9f084'/>
    <pointer-type-def type-id='1b1c4591' size-in-bits='32' id='128de512'/>
    <pointer-type-def type-id='66e24f3b' size-in-bits='32' id='12a4f187'/>
    <array-type-def dimensions='1' type-id='df9e098e' size-in-bits='768' id='12ed7798'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <pointer-type-def type-id='0f32f5b6' size-in-bits='32' id='130fd270'/>
    <pointer-type-def type-id='2102bd36' size-in-bits='32' id='134fb314'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='736' id='13e936cc'>
      <subrange length='92' type-id='7ff19f0f' id='1deb94f4'/>
    </array-type-def>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <qualified-type-def type-id='fe391c48' const='yes' id='14a93b33'/>
    <function-type size-in-bits='32' id='14c22eae'>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-type>
    <pointer-type-def type-id='7581df30' size-in-bits='32' id='157235ee'/>
    <class-decl name='ether_addr' size-in-bits='48' is-struct='yes' visibility='default' id='162c6637'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ether_addr_octet' type-id='6207b9df' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='65536' id='163f6aa5'>
      <subrange length='8192' type-id='7ff19f0f' id='c88f397d'/>
    </array-type-def>
    <typedef-decl name='res_send_rhook' type-id='2f95ebb5' id='1681dc1f'/>
    <pointer-type-def type-id='cb681f62' size-in-bits='32' id='185869c1'/>
    <pointer-type-def type-id='7a6844eb' size-in-bits='32' id='18c91f9e'/>
    <pointer-type-def type-id='8df9f5a1' size-in-bits='32' id='192bc272'/>
    <pointer-type-def type-id='c945b80d' size-in-bits='32' id='197dad9d'/>
    <pointer-type-def type-id='643895cc' size-in-bits='32' id='1994577a'/>
    <pointer-type-def type-id='333af3ef' size-in-bits='32' id='1a1909ca'/>
    <pointer-type-def type-id='277dcf9c' size-in-bits='32' id='1ab298b6'/>
    <typedef-decl name='time64_t' type-id='9da381c4' id='1afd27ac'/>
    <pointer-type-def type-id='0cac8ffa' size-in-bits='32' id='1afef1c1'/>
    <typedef-decl name='pthread_rwlockattr_t' type-id='bd54fe1a' id='1b1c4591'/>
    <typedef-decl name='regmatch_t' type-id='4f932615' id='1b941664'/>
    <pointer-type-def type-id='4d033321' size-in-bits='32' id='1c038ea9'/>
    <qualified-type-def type-id='8afd6070' const='yes' id='1d853360'/>
    <pointer-type-def type-id='34f03654' size-in-bits='32' id='1d895792'/>
    <array-type-def dimensions='1' type-id='29490dbe' size-in-bits='2880' id='1e78d7d1'>
      <subrange length='10' type-id='7ff19f0f' id='487da03a'/>
    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' is-declaration-only='yes' id='1f20d231' is-anonymous='yes'/>
    <array-type-def dimensions='1' type-id='2102bd36' size-in-bits='128' id='1f4cb68c'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='1fc6054b' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='128' id='2020bac4'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='31d2e798' size-in-bits='32' id='2102bd36'/>
    <pointer-type-def type-id='0897719a' size-in-bits='32' id='23cbcb08'/>
    <qualified-type-def type-id='aca3bac8' const='yes' id='2498fd78'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='pthread_once_t' type-id='95e97e5e' id='2568d84b'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <function-type size-in-bits='32' id='277dcf9c'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <class-decl name='__ns_rr' size-in-bits='8352' is-struct='yes' visibility='default' id='28ba1621'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='b94aacd5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8208'>
        <var-decl name='type' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='rr_class' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='ttl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8288'>
        <var-decl name='rdlength' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='rdata' type-id='2102bd36' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sort_list' size-in-bits='288' is-struct='yes' visibility='default' id='29490dbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='af' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='addr' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mask' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cset' type-id='d21ac56a' id='29a1b4eb'/>
    <class-decl name='timeval' size-in-bits='64' is-struct='yes' visibility='default' id='2a693ac3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='ea688998' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tv_usec' type-id='55c6233e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mallinfo' is-struct='yes' visibility='default' is-declaration-only='yes' id='2acba5a7'/>
    <typedef-decl name='va_list' type-id='7f896fb4' id='2aee9912'/>
    <typedef-decl name='ns_sect' type-id='69a0510d' id='2b66dc93'/>
    <typedef-decl name='gid_t' type-id='d94ec6d9' id='2bb2b96f'/>
    <typedef-decl name='prop_info' type-id='c945b80d' id='2bdebf5e'/>
    <typedef-decl name='structors_array_t' type-id='7b40ec7f' id='2c142a7c'/>
    <typedef-decl name='pthread_key_t' type-id='95e97e5e' id='2de5383b'/>
    <pointer-type-def type-id='611586a1' size-in-bits='32' id='2e243169'/>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='1152' id='2e6efade'>
      <subrange length='36' type-id='7ff19f0f' id='ae666bde'/>
    </array-type-def>
    <function-type size-in-bits='32' id='2f17800a'>
      <parameter type-id='157235ee'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='cad4dc41' size-in-bits='32' id='2f95ebb5'/>
    <array-type-def dimensions='1' type-id='78a133c2' size-in-bits='128' id='30180d4b'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <typedef-decl name='ldiv_t' type-id='9b5926fd' id='30397bf8'/>
    <pointer-type-def type-id='556b8b92' size-in-bits='32' id='304cf2a8'/>
    <class-decl name='res_static' size-in-bits='68320' is-struct='yes' visibility='default' id='3112a098'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h_addr_ptrs' type-id='2e6efade' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='host_aliases' type-id='ee70d4b5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='hostbuf' type-id='163f6aa5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67808'>
        <var-decl name='host_addr' type-id='4b74ae02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67936'>
        <var-decl name='hostf' type-id='822cd80b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67968'>
        <var-decl name='stayopen' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68000'>
        <var-decl name='servent_ptr' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68032'>
        <var-decl name='servent' type-id='a291ccb6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68160'>
        <var-decl name='host' type-id='8a68af54' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='32' id='31503df3'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='e03c66bc'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a76ffade'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <qualified-type-def type-id='b151a3a8' const='yes' id='31d2e798'/>
    <pointer-type-def type-id='c523b9f1' size-in-bits='32' id='323d93c1'/>
    <typedef-decl name='u_short' type-id='8efea9e5' id='32580e96'/>
    <array-type-def dimensions='1' type-id='ce2f4af4' size-in-bits='512' id='3316170a'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <typedef-decl name='__strcat_chk_func' type-id='f9999558' id='333af3ef'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <class-decl name='in_addr' size-in-bits='32' is-struct='yes' visibility='default' id='34f03654'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_addr' type-id='f8234714' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uid_t' type-id='cc5fcceb' id='354978ed'/>
    <pointer-type-def type-id='ea86de29' size-in-bits='32' id='354f7eb9'/>
    <typedef-decl name='__pid_t' type-id='63eb2bf2' id='3629bad8'/>
    <qualified-type-def type-id='607daf6f' const='yes' id='362b282c'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='384' id='36d7f119'>
      <subrange length='48' type-id='7ff19f0f' id='8f6d2a81'/>
    </array-type-def>
    <pointer-type-def type-id='b07ae406' size-in-bits='32' id='36e89359'/>
    <pointer-type-def type-id='c4a7b189' size-in-bits='32' id='36fca399'/>
    <typedef-decl name='sa_family_t' type-id='8efea9e5' id='376fda66'/>
    <typedef-decl name='ns_type' type-id='e3fa325a' id='37d0fad8'/>
    <pointer-type-def type-id='5e6518a8' size-in-bits='32' id='3a476383'/>
    <pointer-type-def type-id='afd35b5b' size-in-bits='32' id='3ab8f2e3'/>
    <pointer-type-def type-id='b440e872' size-in-bits='32' id='3ac36db0'/>
    <enum-decl name='__anonymous_enum__' id='3b46c736' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='res_goahead' value='0'/>
      <enumerator name='res_nextns' value='1'/>
      <enumerator name='res_modified' value='2'/>
      <enumerator name='res_done' value='3'/>
      <enumerator name='res_error' value='4'/>
    </enum-decl>
    <typedef-decl name='__signalfn_t' type-id='f712e2b7' id='3b5c61ad'/>
    <pointer-type-def type-id='59d28eff' size-in-bits='32' id='3b76d94f'/>
    <class-decl name='__sbuf' size-in-bits='64' is-struct='yes' visibility='default' id='3d00b835'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='cf536864' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_size' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mbstate_t' type-id='a76d8e48' id='3d7d8cbf'/>
    <pointer-type-def type-id='a9c79a1f' size-in-bits='32' id='3d83ba87'/>
    <typedef-decl name='__u32' type-id='f0981eeb' id='3f1a6b60'/>
    <typedef-decl name='pthread_rwlock_t' type-id='c159197f' id='3f680bc6'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='pthread_t' type-id='bd54fe1a' id='4051f5e7'/>
    <typedef-decl name='uch' type-id='002ac4a6' id='4088d420'/>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='64' id='421a59ef'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <pointer-type-def type-id='aafc373f' size-in-bits='32' id='4330df87'/>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' is-declaration-only='yes' id='43f021e0' is-anonymous='yes'/>
    <function-type size-in-bits='32' id='45059b36'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='c301a0d1' size-in-bits='32' id='45361809'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='64' id='453ce391'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <class-decl name='statfs' size-in-bits='704' is-struct='yes' visibility='default' id='458596b8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='f_bsize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_bfree' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bavail' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_files' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_ffree' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_fsid' type-id='6c921ef1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_namelen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='f_frsize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='f_spare' type-id='6f6d70c7' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='836265dd' size-in-bits='32' id='45bc197e'/>
    <typedef-decl name='__va_list' type-id='7f896fb4' id='46bd2e50'/>
    <function-type size-in-bits='32' id='484a3087'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='48b5725f'/>
    </function-type>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='u_int' type-id='f0981eeb' id='48f7c3f5'/>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='64' id='491d0410'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <qualified-type-def type-id='2a693ac3' const='yes' id='49f1d414'/>
    <pointer-type-def type-id='e9612dcc' size-in-bits='32' id='49fb4112'/>
    <typedef-decl name='nss_method' type-id='8623c90c' id='4a071314'/>
    <typedef-decl name='Time64_T' type-id='1afd27ac' id='4a5069ec'/>
    <pointer-type-def type-id='2f17800a' size-in-bits='32' id='4ab32354'/>
    <array-type-def dimensions='1' type-id='9586cc7b' size-in-bits='128' id='4b74ae02'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='a291ccb6' size-in-bits='32' id='4b94036c'/>
    <qualified-type-def type-id='acbdbcc6' const='yes' id='4ba62af7'/>
    <pointer-type-def type-id='362b282c' size-in-bits='32' id='4bf00172'/>
    <typedef-decl name='clock_t' type-id='880ebc01' id='4c3a2c61'/>
    <class-decl name='re_guts' size-in-bits='672' is-struct='yes' visibility='default' id='4d02195c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='magic' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='strip' type-id='ae31519d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='csetsize' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ncsets' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sets' type-id='f0089f58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='setbits' type-id='020609db' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cflags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='nstates' type-id='5802a091' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='firststate' type-id='5802a091' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='laststate' type-id='5802a091' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='iflags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nbol' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='neol' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='ncategories' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='categories' type-id='aad7eaba' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='must' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mlen' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='nsub' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='backrefs' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='nplus' type-id='5802a091' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='catspace' type-id='df64f33b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__res_state_ext' size-in-bits='8000' is-struct='yes' visibility='default' id='4d033321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsaddrs' type-id='6408ce89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='sort_list' type-id='1e78d7d1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='nsuffix' type-id='59daf3ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='nsuffix2' type-id='59daf3ef' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='4dd222bb' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='f0981eeb' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='24' id='4df9d64a'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <qualified-type-def type-id='2bdebf5e' const='yes' id='4dfe7b8e'/>
    <pointer-type-def type-id='e024865f' size-in-bits='32' id='4e7faa2f'/>
    <typedef-decl name='__useconds_t' type-id='8f92235e' id='4e80d4b1'/>
    <class-decl name='netent' is-struct='yes' visibility='default' is-declaration-only='yes' id='4efa7115'/>
    <typedef-decl name='useconds_t' type-id='4e80d4b1' id='4f48080b'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='4f932615' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='54a2a2a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='54a2a2a8' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='e6645292' const='yes' id='4fc7451d'/>
    <class-decl name='res_sym' size-in-bits='96' is-struct='yes' visibility='default' id='501b40f1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='number' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='humanname' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='a2192540' size-in-bits='32' id='50b23d33'/>
    <array-type-def dimensions='1' type-id='e7f43f8a' size-in-bits='640' id='50c01a6d'>
      <subrange length='10' type-id='7ff19f0f' id='487da03a'/>
    </array-type-def>
    <pointer-type-def type-id='93d633bd' size-in-bits='32' id='513336b5'/>
    <class-decl name='sigevent' size-in-bits='512' is-struct='yes' visibility='default' id='519bc206'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='416' is-anonymous='yes' visibility='default' id='ac5ab59b'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_function' type-id='b4a8d2f6' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='_attribute' type-id='eaa32e2f' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='_pad' type-id='77ba73f2' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='_tid' type-id='95e97e5e' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='_sigev_thread' type-id='e7f43f79' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sigev_value' type-id='95506cfb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sigev_signo' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sigev_notify' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_sigev_un' type-id='ac5ab59b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__id_t' type-id='8f92235e' id='52c7754c'/>
    <qualified-type-def type-id='1b1c4591' const='yes' id='52c85581'/>
    <typedef-decl name='__kernel_loff_t' type-id='1eb56b1e' id='537a730e'/>
    <pointer-type-def type-id='e06dee2d' size-in-bits='32' id='540db505'/>
    <typedef-decl name='regoff_t' type-id='79a0948f' id='54a2a2a8'/>
    <typedef-decl name='DIR' type-id='93bc433c' id='54a5d683'/>
    <typedef-decl name='nfds_t' type-id='f0981eeb' id='555eef66'/>
    <pointer-type-def type-id='8a68af54' size-in-bits='32' id='556b8b92'/>
    <typedef-decl name='__kernel_suseconds_t' type-id='6a11bd61' id='55c6233e'/>
    <pointer-type-def type-id='01a1b934' size-in-bits='32' id='566b3f52'/>
    <qualified-type-def type-id='aafc373f' const='yes' id='566c23fe'/>
    <class-decl name='sockaddr_in6' size-in-bits='224' is-struct='yes' visibility='default' id='5672af66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin6_family' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin6_port' type-id='84a5c3d4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin6_flowinfo' type-id='78a133c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sin6_addr' type-id='f6ed712a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sin6_scope_id' type-id='3f1a6b60' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='fe391c48' size-in-bits='32' id='568dd84e'/>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' is-declaration-only='yes' id='56f71ed3' is-anonymous='yes'/>
    <class-decl name='mntent' size-in-bits='192' is-struct='yes' visibility='default' id='56fe4a37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mnt_dir' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_type' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mnt_opts' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_freq' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mnt_passno' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='26a90f95' const='yes' id='57de658a'/>
    <typedef-decl name='sopno' type-id='b59d7dce' id='5802a091'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='32' id='585e1de9'/>
    <typedef-decl name='pid_t' type-id='3629bad8' id='587f89d2'/>
    <qualified-type-def type-id='c9d12d66' const='yes' id='588b3216'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' visibility='default' id='58e390d6' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='e104d842' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='e104d842' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='32' id='5919631f'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='59378909'>
      <parameter type-id='86caa38c' name='a'/>
      <parameter type-id='86caa38c' name='b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <qualified-type-def type-id='f077d3f8' restrict='yes' id='598aab80'/>
    <qualified-type-def type-id='e322b6ef' const='yes' id='59d28eff'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
      <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
    </array-type-def>
    <function-type size-in-bits='32' id='5a8b8005'>
      <parameter type-id='d6e0d053'/>
      <parameter type-id='134fb314'/>
      <parameter type-id='7292109c'/>
      <parameter type-id='93d633bd'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7292109c'/>
      <return type-id='dfbe634a'/>
    </function-type>
    <pointer-type-def type-id='e5f98c79' size-in-bits='32' id='5ad7e6a9'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='32' id='5ad9edb6'/>
    <typedef-decl name='__key_t' type-id='e8d94e28' id='5b261fc2'/>
    <typedef-decl name='fini_func_t' type-id='ee076206' id='5bd895b4'/>
    <pointer-type-def type-id='5221b18a' size-in-bits='32' id='5c0abad8'/>
    <typedef-decl name='imaxdiv_t' type-id='58e390d6' id='5c0b4dc9'/>
    <pointer-type-def type-id='a86a4ead' size-in-bits='32' id='5c5449d4'/>
    <pointer-type-def type-id='7411c98f' size-in-bits='32' id='5d006ebf'/>
    <typedef-decl name='ns_rr' type-id='28ba1621' id='5d6f949c'/>
    <pointer-type-def type-id='f50ea9b2' size-in-bits='32' id='5e14fa48'/>
    <typedef-decl name='memcpy_func' type-id='050f23f3' id='5e6518a8'/>
    <pointer-type-def type-id='f077d3f8' size-in-bits='32' id='5ea27396'/>
    <pointer-type-def type-id='6b2697b0' size-in-bits='32' id='5eea5d07'/>
    <pointer-type-def type-id='c818c24b' size-in-bits='32' id='5ff9feb3'/>
    <pointer-type-def type-id='ace12610' size-in-bits='32' id='606f2d4e'/>
    <class-decl name='utimbuf' size-in-bits='64' is-struct='yes' visibility='default' id='607daf6f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='actime' type-id='ea688998' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='modtime' type-id='ea688998' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='448' id='6093ff7c'>
      <subrange length='56' type-id='7ff19f0f' id='f8137894'/>
    </array-type-def>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' id='611586a1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='05d4c620' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='002ac4a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fd_set' type-id='43f021e0' id='619f6401'/>
    <pointer-type-def type-id='9194f5e2' size-in-bits='32' id='61e7b2c0'/>
    <array-type-def dimensions='1' type-id='892641a4' size-in-bits='48' id='6207b9df'>
      <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
    </array-type-def>
    <typedef-decl name='stpcpy_func' type-id='65561fc5' id='6263c11c'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='pthread_cond_t' type-id='56f71ed3' id='62fab762'/>
    <pointer-type-def type-id='7c33f2e1' size-in-bits='32' id='62fb0009'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <typedef-decl name='__kernel_pid_t' type-id='95e97e5e' id='63eb2bf2'/>
    <array-type-def dimensions='1' type-id='d3ccfc5c' size-in-bits='4096' id='6408ce89'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <class-decl name='statvfs' size-in-bits='352' is-struct='yes' visibility='default' id='643895cc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_bsize' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='f_frsize' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_blocks' type-id='9194840e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='f_bfree' type-id='9194840e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_bavail' type-id='9194840e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='f_files' type-id='86305bce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_ffree' type-id='86305bce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='f_favail' type-id='86305bce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_fsid' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='f_flag' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_namemax' type-id='7359adad' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' visibility='default' id='649cba4b' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='1eb56b1e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='1eb56b1e' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='32' id='65561fc5'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-type>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' visibility='default' id='659d891c' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='callback' type-id='4a071314' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_data' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='d72e7df1' size-in-bits='32' id='65da92fd'/>
    <typedef-decl name='__time_t' type-id='f7d92306' id='65eda9c0'/>
    <function-type size-in-bits='32' id='66e24f3b'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='e322b6ef'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='e322b6ef'/>
    </function-type>
    <class-decl name='timezone' is-struct='yes' visibility='default' is-declaration-only='yes' id='6751193a'/>
    <pointer-type-def type-id='fa168b9c' size-in-bits='32' id='677def82'/>
    <typedef-decl name='ns_dtab' type-id='659d891c' id='6901a33b'/>
    <enum-decl name='__ns_sect' id='69a0510d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ns_s_qd' value='0'/>
      <enumerator name='ns_s_zn' value='0'/>
      <enumerator name='ns_s_an' value='1'/>
      <enumerator name='ns_s_pr' value='1'/>
      <enumerator name='ns_s_ns' value='2'/>
      <enumerator name='ns_s_ud' value='2'/>
      <enumerator name='ns_s_ar' value='3'/>
      <enumerator name='ns_s_max' value='4'/>
    </enum-decl>
    <qualified-type-def type-id='01efdaf1' restrict='yes' id='69bba573'/>
    <typedef-decl name='loff_t' type-id='537a730e' id='69bf7bee'/>
    <typedef-decl name='__kernel_long_t' type-id='bd54fe1a' id='6a11bd61'/>
    <qualified-type-def type-id='6a47abd6' const='yes' id='6a1704e6'/>
    <typedef-decl name='ns_src' type-id='f3a54fef' id='6a47abd6'/>
    <typedef-decl name='socklen_t' type-id='83f97a0a' id='6b2697b0'/>
    <pointer-type-def type-id='ab94745c' size-in-bits='32' id='6b9b777a'/>
    <pointer-type-def type-id='4dfe7b8e' size-in-bits='32' id='6b9ca32c'/>
    <array-type-def dimensions='1' type-id='611586a1' size-in-bits='33600' id='6c688147'>
      <subrange length='15' type-id='7ff19f0f' id='8484ba73'/>
    </array-type-def>
    <typedef-decl name='fsid_t' type-id='0f35d263' id='6c921ef1'/>
    <qualified-type-def type-id='6901a33b' const='yes' id='6c9851cb'/>
    <typedef-decl name='wint_t' type-id='f0981eeb' id='6dd37369'/>
    <pointer-type-def type-id='afbf85f3' size-in-bits='32' id='6f5dd1b0'/>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='128' id='6f6d70c7'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='a1c3b834' size-in-bits='32' id='6f92701b'/>
    <reference-type-def kind='lvalue' type-id='4dfe7b8e' size-in-bits='32' id='6f9ca978'/>
    <typedef-decl name='cmp_t' type-id='96ee24a5' id='6fdf203b'/>
    <pointer-type-def type-id='b1ed1572' size-in-bits='32' id='70389988'/>
    <class-decl name='epoll_event' is-struct='yes' visibility='default' is-declaration-only='yes' id='7064bc4a'/>
    <typedef-decl name='__kernel_uid32_t' type-id='f0981eeb' id='70734f24'/>
    <function-type size-in-bits='32' id='7133c86a'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='e03c66bc'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='95e97e5e' size-in-bits='32' id='7292109c'/>
    <pointer-type-def type-id='7d8569fd' size-in-bits='32' id='7347a39e'/>
    <type-decl name='unsigned long int' size-in-bits='32' id='7359adad'/>
    <qualified-type-def type-id='3d7d8cbf' const='yes' id='7411c98f'/>
    <class-decl name='protoent' is-struct='yes' visibility='default' is-declaration-only='yes' id='74e0d19e'/>
    <qualified-type-def type-id='611586a1' const='yes' id='7581df30'/>
    <pointer-type-def type-id='4efa7115' size-in-bits='32' id='769f5205'/>
    <pointer-type-def type-id='ed5e0805' size-in-bits='32' id='7741b07c'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='416' id='77ba73f2'>
      <subrange length='13' type-id='7ff19f0f' id='487fded1'/>
    </array-type-def>
    <qualified-type-def type-id='ab94745c' const='yes' id='77be4bd1'/>
    <typedef-decl name='__be32' type-id='3f1a6b60' id='78a133c2'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='32' id='78c01427'/>
    <pointer-type-def type-id='ce2f4af4' size-in-bits='32' id='7905ca52'/>
    <pointer-type-def type-id='45059b36' size-in-bits='32' id='7964fcc0'/>
    <typedef-decl name='ssize_t' type-id='b6b3ebaf' id='79a0948f'/>
    <typedef-decl name='pthread_mutex_t' type-id='92fa54c8' id='7a6844eb'/>
    <pointer-type-def type-id='83be723c' size-in-bits='32' id='7acd98a2'/>
    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' visibility='default' id='7b40ec7f' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='preinit_array' type-id='bb080f99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='init_array' type-id='bb080f99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fini_array' type-id='4e7faa2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='77be4bd1' size-in-bits='32' id='7b919c21'/>
    <class-decl name='FTW' is-struct='yes' visibility='default' is-declaration-only='yes' id='7bbf34d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='level' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__res_state' size-in-bits='72608' is-struct='yes' visibility='default' id='7c33f2e1'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8a'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='addr' type-id='34f03654' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='mask' type-id='8f92235e' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' id='ac5ab5a0'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8b'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='nscount' type-id='149c6638' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='16'>
                <var-decl name='nstimes' type-id='453ce391' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='96'>
                <var-decl name='nssocks' type-id='2020bac4' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='224'>
                <var-decl name='ext' type-id='1c038ea9' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='pad' type-id='36d7f119' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='_ext' type-id='e7f43f8b' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='netid' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='retrans' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='retry' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='options' type-id='865e164a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nscount' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nsaddr_list' type-id='3316170a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='id' type-id='32580e96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dnsrch' type-id='0626c76e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='defdname' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='pfcode' type-id='865e164a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='ndots' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3012'>
        <var-decl name='nsort' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3016'>
        <var-decl name='unused' type-id='4df9d64a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='sort_list' type-id='50c01a6d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='qhook' type-id='e8ba48ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='rhook' type-id='1681dc1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='res_h_errno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='_mark' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='_vcsock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='_flags' type-id='48f7c3f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='_pad' type-id='48f7c3f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='_u' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='rstatic' type-id='eeadb387' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='6263c11c' size-in-bits='32' id='7c992ceb'/>
    <qualified-type-def type-id='836265dd' const='yes' id='7d24c58d'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='32' id='7d3cd834'/>
    <typedef-decl name='pthread_attr_t' type-id='0009dfd8' id='7d8569fd'/>
    <pointer-type-def type-id='1b941664' size-in-bits='32' id='7e2979d5'/>
    <typedef-decl name='__kernel_clockid_t' type-id='95e97e5e' id='7eb128d4'/>
    <array-type-def dimensions='1' type-id='84a5c3d4' size-in-bits='128' id='7f112b69'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' id='7f896fb4'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <typedef-decl name='cpu_set_t' type-id='1f20d231' id='8037c762'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <typedef-decl name='init_func_t' type-id='484a3087' id='81c2d872'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='32' id='822cd80b'/>
    <typedef-decl name='pthread_condattr_t' type-id='bd54fe1a' id='836265dd'/>
    <qualified-type-def type-id='eaa32e2f' const='yes' id='83be723c'/>
    <typedef-decl name='__socklen_t' type-id='3ff5601b' id='83f97a0a'/>
    <typedef-decl name='__be16' type-id='d315442e' id='84a5c3d4'/>
    <typedef-decl name='dev_t' type-id='8f92235e' id='8504f260'/>
    <pointer-type-def type-id='c001c0e2' size-in-bits='32' id='8623c90c'/>
    <typedef-decl name='fsfilcnt_t' type-id='7359adad' id='86305bce'/>
    <typedef-decl name='u_long' type-id='7359adad' id='865e164a'/>
    <array-type-def dimensions='1' type-id='b99c00c9' size-in-bits='2080' id='86801f96'>
      <subrange length='65' type-id='7ff19f0f' id='b50e2e4a'/>
    </array-type-def>
    <typedef-decl name='__pthread_cleanup_t' type-id='b059b9f5' id='86c4a0ba'/>
    <pointer-type-def type-id='157235ee' size-in-bits='32' id='86caa38c'/>
    <typedef-decl name='__kernel_clock_t' type-id='6a11bd61' id='880ebc01'/>
    <class-decl name='__ns_msg' size-in-bits='384' is-struct='yes' visibility='default' id='88a43236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_msg' type-id='2102bd36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_eom' type-id='2102bd36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='_flags' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_counts' type-id='453ce391' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_sections' type-id='1f4cb68c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_sect' type-id='2b66dc93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_rrnum' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='_msg_ptr' type-id='2102bd36' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='0d77e947' id='8910171f'/>
    <typedef-decl name='u_int8_t' type-id='b96825af' id='892641a4'/>
    <pointer-type-def type-id='2a693ac3' size-in-bits='32' id='896f1b83'/>
    <class-decl name='hostent' size-in-bits='160' is-struct='yes' visibility='default' id='8a68af54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='h_aliases' type-id='9b23c9ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='h_addrtype' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='h_length' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='h_addr_list' type-id='9b23c9ad' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pthread_mutexattr_t' type-id='bd54fe1a' id='8afd6070'/>
    <function-type size-in-bits='32' id='8bb5e773'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <qualified-type-def type-id='9b23c9ad' restrict='yes' id='8c85230f'/>
    <pointer-type-def type-id='8afd6070' size-in-bits='32' id='8cc71127'/>
    <typedef-decl name='__sighandler_t' type-id='a38aafde' id='8cdd9566'/>
    <class-decl name='__sFILE' size-in-bits='672' is-struct='yes' visibility='default' id='8d7b2c1e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_p' type-id='cf536864' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_r' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_w' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_flags' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='_file' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_bf' type-id='3d00b835' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_lbfsize' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='_cookie' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_close' type-id='b9b212f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_read' type-id='1ab298b6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_seek' type-id='12a4f187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='_write' type-id='09fdfd4b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_ext' type-id='3d00b835' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_up' type-id='cf536864' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='_ur' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_ubuf' type-id='09025bd3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536'>
        <var-decl name='_nbuf' type-id='0d06df4d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='_lb' type-id='3d00b835' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='_blksize' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_unused_0' type-id='e322b6ef' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='5a8b8005' size-in-bits='32' id='8daf04b9'/>
    <typedef-decl name='__kernel_off_t' type-id='6a11bd61' id='8dda407a'/>
    <typedef-decl name='ns_msg' type-id='88a43236' id='8df9f5a1'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='c3a285f2' size-in-bits='32' id='8e534621'/>
    <function-type size-in-bits='32' id='8e940cf1'>
      <parameter type-id='eaa32e2f' name='s'/>
      <parameter type-id='95e97e5e' name='c'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='b59d7dce' name='actual_size'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <typedef-decl name='__u8' type-id='002ac4a6' id='8f048e17'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <pointer-type-def type-id='81c2d872' size-in-bits='32' id='90421589'/>
    <typedef-decl name='fsblkcnt_t' type-id='7359adad' id='9194840e'/>
    <class-decl name='addrinfo' size-in-bits='256' is-struct='yes' visibility='default' id='9194f5e2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='6b2697b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ai_canonname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='5c0abad8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ai_next' type-id='61e7b2c0' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wchar_t' type-id='f0981eeb' id='928221d2'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='92fa54c8' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='128' id='9396cabb'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <class-decl name='DIR' is-struct='yes' visibility='default' is-declaration-only='yes' id='93bc433c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd_' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='available_bytes_' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next_' type-id='2e243169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mutex_' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buff_' type-id='6c688147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33728'>
        <var-decl name='current_pos_' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='b151a3a8' size-in-bits='32' id='93d633bd'/>
    <typedef-decl name='__kernel_sa_family_t' type-id='8efea9e5' id='93d679c6'/>
    <pointer-type-def type-id='dd95b0ec' size-in-bits='32' id='9486afeb'/>
    <pointer-type-def type-id='ee076206' size-in-bits='32' id='953b12f8'/>
    <typedef-decl name='sigval_t' type-id='a094b870' id='95506cfb'/>
    <typedef-decl name='u_int32_t' type-id='8f92235e' id='9586cc7b'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <function-type size-in-bits='32' id='96ee24a5'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='26a90f95' size-in-bits='32' id='9b23c9ad'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='9b5926fd' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='bd54fe1a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <qualified-type-def type-id='80f4b756' restrict='yes' id='9d26089a'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <pointer-type-def type-id='7064bc4a' size-in-bits='32' id='9da7f678'/>
    <typedef-decl name='__kernel_size_t' type-id='f0981eeb' id='9e19ad6e'/>
    <pointer-type-def type-id='daf33c64' size-in-bits='32' id='9e80f729'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='1024' id='9e942f0d'>
      <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
    </array-type-def>
    <function-type size-in-bits='32' id='9efbfb11'>
      <parameter type-id='eaa32e2f' name='end_data'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <typedef-decl name='idtype_t' type-id='95e97e5e' id='9f1a2822'/>
    <pointer-type-def type-id='588b3216' size-in-bits='32' id='9f201474'/>
    <typedef-decl name='__pthread_cleanup_func_t' type-id='b7f9d8e6' id='9f33f237'/>
    <pointer-type-def type-id='14a93b33' size-in-bits='32' id='9f68085b'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' visibility='default' id='9fa52edb' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='re_magic' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='re_nsub' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='re_endp' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='re_g' type-id='b55b737a' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='5221b18a' const='yes' id='9fb24b7f'/>
    <union-decl name='sigval' size-in-bits='32' visibility='default' id='a094b870'>
      <data-member access='public'>
        <var-decl name='sival_int' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sival_ptr' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <pointer-type-def type-id='a63d15a3' size-in-bits='32' id='a195f4a3'/>
    <typedef-decl name='clockid_t' type-id='08f9a87a' id='a1c3b834'/>
    <pointer-type-def type-id='59378909' size-in-bits='32' id='a1d87b05'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <typedef-decl name='strcmp_func' type-id='8bb5e773' id='a2192540'/>
    <class-decl name='servent' size-in-bits='128' is-struct='yes' visibility='default' id='a291ccb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='s_aliases' type-id='9b23c9ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_port' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='s_proto' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='3b5c61ad' size-in-bits='32' id='a38aafde'/>
    <pointer-type-def type-id='49f1d414' size-in-bits='32' id='a5b11d9a'/>
    <union-decl name='__sifields' size-in-bits='160' visibility='default' id='a60646cb'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='_pid' type-id='63eb2bf2' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='_uid' type-id='70734f24' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='_tid' type-id='c28acba6' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='_overrun' type-id='95e97e5e' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='_sigval' type-id='95506cfb' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='_sys_private' type-id='95e97e5e' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='_pid' type-id='63eb2bf2' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='_uid' type-id='70734f24' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='_sigval' type-id='95506cfb' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f81'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='_pid' type-id='63eb2bf2' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='_uid' type-id='70734f24' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='_status' type-id='95e97e5e' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='_utime' type-id='880ebc01' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='_stime' type-id='880ebc01' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f82'>
          <member-type access='public'>
            <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' id='ac5ab59f'>
              <member-type access='public'>
                <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f83'>
                  <data-member access='public' layout-offset-in-bits='0'>
                    <var-decl name='_dummy_bnd' type-id='8e0573fd' visibility='default'/>
                  </data-member>
                  <data-member access='public' layout-offset-in-bits='32'>
                    <var-decl name='_lower' type-id='eaa32e2f' visibility='default'/>
                  </data-member>
                  <data-member access='public' layout-offset-in-bits='64'>
                    <var-decl name='_upper' type-id='eaa32e2f' visibility='default'/>
                  </data-member>
                </class-decl>
              </member-type>
              <member-type access='public'>
                <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f84'>
                  <data-member access='public' layout-offset-in-bits='0'>
                    <var-decl name='_dummy_pkey' type-id='8e0573fd' visibility='default'/>
                  </data-member>
                  <data-member access='public' layout-offset-in-bits='32'>
                    <var-decl name='_pkey' type-id='3f1a6b60' visibility='default'/>
                  </data-member>
                </class-decl>
              </member-type>
              <member-type access='public'>
                <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f85'>
                  <data-member access='public' layout-offset-in-bits='0'>
                    <var-decl name='_data' type-id='7359adad' visibility='default'/>
                  </data-member>
                  <data-member access='public' layout-offset-in-bits='32'>
                    <var-decl name='_type' type-id='3f1a6b60' visibility='default'/>
                  </data-member>
                </class-decl>
              </member-type>
              <data-member access='public'>
                <var-decl name='_trapno' type-id='95e97e5e' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_addr_lsb' type-id='a2185560' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_addr_bnd' type-id='e7f43f83' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_addr_pkey' type-id='e7f43f84' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_perf' type-id='e7f43f85' visibility='default'/>
              </data-member>
            </union-decl>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='_addr' type-id='eaa32e2f' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='' type-id='ac5ab59f' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f86'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='_band' type-id='bd54fe1a' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='_fd' type-id='95e97e5e' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f87'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='_call_addr' type-id='eaa32e2f' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='_syscall' type-id='95e97e5e' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='_arch' type-id='f0981eeb' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='_kill' type-id='e7f43f7e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_timer' type-id='e7f43f7f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_rt' type-id='e7f43f80' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigchld' type-id='e7f43f81' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigfault' type-id='e7f43f82' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigpoll' type-id='e7f43f86' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigsys' type-id='e7f43f87' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='3f680bc6' size-in-bits='32' id='a6210c87'/>
    <class-decl name='passwd' size-in-bits='192' is-struct='yes' visibility='default' id='a63d15a3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pw_passwd' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_uid' type-id='354978ed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pw_gid' type-id='2bb2b96f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_dir' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_shell' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='3d7d8cbf' size-in-bits='32' id='a68021ce'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='a76d8e48' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__seq' type-id='09001d3c' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='7bbf34d8' size-in-bits='32' id='a76ffade'/>
    <pointer-type-def type-id='7d24c58d' size-in-bits='32' id='a7e325e5'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <typedef-decl name='__strcpy_chk_func' type-id='f9999558' id='a86a4ead'/>
    <pointer-type-def type-id='162c6637' size-in-bits='32' id='a9c37abf'/>
    <class-decl name='timespec' size-in-bits='64' is-struct='yes' visibility='default' id='a9c79a1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='c9d12d66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tv_nsec' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='df9e098e' size-in-bits='32' id='a9c92d2c'/>
    <typedef-decl name='FILE' type-id='8d7b2c1e' id='aa12d1ba'/>
    <pointer-type-def type-id='b140ea5b' size-in-bits='32' id='aad7eaba'/>
    <class-decl name='stat' is-struct='yes' visibility='default' is-declaration-only='yes' id='aafc373f'/>
    <class-decl name='msghdr' size-in-bits='224' is-struct='yes' visibility='default' id='ab94745c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='msg_name' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='msg_namelen' type-id='6b2697b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='msg_iov' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='msg_iovlen' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='msg_control' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='msg_controllen' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab5a1'>
      <data-member access='public'>
        <var-decl name='ina' type-id='34f03654' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='in6a' type-id='f6ed712a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='ns_class' type-id='e09629ea' id='ac795e88'/>
    <typedef-decl name='regex_t' type-id='9fa52edb' id='aca3bac8'/>
    <class-decl name='itimerspec' is-struct='yes' visibility='default' is-declaration-only='yes' id='acbdbcc6'/>
    <qualified-type-def type-id='c301a0d1' const='yes' id='ace12610'/>
    <typedef-decl name='off_t' type-id='8dda407a' id='ad707ada'/>
    <pointer-type-def type-id='e1dc2c22' size-in-bits='32' id='ae31519d'/>
    <pointer-type-def type-id='b96825af' size-in-bits='32' id='ae3e8ca6'/>
    <array-type-def dimensions='1' type-id='df9e098e' size-in-bits='6624' id='aed1f761'>
      <subrange length='69' type-id='7ff19f0f' id='f52b151e'/>
    </array-type-def>
    <qualified-type-def type-id='2c142a7c' const='yes' id='afa4c64c'/>
    <typedef-decl name='memmove_func' type-id='050f23f3' id='afbf85f3'/>
    <qualified-type-def type-id='9194f5e2' const='yes' id='afd35b5b'/>
    <pointer-type-def type-id='ef543c9d' size-in-bits='32' id='b0009ec4'/>
    <class-decl name='__pthread_cleanup_t' size-in-bits='96' is-struct='yes' visibility='default' id='b059b9f5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__cleanup_prev' type-id='c16842e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__cleanup_routine' type-id='9f33f237' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__cleanup_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='timer_t' type-id='df209b60' id='b07ae406'/>
    <typedef-decl name='cat_t' type-id='002ac4a6' id='b140ea5b'/>
    <typedef-decl name='u_char' type-id='002ac4a6' id='b151a3a8'/>
    <qualified-type-def type-id='cb681f62' const='yes' id='b1ed1572'/>
    <pointer-type-def type-id='c4202dde' size-in-bits='32' id='b2a8571c'/>
    <pointer-type-def type-id='c9d12d66' size-in-bits='32' id='b2eb2c3f'/>
    <class-decl name='pollfd' size-in-bits='64' is-struct='yes' visibility='default' id='b440e872'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='events' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='revents' type-id='a2185560' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__kernel_gid32_t' type-id='f0981eeb' id='b4413cee'/>
    <pointer-type-def type-id='0d7551dc' size-in-bits='32' id='b4a8d2f6'/>
    <pointer-type-def type-id='7133c86a' size-in-bits='32' id='b4feaaec'/>
    <pointer-type-def type-id='2bb2b96f' size-in-bits='32' id='b52814e6'/>
    <pointer-type-def type-id='4d02195c' size-in-bits='32' id='b55b737a'/>
    <typedef-decl name='strcat_func' type-id='65561fc5' id='b5618eb0'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='320' id='b5b1a17b'>
      <subrange length='10' type-id='7ff19f0f' id='487da03a'/>
    </array-type-def>
    <typedef-decl name='__kernel_ssize_t' type-id='95e97e5e' id='b6b3ebaf'/>
    <pointer-type-def type-id='56fe4a37' size-in-bits='32' id='b6b61d2f'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='32' id='b7f9d8e6'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8200' id='b94aacd5'>
      <subrange length='1025' type-id='7ff19f0f' id='ca020ead'/>
    </array-type-def>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <qualified-type-def type-id='80f4b756' const='yes' id='b99c00c9'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='32' id='b9b212f5'/>
    <typedef-decl name='wctype_t' type-id='bd54fe1a' id='ba50424d'/>
    <pointer-type-def type-id='9fb24b7f' size-in-bits='32' id='baac96cf'/>
    <pointer-type-def type-id='90421589' size-in-bits='32' id='bb080f99'/>
    <type-decl name='long int' size-in-bits='32' id='bd54fe1a'/>
    <typedef-decl name='__kernel_mode_t' type-id='8efea9e5' id='bd89690c'/>
    <typedef-decl name='sighandler_t' type-id='8cdd9566' id='bdbc1684'/>
    <function-type size-in-bits='32' id='be53fedc'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <function-type size-in-bits='32' id='c001c0e2'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' visibility='default' id='c159197f' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='b5b1a17b' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='86c4a0ba' size-in-bits='32' id='c16842e5'/>
    <typedef-decl name='__kernel_timer_t' type-id='95e97e5e' id='c28acba6'/>
    <pointer-type-def type-id='1d853360' size-in-bits='32' id='c2afbd7e'/>
    <class-decl name='option' size-in-bits='128' is-struct='yes' visibility='default' id='c2fcfcfc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='has_arg' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flag' type-id='7292109c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='val' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='utmp' is-struct='yes' visibility='default' is-declaration-only='yes' id='c301a0d1'/>
    <typedef-decl name='strcpy_func' type-id='65561fc5' id='c3a285f2'/>
    <qualified-type-def type-id='162c6637' const='yes' id='c4202dde'/>
    <typedef-decl name='key_t' type-id='5b261fc2' id='c420f708'/>
    <qualified-type-def type-id='0897719a' const='yes' id='c4a7b189'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <type-decl name='wchar_t' size-in-bits='32' id='c523b9f1'/>
    <function-type size-in-bits='32' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='e322b6ef' size-in-bits='32' id='c5f12884'/>
    <qualified-type-def type-id='c2fcfcfc' const='yes' id='c6b5b625'/>
    <qualified-type-def type-id='a2185560' const='yes' id='c818c24b'/>
    <class-decl name='prop_info' size-in-bits='768' is-struct='yes' visibility='default' id='c945b80d'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='736' is-anonymous='yes' visibility='default' id='ac5ab596'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='480' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='error_message' type-id='6093ff7c' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='448'>
                <var-decl name='offset' type-id='8f92235e' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='value' type-id='13e936cc' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='long_property' type-id='e7f43f73' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='kLongFlag' type-id='b9930aae' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='kLongLegacyErrorBufferSize' type-id='d0fa5dde' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='name' type-id='e84913bd' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='prop_info' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='197dad9d' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='8f92235e'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='8f92235e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='prop_info' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='197dad9d' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='8f92235e'/>
          <parameter type-id='8f92235e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='prop_info' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='197dad9d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='prop_info' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='197dad9d' is-artificial='yes'/>
          <parameter type-id='6f9ca978'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='time_t' type-id='65eda9c0' id='c9d12d66'/>
    <pointer-type-def type-id='6751193a' size-in-bits='32' id='cab52998'/>
    <function-type size-in-bits='32' id='cad4dc41'>
      <parameter type-id='baac96cf'/>
      <parameter type-id='2102bd36'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='93d633bd'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7292109c'/>
      <return type-id='dfbe634a'/>
    </function-type>
    <typedef-decl name='siginfo_t' type-id='fe1f25f2' id='cb681f62'/>
    <pointer-type-def type-id='0f042891' size-in-bits='32' id='cc4b1be9'/>
    <typedef-decl name='__uid_t' type-id='70734f24' id='cc5fcceb'/>
    <pointer-type-def type-id='f0525351' size-in-bits='32' id='cc996aa1'/>
    <qualified-type-def type-id='a9c79a1f' const='yes' id='cd087e36'/>
    <function-type size-in-bits='32' id='cd5d79f4'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <pointer-type-def type-id='2de5383b' size-in-bits='32' id='ce04b822'/>
    <class-decl name='sockaddr_in' size-in-bits='128' is-struct='yes' visibility='default' id='ce2f4af4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin_family' type-id='93d679c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin_port' type-id='84a5c3d4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin_addr' type-id='34f03654' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__pad' type-id='491d0410' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='6a1704e6' size-in-bits='32' id='ce3c8d24'/>
    <pointer-type-def type-id='002ac4a6' size-in-bits='32' id='cf536864'/>
    <qualified-type-def type-id='b59d7dce' const='yes' id='d0fa5dde'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
      <subrange length='256' type-id='7ff19f0f' id='36e5b9fa'/>
    </array-type-def>
    <qualified-type-def type-id='78c01427' restrict='yes' id='d19b2c25'/>
    <pointer-type-def type-id='5d6f949c' size-in-bits='32' id='d1e3c163'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' visibility='default' id='d21ac56a' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='020609db' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mask' type-id='4088d420' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='hash' type-id='4088d420' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='smultis' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='multis' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__u16' type-id='8efea9e5' id='d315442e'/>
    <pointer-type-def type-id='aca3bac8' size-in-bits='32' id='d33f11cb'/>
    <union-decl name='res_sockaddr_union' size-in-bits='1024' visibility='default' id='d3ccfc5c'>
      <data-member access='public'>
        <var-decl name='sin' type-id='ce2f4af4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sin6' type-id='5672af66' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align32' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__space' type-id='e3204322' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='6c9851cb' size-in-bits='32' id='d4c8e533'/>
    <typedef-decl name='mode_t' type-id='e1c52942' id='d50d396c'/>
    <typedef-decl name='_Unwind_Ptr' type-id='e475ab95' id='d5d12e25'/>
    <pointer-type-def type-id='e824a34f' size-in-bits='32' id='d6ad37ff'/>
    <pointer-type-def type-id='f3082e6b' size-in-bits='32' id='d6e0d053'/>
    <function-type size-in-bits='32' id='d72e7df1'>
      <parameter type-id='6b9ca32c'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='8037c762' size-in-bits='32' id='d74a6869'/>
    <pointer-type-def type-id='ae3e8ca6' size-in-bits='32' id='d8774064'/>
    <pointer-type-def type-id='dddf6ca2' size-in-bits='32' id='d915a820'/>
    <typedef-decl name='__gid_t' type-id='b4413cee' id='d94ec6d9'/>
    <pointer-type-def type-id='2568d84b' size-in-bits='32' id='d9bab700'/>
    <pointer-type-def type-id='fe1f25f2' size-in-bits='32' id='daeedd90'/>
    <typedef-decl name='sigset_t' type-id='7359adad' id='daf33c64'/>
    <pointer-type-def type-id='62fab762' size-in-bits='32' id='db285b03'/>
    <typedef-decl name='sem_t' type-id='4dd222bb' id='dd95b0ec'/>
    <class-decl name='tm' size-in-bits='352' is-struct='yes' visibility='default' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tm_gmtoff' type-id='bd54fe1a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c6b5b625' size-in-bits='32' id='df0d999d'/>
    <typedef-decl name='__timer_t' type-id='eaa32e2f' id='df209b60'/>
    <array-type-def dimensions='1' type-id='b140ea5b' size-in-bits='8' id='df64f33b'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <qualified-type-def type-id='501b40f1' const='yes' id='df9e098e'/>
    <typedef-decl name='res_sendhookact' type-id='3b46c736' id='dfbe634a'/>
    <pointer-type-def type-id='4051f5e7' size-in-bits='32' id='e01b5462'/>
    <pointer-type-def type-id='5bd895b4' size-in-bits='32' id='e024865f'/>
    <qualified-type-def type-id='95e97e5e' volatile='yes' id='e024ff18'/>
    <pointer-type-def type-id='566c23fe' size-in-bits='32' id='e03c66bc'/>
    <pointer-type-def type-id='cd087e36' size-in-bits='32' id='e05e8614'/>
    <qualified-type-def type-id='7d8569fd' const='yes' id='e06dee2d'/>
    <type-decl name='long double' size-in-bits='64' id='e095c704'/>
    <enum-decl name='__ns_class' id='e09629ea'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ns_c_invalid' value='0'/>
      <enumerator name='ns_c_in' value='1'/>
      <enumerator name='ns_c_2' value='2'/>
      <enumerator name='ns_c_chaos' value='3'/>
      <enumerator name='ns_c_hs' value='4'/>
      <enumerator name='ns_c_none' value='254'/>
      <enumerator name='ns_c_any' value='255'/>
      <enumerator name='ns_c_max' value='65536'/>
    </enum-decl>
    <typedef-decl name='intmax_t' type-id='9da381c4' id='e104d842'/>
    <pointer-type-def type-id='619f6401' size-in-bits='32' id='e172b126'/>
    <qualified-type-def type-id='ce2f4af4' const='yes' id='e1abf19f'/>
    <typedef-decl name='__mode_t' type-id='bd89690c' id='e1c52942'/>
    <typedef-decl name='sop' type-id='9586cc7b' id='e1dc2c22'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1024' id='e3204322'>
      <subrange length='128' type-id='7ff19f0f' id='1eb1687a'/>
    </array-type-def>
    <typedef-decl name='fpos_t' type-id='ad707ada' id='e322b6ef'/>
    <enum-decl name='__ns_type' id='e3fa325a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ns_t_invalid' value='0'/>
      <enumerator name='ns_t_a' value='1'/>
      <enumerator name='ns_t_ns' value='2'/>
      <enumerator name='ns_t_md' value='3'/>
      <enumerator name='ns_t_mf' value='4'/>
      <enumerator name='ns_t_cname' value='5'/>
      <enumerator name='ns_t_soa' value='6'/>
      <enumerator name='ns_t_mb' value='7'/>
      <enumerator name='ns_t_mg' value='8'/>
      <enumerator name='ns_t_mr' value='9'/>
      <enumerator name='ns_t_null' value='10'/>
      <enumerator name='ns_t_wks' value='11'/>
      <enumerator name='ns_t_ptr' value='12'/>
      <enumerator name='ns_t_hinfo' value='13'/>
      <enumerator name='ns_t_minfo' value='14'/>
      <enumerator name='ns_t_mx' value='15'/>
      <enumerator name='ns_t_txt' value='16'/>
      <enumerator name='ns_t_rp' value='17'/>
      <enumerator name='ns_t_afsdb' value='18'/>
      <enumerator name='ns_t_x25' value='19'/>
      <enumerator name='ns_t_isdn' value='20'/>
      <enumerator name='ns_t_rt' value='21'/>
      <enumerator name='ns_t_nsap' value='22'/>
      <enumerator name='ns_t_nsap_ptr' value='23'/>
      <enumerator name='ns_t_sig' value='24'/>
      <enumerator name='ns_t_key' value='25'/>
      <enumerator name='ns_t_px' value='26'/>
      <enumerator name='ns_t_gpos' value='27'/>
      <enumerator name='ns_t_aaaa' value='28'/>
      <enumerator name='ns_t_loc' value='29'/>
      <enumerator name='ns_t_nxt' value='30'/>
      <enumerator name='ns_t_eid' value='31'/>
      <enumerator name='ns_t_nimloc' value='32'/>
      <enumerator name='ns_t_srv' value='33'/>
      <enumerator name='ns_t_atma' value='34'/>
      <enumerator name='ns_t_naptr' value='35'/>
      <enumerator name='ns_t_kx' value='36'/>
      <enumerator name='ns_t_cert' value='37'/>
      <enumerator name='ns_t_a6' value='38'/>
      <enumerator name='ns_t_dname' value='39'/>
      <enumerator name='ns_t_sink' value='40'/>
      <enumerator name='ns_t_opt' value='41'/>
      <enumerator name='ns_t_apl' value='42'/>
      <enumerator name='ns_t_ds' value='43'/>
      <enumerator name='ns_t_sshfp' value='44'/>
      <enumerator name='ns_t_ipseckey' value='45'/>
      <enumerator name='ns_t_rrsig' value='46'/>
      <enumerator name='ns_t_nsec' value='47'/>
      <enumerator name='ns_t_dnskey' value='48'/>
      <enumerator name='ns_t_dhcid' value='49'/>
      <enumerator name='ns_t_nsec3' value='50'/>
      <enumerator name='ns_t_nsec3param' value='51'/>
      <enumerator name='ns_t_hip' value='55'/>
      <enumerator name='ns_t_spf' value='99'/>
      <enumerator name='ns_t_tkey' value='249'/>
      <enumerator name='ns_t_tsig' value='250'/>
      <enumerator name='ns_t_ixfr' value='251'/>
      <enumerator name='ns_t_axfr' value='252'/>
      <enumerator name='ns_t_mailb' value='253'/>
      <enumerator name='ns_t_maila' value='254'/>
      <enumerator name='ns_t_any' value='255'/>
      <enumerator name='ns_t_zxfr' value='256'/>
      <enumerator name='ns_t_dlv' value='32769'/>
      <enumerator name='ns_t_max' value='65536'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='64' id='e4266c7e'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='ee08aaf3' id='e475ab95'/>
    <pointer-type-def type-id='31503df3' size-in-bits='32' id='e5411fa7'/>
    <pointer-type-def type-id='2e243169' size-in-bits='32' id='e5f98c79'/>
    <pointer-type-def type-id='afa4c64c' size-in-bits='32' id='e6645292'/>
    <qualified-type-def type-id='822cd80b' restrict='yes' id='e75a27e9'/>
    <pointer-type-def type-id='a195f4a3' size-in-bits='32' id='e80ff3ab'/>
    <qualified-type-def type-id='dddf6ca2' const='yes' id='e824a34f'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='infinite' id='e84913bd'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <typedef-decl name='res_send_qhook' type-id='8daf04b9' id='e8ba48ae'/>
    <typedef-decl name='__kernel_key_t' type-id='95e97e5e' id='e8d94e28'/>
    <qualified-type-def type-id='5d6f949c' const='yes' id='e9612dcc'/>
    <pointer-type-def type-id='8efea9e5' size-in-bits='32' id='e9e550dd'/>
    <typedef-decl name='u_int16_t' type-id='149c6638' id='ea2e3595'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='ea35c84a' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='e4266c7e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__kernel_old_time_t' type-id='6a11bd61' id='ea688998'/>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <typedef-decl name='__memset_chk_func' type-id='8e940cf1' id='ed5e0805'/>
    <function-type size-in-bits='32' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='__uintptr_t' type-id='f0981eeb' id='ee08aaf3'/>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='1120' id='ee70d4b5'>
      <subrange length='35' type-id='7ff19f0f' id='6e6845b5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3112a098' size-in-bits='68320' id='eeadb387'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <pointer-type-def type-id='2498fd78' size-in-bits='32' id='eed6c816'/>
    <pointer-type-def type-id='519bc206' size-in-bits='32' id='ef2f159c'/>
    <typedef-decl name='eventfd_t' type-id='9c313c2d' id='ef543c9d'/>
    <qualified-type-def type-id='c523b9f1' const='yes' id='effb3702'/>
    <pointer-type-def type-id='29a1b4eb' size-in-bits='32' id='f0089f58'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' id='f01a039e'>
      <subrange length='14' type-id='7ff19f0f' id='48882d96'/>
    </array-type-def>
    <qualified-type-def type-id='8df9f5a1' const='yes' id='f0525351'/>
    <pointer-type-def type-id='effb3702' size-in-bits='32' id='f077d3f8'/>
    <pointer-type-def type-id='54a5d683' size-in-bits='32' id='f09217ba'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <qualified-type-def type-id='323d93c1' restrict='yes' id='f1358bc3'/>
    <pointer-type-def type-id='f61fb854' size-in-bits='32' id='f1ef6e5a'/>
    <qualified-type-def type-id='5c0abad8' const='yes' id='f3082e6b'/>
    <pointer-type-def type-id='57de658a' size-in-bits='32' id='f319fae0'/>
    <pointer-type-def type-id='4ba62af7' size-in-bits='32' id='f39579e7'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='f3a54fef' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='strlen_func' type-id='14c22eae' id='f4ac260d'/>
    <qualified-type-def type-id='8037c762' const='yes' id='f50ea9b2'/>
    <typedef-decl name='lldiv_t' type-id='649cba4b' id='f5fa3b34'/>
    <qualified-type-def type-id='daf33c64' const='yes' id='f61fb854'/>
    <pointer-type-def type-id='e1abf19f' size-in-bits='32' id='f6ad7fef'/>
    <class-decl name='in6_addr' size-in-bits='128' is-struct='yes' visibility='default' id='f6ed712a'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab59a'>
          <data-member access='public'>
            <var-decl name='u6_addr8' type-id='9396cabb' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='u6_addr16' type-id='7f112b69' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='u6_addr32' type-id='30180d4b' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='in6_u' type-id='ac5ab59a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='1fc6054b' id='f702ecec'/>
    <function-type size-in-bits='32' id='f712e2b7'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <typedef-decl name='__kernel_time_t' type-id='6a11bd61' id='f7d92306'/>
    <pointer-type-def type-id='f4ac260d' size-in-bits='32' id='f802a43c'/>
    <typedef-decl name='in_addr_t' type-id='8f92235e' id='f8234714'/>
    <qualified-type-def type-id='05232410' const='yes' id='f8548100'/>
    <typedef-decl name='uintmax_t' type-id='9c313c2d' id='f8b828c9'/>
    <qualified-type-def type-id='d6ad37ff' restrict='yes' id='f8c6051d'/>
    <function-type size-in-bits='32' id='f9999558'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='dst_len'/>
      <return type-id='26a90f95'/>
    </function-type>
    <qualified-type-def type-id='4a5069ec' const='yes' id='fa168b9c'/>
    <pointer-type-def type-id='52c85581' size-in-bits='32' id='fc5edc31'/>
    <typedef-decl name='ptrdiff_t' type-id='95e97e5e' id='fc84bffe'/>
    <class-decl name='siginfo' size-in-bits='1024' is-struct='yes' visibility='default' id='fe1f25f2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab59e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='siginfo' size-in-bits='1024' is-struct='yes' visibility='default' is-declaration-only='yes' id='fe1f25f2'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='1024' is-anonymous='yes' visibility='default' id='ac5ab59e'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='si_signo' type-id='95e97e5e' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='si_errno' type-id='95e97e5e' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='si_code' type-id='95e97e5e' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='96'>
                <var-decl name='_sifields' type-id='a60646cb' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f7d' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='_si_pad' type-id='9e942f0d' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
    </class-decl>
    <class-decl name='siginfo' size-in-bits='1024' is-struct='yes' visibility='default' id='fe1f25f2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab59e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sigaction' size-in-bits='128' is-struct='yes' visibility='default' id='fe391c48'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59d'>
          <data-member access='public'>
            <var-decl name='sa_handler' type-id='bdbc1684' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='sa_sigaction' type-id='130fd270' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab59d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sa_mask' type-id='daf33c64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sa_restorer' type-id='953b12f8' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='__aeabi_atexit_impl' mangled-name='__aeabi_atexit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_atexit@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='object'/>
      <parameter type-id='b7f9d8e6' name='destructor'/>
      <parameter type-id='eaa32e2f' name='dso_handle'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__aeabi_atexit_impl2' mangled-name='__aeabi_atexit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_atexit@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='object'/>
      <parameter type-id='b7f9d8e6' name='destructor'/>
      <parameter type-id='eaa32e2f' name='dso_handle'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__aeabi_memclr4_impl' mangled-name='__aeabi_memclr4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memclr4@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memclr4_impl2' mangled-name='__aeabi_memclr4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memclr4@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memclr8_impl' mangled-name='__aeabi_memclr8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memclr8@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memclr8_impl2' mangled-name='__aeabi_memclr8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memclr8@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memclr_impl' mangled-name='__aeabi_memclr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memclr@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memclr_impl2' mangled-name='__aeabi_memclr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memclr@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memcpy4_impl' mangled-name='__aeabi_memcpy4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memcpy4@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memcpy4_impl2' mangled-name='__aeabi_memcpy4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memcpy4@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memcpy8_impl' mangled-name='__aeabi_memcpy8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memcpy8@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memcpy8_impl2' mangled-name='__aeabi_memcpy8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memcpy8@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memcpy_impl' mangled-name='__aeabi_memcpy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memcpy@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memcpy_impl2' mangled-name='__aeabi_memcpy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memcpy@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memmove4_impl' mangled-name='__aeabi_memmove4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memmove4@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memmove4_impl2' mangled-name='__aeabi_memmove4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memmove4@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memmove8_impl' mangled-name='__aeabi_memmove8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memmove8@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memmove8_impl2' mangled-name='__aeabi_memmove8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memmove8@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memmove_impl' mangled-name='__aeabi_memmove' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memmove@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memmove_impl2' mangled-name='__aeabi_memmove' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memmove@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memset4_impl' mangled-name='__aeabi_memset4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memset4@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='95e97e5e' name='c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memset4_impl2' mangled-name='__aeabi_memset4' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memset4@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='95e97e5e' name='c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memset8_impl' mangled-name='__aeabi_memset8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memset8@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='95e97e5e' name='c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memset8_impl2' mangled-name='__aeabi_memset8' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memset8@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='95e97e5e' name='c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memset_impl' mangled-name='__aeabi_memset' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memset@@LIBC_N'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='95e97e5e' name='c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__aeabi_memset_impl2' mangled-name='__aeabi_memset' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__aeabi_memset@LIBC_PRIVATE'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='95e97e5e' name='c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__assert' mangled-name='__assert' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__assert@@LIBC'>
      <parameter type-id='80f4b756' name='file'/>
      <parameter type-id='95e97e5e' name='line'/>
      <parameter type-id='80f4b756' name='failed_expression'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__assert2' mangled-name='__assert2' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__assert2@@LIBC'>
      <parameter type-id='80f4b756' name='file'/>
      <parameter type-id='95e97e5e' name='line'/>
      <parameter type-id='80f4b756' name='function'/>
      <parameter type-id='80f4b756' name='failed_expression'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__atomic_cmpxchg' mangled-name='__atomic_cmpxchg' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__atomic_cmpxchg@@LIBC'>
      <parameter type-id='95e97e5e' name='old'/>
      <parameter type-id='95e97e5e' name='_new'/>
      <parameter type-id='0c3dbbb6' name='ptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__atomic_dec' mangled-name='__atomic_dec' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__atomic_dec@@LIBC'>
      <parameter type-id='0c3dbbb6' name='ptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__atomic_inc' mangled-name='__atomic_inc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__atomic_inc@@LIBC'>
      <parameter type-id='0c3dbbb6' name='ptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__atomic_swap' mangled-name='__atomic_swap' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__atomic_swap@@LIBC'>
      <parameter type-id='95e97e5e' name='_new'/>
      <parameter type-id='0c3dbbb6' name='ptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__b64_ntop' mangled-name='__b64_ntop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__b64_ntop@@LIBC'>
      <parameter type-id='354f7eb9' name='src'/>
      <parameter type-id='b59d7dce' name='srclength'/>
      <parameter type-id='26a90f95' name='target'/>
      <parameter type-id='b59d7dce' name='targsize'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__b64_pton' mangled-name='__b64_pton' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__b64_pton@@LIBC'>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='cf536864' name='target'/>
      <parameter type-id='b59d7dce' name='targsize'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__cxa_atexit' mangled-name='__cxa_atexit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__cxa_atexit@@LIBC'>
      <parameter type-id='b7f9d8e6' name='func'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <parameter type-id='eaa32e2f' name='dso_handle'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__cxa_finalize' mangled-name='__cxa_finalize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__cxa_finalize@@LIBC'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__dn_comp' mangled-name='__dn_comp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__dn_comp@@LIBC'>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <parameter type-id='95e97e5e' name='dstsiz'/>
      <parameter type-id='513336b5' name='dnptrs'/>
      <parameter type-id='513336b5' name='lastdnptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__dn_count_labels' mangled-name='__dn_count_labels' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__dn_count_labels@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__dn_skipname' mangled-name='__dn_skipname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__dn_skipname@@LIBC'>
      <parameter type-id='2102bd36' name='ptr'/>
      <parameter type-id='2102bd36' name='eom'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__errno' mangled-name='__errno' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__errno@@LIBC'>
      <return type-id='7292109c'/>
    </function-decl>
    <function-decl name='__fgets_chk' mangled-name='__fgets_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__fgets_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='95e97e5e' name='supplied_size'/>
      <parameter type-id='822cd80b' name='stream'/>
      <parameter type-id='b59d7dce' name='dst_len_from_compiler'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__fp_nquery' mangled-name='__fp_nquery' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__fp_nquery@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='95e97e5e' name='len'/>
      <parameter type-id='822cd80b' name='file'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__fp_query' mangled-name='__fp_query' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__fp_query@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='822cd80b' name='file'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__fpclassifyd' mangled-name='__fpclassifyd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__fpclassifyd@@LIBC'>
      <parameter type-id='a0eb0f08' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__fpclassifyf' mangled-name='__fpclassifyf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__fpclassifyf@@LIBC'>
      <parameter type-id='a6c45d85' name='f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__fpclassifyl' mangled-name='__fpclassifyl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__fpclassifyl@@LIBC'>
      <parameter type-id='e095c704' name='ld'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__get_h_errno' mangled-name='__get_h_errno' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__get_h_errno@@LIBC'>
      <return type-id='7292109c'/>
    </function-decl>
    <function-decl name='__gnu_Unwind_Find_exidx_impl' mangled-name='__gnu_Unwind_Find_exidx' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__gnu_Unwind_Find_exidx@LIBC_PRIVATE'>
      <parameter type-id='d5d12e25' name='pc'/>
      <parameter type-id='7292109c' name='pcount'/>
      <return type-id='d5d12e25'/>
    </function-decl>
    <function-decl name='__gnu_Unwind_Find_exidx_impl2' mangled-name='__gnu_Unwind_Find_exidx' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__gnu_Unwind_Find_exidx@@LIBC_N'>
      <parameter type-id='d5d12e25' name='pc'/>
      <parameter type-id='7292109c' name='pcount'/>
      <return type-id='d5d12e25'/>
    </function-decl>
    <function-decl name='__hostalias' mangled-name='__hostalias' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__hostalias@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__isfinite' mangled-name='__isfinite' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isfinite@@LIBC'>
      <parameter type-id='a0eb0f08' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isfinitef' mangled-name='__isfinitef' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isfinitef@@LIBC'>
      <parameter type-id='a6c45d85' name='f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isfinitel' mangled-name='__isfinitel' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isfinitel@@LIBC'>
      <parameter type-id='e095c704' name='ld'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isinf' mangled-name='__isinf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isinf@@LIBC'>
      <parameter type-id='a0eb0f08' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isinff' mangled-name='__isinff' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isinff@@LIBC'>
      <parameter type-id='a6c45d85' name='f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isinfl' mangled-name='__isinfl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isinfl@@LIBC'>
      <parameter type-id='e095c704' name='ld'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isnan' mangled-name='__isnan' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isnan@@LIBC'>
      <parameter type-id='a0eb0f08' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isnanf' mangled-name='__isnanf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isnanf@@LIBC'>
      <parameter type-id='a6c45d85' name='f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isnanl' mangled-name='__isnanl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isnanl@@LIBC'>
      <parameter type-id='e095c704' name='ld'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isnormal' mangled-name='__isnormal' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isnormal@@LIBC'>
      <parameter type-id='a0eb0f08' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isnormalf' mangled-name='__isnormalf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isnormalf@@LIBC'>
      <parameter type-id='a6c45d85' name='f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__isnormall' mangled-name='__isnormall' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__isnormall@@LIBC'>
      <parameter type-id='e095c704' name='ld'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <var-decl name='__isthreaded' type-id='95e97e5e' mangled-name='__isthreaded' visibility='default' elf-symbol-id='__isthreaded@@LIBC'/>
    <function-decl name='__libc_init' mangled-name='__libc_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__libc_init@@LIBC'>
      <parameter type-id='eaa32e2f' name='raw_args'/>
      <parameter type-id='953b12f8' name='onexit'/>
      <parameter type-id='7964fcc0' name='slingshot'/>
      <parameter type-id='4fc7451d' name='structors'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__loc_aton' mangled-name='__loc_aton' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__loc_aton@@LIBC'>
      <parameter type-id='80f4b756' name='ascii'/>
      <parameter type-id='93d633bd' name='binary'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__loc_ntoa' mangled-name='__loc_ntoa' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__loc_ntoa@@LIBC'>
      <parameter type-id='2102bd36' name='binary'/>
      <parameter type-id='26a90f95' name='ascii'/>
      <parameter type-id='b59d7dce' name='bufsiz'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__memmove_chk' mangled-name='__memmove_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__memmove_chk@@LIBC'>
      <parameter type-id='eaa32e2f' name='dst'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='b59d7dce' name='dst_len'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='__memset_chk_resolver' mangled-name='__memset_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__memset_chk@@LIBC'>
      <parameter type-id='7359adad' name='hwcap'/>
      <return type-id='7741b07c'/>
    </function-decl>
    <function-decl name='__ns_format_ttl' mangled-name='__ns_format_ttl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_format_ttl@@LIBC'>
      <parameter type-id='865e164a' name='src'/>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='b59d7dce' name='dstlen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_get16' mangled-name='__ns_get16' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_get16@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='__ns_get32' mangled-name='__ns_get32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_get32@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='__ns_initparse' mangled-name='__ns_initparse' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_initparse@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='95e97e5e' name='msglen'/>
      <parameter type-id='192bc272' name='handle'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_makecanon' mangled-name='__ns_makecanon' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_makecanon@@LIBC'>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='b59d7dce' name='dstsize'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_msg_getflag' mangled-name='__ns_msg_getflag' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_msg_getflag@@LIBC'>
      <parameter type-id='8df9f5a1' name='handle'/>
      <parameter type-id='95e97e5e' name='flag'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_compress' mangled-name='__ns_name_compress' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_compress@@LIBC'>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <parameter type-id='b59d7dce' name='dstsiz'/>
      <parameter type-id='134fb314' name='dnptrs'/>
      <parameter type-id='134fb314' name='lastdnptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_ntol' mangled-name='__ns_name_ntol' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_ntol@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <parameter type-id='b59d7dce' name='dstsiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_ntop' mangled-name='__ns_name_ntop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_ntop@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='b59d7dce' name='dstsiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_pack' mangled-name='__ns_name_pack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_pack@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <parameter type-id='95e97e5e' name='dstsiz'/>
      <parameter type-id='134fb314' name='dnptrs'/>
      <parameter type-id='134fb314' name='lastdnptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_pton' mangled-name='__ns_name_pton' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_pton@@LIBC'>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <parameter type-id='b59d7dce' name='dstsiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_rollback' mangled-name='__ns_name_rollback' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_rollback@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <parameter type-id='134fb314' name='dnptrs'/>
      <parameter type-id='134fb314' name='lastdnptr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__ns_name_skip' mangled-name='__ns_name_skip' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_skip@@LIBC'>
      <parameter type-id='134fb314' name='ptrptr'/>
      <parameter type-id='2102bd36' name='eom'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_uncompress' mangled-name='__ns_name_uncompress' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_uncompress@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='2102bd36' name='eom'/>
      <parameter type-id='2102bd36' name='src'/>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='b59d7dce' name='dstsiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_name_unpack' mangled-name='__ns_name_unpack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_name_unpack@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='2102bd36' name='eom'/>
      <parameter type-id='2102bd36' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <parameter type-id='b59d7dce' name='dstsiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_parserr' mangled-name='__ns_parserr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_parserr@@LIBC'>
      <parameter type-id='192bc272' name='handle'/>
      <parameter type-id='2b66dc93' name='section'/>
      <parameter type-id='95e97e5e' name='rrnum'/>
      <parameter type-id='d1e3c163' name='rr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_put16' mangled-name='__ns_put16' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_put16@@LIBC'>
      <parameter type-id='149c6638' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__ns_put32' mangled-name='__ns_put32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_put32@@LIBC'>
      <parameter type-id='8f92235e' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__ns_samename' mangled-name='__ns_samename' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_samename@@LIBC'>
      <parameter type-id='80f4b756' name='a'/>
      <parameter type-id='80f4b756' name='b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_skiprr' mangled-name='__ns_skiprr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_skiprr@@LIBC'>
      <parameter type-id='2102bd36' name='ptr'/>
      <parameter type-id='2102bd36' name='eom'/>
      <parameter type-id='2b66dc93' name='section'/>
      <parameter type-id='95e97e5e' name='count'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_sprintrr' mangled-name='__ns_sprintrr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_sprintrr@@LIBC'>
      <parameter type-id='cc996aa1' name='handle'/>
      <parameter type-id='49fb4112' name='rr'/>
      <parameter type-id='80f4b756' name='name_ctx'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__ns_sprintrrf' mangled-name='__ns_sprintrrf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__ns_sprintrrf@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='b59d7dce' name='msglen'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='ac795e88' name='class'/>
      <parameter type-id='37d0fad8' name='type'/>
      <parameter type-id='865e164a' name='ttl'/>
      <parameter type-id='2102bd36' name='rdata'/>
      <parameter type-id='b59d7dce' name='rdlen'/>
      <parameter type-id='80f4b756' name='name_ctx'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__open_2' mangled-name='__open_2' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__open_2@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='95e97e5e' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__openat_2' mangled-name='__openat_2' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__openat_2@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='80f4b756' name='pathname'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__p_cdname' mangled-name='__p_cdname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_cdname@@LIBC'>
      <parameter type-id='2102bd36' name='cp'/>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='822cd80b' name='file'/>
      <return type-id='2102bd36'/>
    </function-decl>
    <function-decl name='__p_cdnname' mangled-name='__p_cdnname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_cdnname@@LIBC'>
      <parameter type-id='2102bd36' name='cp'/>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='95e97e5e' name='len'/>
      <parameter type-id='822cd80b' name='file'/>
      <return type-id='2102bd36'/>
    </function-decl>
    <function-decl name='__p_class' mangled-name='__p_class' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_class@@LIBC'>
      <parameter type-id='95e97e5e' name='class'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <var-decl name='__p_class_syms' type-id='12ed7798' mangled-name='__p_class_syms' visibility='default' elf-symbol-id='__p_class_syms@@LIBC'/>
    <function-decl name='__p_fqname' mangled-name='__p_fqname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_fqname@@LIBC'>
      <parameter type-id='2102bd36' name='cp'/>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='822cd80b' name='file'/>
      <return type-id='2102bd36'/>
    </function-decl>
    <function-decl name='__p_fqnname' mangled-name='__p_fqnname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_fqnname@@LIBC'>
      <parameter type-id='2102bd36' name='cp'/>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='95e97e5e' name='msglen'/>
      <parameter type-id='26a90f95' name='name'/>
      <parameter type-id='95e97e5e' name='namelen'/>
      <return type-id='2102bd36'/>
    </function-decl>
    <function-decl name='__p_option' mangled-name='__p_option' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_option@@LIBC'>
      <parameter type-id='865e164a' name='option'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__p_query' mangled-name='__p_query' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_query@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__p_rcode' mangled-name='__p_rcode' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_rcode@@LIBC'>
      <parameter type-id='95e97e5e' name='rcode'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__p_secstodate' mangled-name='__p_secstodate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_secstodate@@LIBC'>
      <parameter type-id='865e164a' name='secs'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__p_time' mangled-name='__p_time' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_time@@LIBC'>
      <parameter type-id='9586cc7b' name='value'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__p_type' mangled-name='__p_type' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__p_type@@LIBC'>
      <parameter type-id='95e97e5e' name='type'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <var-decl name='__p_type_syms' type-id='aed1f761' mangled-name='__p_type_syms' visibility='default' elf-symbol-id='__p_type_syms@@LIBC'/>
    <function-decl name='__posix_basename' mangled-name='basename' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='basename@@LIBC'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <var-decl name='__progname' type-id='80f4b756' mangled-name='__progname' visibility='default' elf-symbol-id='__progname@@LIBC'/>
    <function-decl name='__pthread_cleanup_pop' mangled-name='__pthread_cleanup_pop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__pthread_cleanup_pop@@LIBC'>
      <parameter type-id='c16842e5' name='c'/>
      <parameter type-id='95e97e5e' name='execute'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__pthread_cleanup_push' mangled-name='__pthread_cleanup_push' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__pthread_cleanup_push@@LIBC'>
      <parameter type-id='c16842e5' name='c'/>
      <parameter type-id='9f33f237' name='routine'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__putlong' mangled-name='__putlong' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__putlong@@LIBC'>
      <parameter type-id='9586cc7b' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__putshort' mangled-name='__putshort' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__putshort@@LIBC'>
      <parameter type-id='ea2e3595' name='src'/>
      <parameter type-id='93d633bd' name='dst'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__res_close' mangled-name='__res_close' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_close@@LIBC'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__res_dnok' mangled-name='__res_dnok' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_dnok@@LIBC'>
      <parameter type-id='80f4b756' name='dn'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_hnok' mangled-name='__res_hnok' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_hnok@@LIBC'>
      <parameter type-id='80f4b756' name='dn'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_hostalias' mangled-name='__res_hostalias' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_hostalias@@LIBC'>
      <parameter type-id='f8548100' name='statp'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='b59d7dce' name='siz'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__res_isourserver' mangled-name='__res_isourserver' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_isourserver@@LIBC'>
      <parameter type-id='f6ad7fef' name='inp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_mailok' mangled-name='__res_mailok' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_mailok@@LIBC'>
      <parameter type-id='80f4b756' name='dn'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_nameinquery' mangled-name='__res_nameinquery' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_nameinquery@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='95e97e5e' name='class'/>
      <parameter type-id='2102bd36' name='buf'/>
      <parameter type-id='2102bd36' name='eom'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_nclose' mangled-name='__res_nclose' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_nclose@@LIBC'>
      <parameter type-id='05232410' name='statp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__res_ninit' mangled-name='__res_ninit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_ninit@@LIBC'>
      <parameter type-id='05232410' name='statp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_nmkquery' mangled-name='__res_nmkquery' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_nmkquery@@LIBC'>
      <parameter type-id='05232410' name='statp'/>
      <parameter type-id='95e97e5e' name='op'/>
      <parameter type-id='80f4b756' name='dname'/>
      <parameter type-id='95e97e5e' name='class'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='2102bd36' name='data'/>
      <parameter type-id='95e97e5e' name='datalen'/>
      <parameter type-id='2102bd36' name='newrr_in'/>
      <parameter type-id='93d633bd' name='buf'/>
      <parameter type-id='95e97e5e' name='buflen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_nquery' mangled-name='__res_nquery' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_nquery@@LIBC'>
      <parameter type-id='05232410' name='statp'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='95e97e5e' name='class'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='93d633bd' name='answer'/>
      <parameter type-id='95e97e5e' name='anslen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_nquerydomain' mangled-name='__res_nquerydomain' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_nquerydomain@@LIBC'>
      <parameter type-id='05232410' name='statp'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='domain'/>
      <parameter type-id='95e97e5e' name='class'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='93d633bd' name='answer'/>
      <parameter type-id='95e97e5e' name='anslen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_nsearch' mangled-name='__res_nsearch' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_nsearch@@LIBC'>
      <parameter type-id='05232410' name='statp'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='95e97e5e' name='class'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='93d633bd' name='answer'/>
      <parameter type-id='95e97e5e' name='anslen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_nsend' mangled-name='__res_nsend' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_nsend@@LIBC'>
      <parameter type-id='05232410' name='statp'/>
      <parameter type-id='2102bd36' name='buf'/>
      <parameter type-id='95e97e5e' name='buflen'/>
      <parameter type-id='93d633bd' name='ans'/>
      <parameter type-id='95e97e5e' name='anssiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_ownok' mangled-name='__res_ownok' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_ownok@@LIBC'>
      <parameter type-id='80f4b756' name='dn'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_queriesmatch' mangled-name='__res_queriesmatch' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_queriesmatch@@LIBC'>
      <parameter type-id='2102bd36' name='buf1'/>
      <parameter type-id='2102bd36' name='eom1'/>
      <parameter type-id='2102bd36' name='buf2'/>
      <parameter type-id='2102bd36' name='eom2'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_querydomain' mangled-name='__res_querydomain' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_querydomain@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='domain'/>
      <parameter type-id='95e97e5e' name='klass'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='93d633bd' name='answer'/>
      <parameter type-id='95e97e5e' name='anslen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_send' mangled-name='__res_send' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_send@@LIBC'>
      <parameter type-id='2102bd36' name='buf'/>
      <parameter type-id='95e97e5e' name='buflen'/>
      <parameter type-id='93d633bd' name='ans'/>
      <parameter type-id='95e97e5e' name='anssiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__res_send_setqhook' mangled-name='__res_send_setqhook' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_send_setqhook@@LIBC'>
      <parameter type-id='e8ba48ae' name='hook'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__res_send_setrhook' mangled-name='__res_send_setrhook' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__res_send_setrhook@@LIBC'>
      <parameter type-id='1681dc1f' name='hook'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='__sF' type-id='0f48edf4' mangled-name='__sF' visibility='default' elf-symbol-id='__sF@@LIBC'/>
    <function-decl name='__sched_cpualloc' mangled-name='__sched_cpualloc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__sched_cpualloc@@LIBC'>
      <parameter type-id='b59d7dce' name='count'/>
      <return type-id='d74a6869'/>
    </function-decl>
    <function-decl name='__sched_cpucount' mangled-name='__sched_cpucount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__sched_cpucount@@LIBC'>
      <parameter type-id='b59d7dce' name='setsize'/>
      <parameter type-id='5e14fa48' name='set'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__sched_cpufree' mangled-name='__sched_cpufree' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__sched_cpufree@@LIBC'>
      <parameter type-id='d74a6869' name='set'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__snprintf_chk' mangled-name='__snprintf_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__snprintf_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='b59d7dce' name='supplied_size'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter type-id='b59d7dce' name='dst_len_from_compiler'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__sprintf_chk' mangled-name='__sprintf_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__sprintf_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter type-id='b59d7dce' name='dst_len_from_compiler'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__stack_chk_fail@@LIBC'>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='__stack_chk_guard' type-id='e475ab95' mangled-name='__stack_chk_guard' visibility='default' elf-symbol-id='__stack_chk_guard@@LIBC'/>
    <function-decl name='__strcat_chk_resolver' mangled-name='__strcat_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strcat_chk@@LIBC'>
      <parameter type-id='7359adad' name='hwcap'/>
      <return type-id='1a1909ca'/>
    </function-decl>
    <function-decl name='__strchr_chk' mangled-name='__strchr_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strchr_chk@@LIBC'>
      <parameter type-id='80f4b756' name='p'/>
      <parameter type-id='95e97e5e' name='ch'/>
      <parameter type-id='b59d7dce' name='s_len'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__strcpy_chk_resolver' mangled-name='__strcpy_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strcpy_chk@@LIBC'>
      <parameter type-id='7359adad' name='hwcap'/>
      <return type-id='5c5449d4'/>
    </function-decl>
    <function-decl name='__strlcat_chk' mangled-name='__strlcat_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strlcat_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='supplied_size'/>
      <parameter type-id='b59d7dce' name='dst_len_from_compiler'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='__strlcpy_chk' mangled-name='__strlcpy_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strlcpy_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='supplied_size'/>
      <parameter type-id='b59d7dce' name='dst_len_from_compiler'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='__strlen_chk' mangled-name='__strlen_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strlen_chk@@LIBC'>
      <parameter type-id='80f4b756' name='str'/>
      <parameter type-id='b59d7dce' name='maxlen'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='__strncat_chk' mangled-name='__strncat_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strncat_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='b59d7dce' name='dst_len'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__strncpy_chk' mangled-name='__strncpy_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strncpy_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='b59d7dce' name='dst_len'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__strrchr_chk' mangled-name='__strrchr_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__strrchr_chk@@LIBC'>
      <parameter type-id='80f4b756' name='p'/>
      <parameter type-id='95e97e5e' name='ch'/>
      <parameter type-id='b59d7dce' name='s_len'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__sym_ntop' mangled-name='__sym_ntop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__sym_ntop@@LIBC'>
      <parameter type-id='a9c92d2c' name='syms'/>
      <parameter type-id='95e97e5e' name='number'/>
      <parameter type-id='7292109c' name='success'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__sym_ntos' mangled-name='__sym_ntos' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__sym_ntos@@LIBC'>
      <parameter type-id='a9c92d2c' name='syms'/>
      <parameter type-id='95e97e5e' name='number'/>
      <parameter type-id='7292109c' name='success'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='__sym_ston' mangled-name='__sym_ston' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__sym_ston@@LIBC'>
      <parameter type-id='a9c92d2c' name='syms'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='7292109c' name='success'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__system_property_find' mangled-name='__system_property_find' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_find@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='6b9ca32c'/>
    </function-decl>
    <function-decl name='__system_property_find_nth' mangled-name='__system_property_find_nth' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_find_nth@@LIBC'>
      <parameter type-id='f0981eeb' name='n'/>
      <return type-id='6b9ca32c'/>
    </function-decl>
    <function-decl name='__system_property_foreach' mangled-name='__system_property_foreach' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_foreach@@LIBC'>
      <parameter type-id='65da92fd' name='propfn'/>
      <parameter type-id='eaa32e2f' name='cookie'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__system_property_get' mangled-name='__system_property_get' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_get@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='26a90f95' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__system_property_read' mangled-name='__system_property_read' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_read@@LIBC'>
      <parameter type-id='6b9ca32c' name='pi'/>
      <parameter type-id='26a90f95' name='name'/>
      <parameter type-id='26a90f95' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__system_property_serial' mangled-name='__system_property_serial' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_serial@@LIBC'>
      <parameter type-id='6b9ca32c' name='pi'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='__system_property_set' mangled-name='__system_property_set' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_set@@LIBC'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__system_property_wait_any' mangled-name='__system_property_wait_any' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__system_property_wait_any@@LIBC_DEPRECATED'>
      <parameter type-id='8f92235e' name='old_serial'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='__umask_chk' mangled-name='__umask_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__umask_chk@@LIBC'>
      <parameter type-id='d50d396c' name='mode'/>
      <return type-id='d50d396c'/>
    </function-decl>
    <function-decl name='__vsnprintf_chk' mangled-name='__vsnprintf_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__vsnprintf_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='b59d7dce' name='supplied_size'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='b59d7dce' name='dst_len_from_compiler'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter type-id='2aee9912' name='va'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__vsprintf_chk' mangled-name='__vsprintf_chk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='__vsprintf_chk@@LIBC'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='b59d7dce' name='dst_len_from_compiler'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter type-id='2aee9912' name='va'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <var-decl name='_ctype_' type-id='80f4b756' mangled-name='_ctype_' visibility='default' elf-symbol-id='_ctype_@@LIBC'/>
    <function-decl name='_exit' mangled-name='_exit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='_exit@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_getlong' mangled-name='_getlong' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='_getlong@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='_getshort' mangled-name='_getshort' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='_getshort@@LIBC'>
      <parameter type-id='2102bd36' name='src'/>
      <return type-id='149c6638'/>
    </function-decl>
    <var-decl name='_tolower_tab_' type-id='5ff9feb3' mangled-name='_tolower_tab_' visibility='default' elf-symbol-id='_tolower_tab_@@LIBC'/>
    <var-decl name='_toupper_tab_' type-id='5ff9feb3' mangled-name='_toupper_tab_' visibility='default' elf-symbol-id='_toupper_tab_@@LIBC'/>
    <function-decl name='abort' mangled-name='abort' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='abort@@LIBC'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='abs' mangled-name='abs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='abs@@LIBC'>
      <parameter type-id='95e97e5e' name='j'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='accept' mangled-name='accept' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='accept@@LIBC'>
      <parameter type-id='95e97e5e' name='sockfd'/>
      <parameter type-id='5c0abad8' name='addr'/>
      <parameter type-id='5eea5d07' name='addrlen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='access' mangled-name='access' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='access@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='95e97e5e' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='alarm' mangled-name='alarm' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='alarm@@LIBC'>
      <parameter type-id='f0981eeb' name='secs'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='alphasort' mangled-name='alphasort' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='alphasort@@LIBC'>
      <parameter type-id='86caa38c' name='a'/>
      <parameter type-id='86caa38c' name='b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='arc4random' mangled-name='arc4random' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='arc4random@@LIBC'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='arc4random_uniform' mangled-name='arc4random_uniform' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='arc4random_uniform@@LIBC'>
      <parameter type-id='8f92235e' name='upper_bound'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='asctime' mangled-name='asctime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='asctime@@LIBC'>
      <parameter type-id='d6ad37ff' name='timeptr'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='asctime64' mangled-name='asctime64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='asctime64@@LIBC'>
      <parameter type-id='d6ad37ff' name='date'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='asctime64_r' mangled-name='asctime64_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='asctime64_r@@LIBC'>
      <parameter type-id='d6ad37ff' name='date'/>
      <parameter type-id='26a90f95' name='result'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='asctime_r' mangled-name='asctime_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='asctime_r@@LIBC'>
      <parameter type-id='d6ad37ff' name='timeptr'/>
      <parameter type-id='26a90f95' name='buf'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='asprintf' mangled-name='asprintf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='asprintf@@LIBC'>
      <parameter type-id='9b23c9ad' name='s'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='atoi' mangled-name='atoi' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='atoi@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='atol' mangled-name='atol' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='atol@@LIBC'>
      <parameter type-id='80f4b756' name='s'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='atoll' mangled-name='atoll' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='atoll@@LIBC'>
      <parameter type-id='80f4b756' name='s'/>
      <return type-id='1eb56b1e'/>
    </function-decl>
    <function-decl name='basename_r' mangled-name='basename_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='basename_r@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='26a90f95' name='buffer'/>
      <parameter type-id='b59d7dce' name='buffer_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='bindresvport' mangled-name='bindresvport' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='bindresvport@@LIBC'>
      <parameter type-id='95e97e5e' name='sd'/>
      <parameter type-id='7905ca52' name='sin'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='brk' mangled-name='brk' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='brk@@LIBC'>
      <parameter type-id='eaa32e2f' name='end_data'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='bsd_signal' mangled-name='bsd_signal' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='bsd_signal@@LIBC_O'>
      <parameter type-id='95e97e5e' name='signum'/>
      <parameter type-id='bdbc1684' name='handler'/>
      <return type-id='bdbc1684'/>
    </function-decl>
    <function-decl name='bsearch' mangled-name='bsearch' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='bsearch@@LIBC'>
      <parameter type-id='eaa32e2f' name='key'/>
      <parameter type-id='eaa32e2f' name='base0'/>
      <parameter type-id='b59d7dce' name='nmemb'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='585e1de9' name='compar'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='btowc' mangled-name='btowc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='btowc@@LIBC'>
      <parameter type-id='95e97e5e' name='c'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='calloc@@LIBC'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='chmod' mangled-name='chmod' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='chmod@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='d50d396c' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='chown' mangled-name='chown' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='chown@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='354978ed' name='uid'/>
      <parameter type-id='2bb2b96f' name='gid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='clearenv' mangled-name='clearenv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='clearenv@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='clearerr' mangled-name='clearerr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='clearerr@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='clock' mangled-name='clock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='clock@@LIBC'>
      <return type-id='4c3a2c61'/>
    </function-decl>
    <function-decl name='clock_getres' mangled-name='clock_getres' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='clock_getres@@LIBC'>
      <parameter type-id='95e97e5e' name='clock_id'/>
      <parameter type-id='3d83ba87' name='tp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='clock_gettime' mangled-name='clock_gettime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='clock_gettime@@LIBC'>
      <parameter type-id='95e97e5e' name='clock_id'/>
      <parameter type-id='3d83ba87' name='tp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='clock_nanosleep' mangled-name='clock_nanosleep' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='clock_nanosleep@@LIBC'>
      <parameter type-id='a1c3b834' name='clock_id'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter type-id='e05e8614' name='in'/>
      <parameter type-id='3d83ba87' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='clone' mangled-name='clone' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='clone@@LIBC'>
      <parameter type-id='b9b212f5' name='fn'/>
      <parameter type-id='eaa32e2f' name='child_stack'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='close@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='closedir' mangled-name='closedir' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='closedir@@LIBC'>
      <parameter type-id='f09217ba' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='closelog' mangled-name='closelog' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='closelog@@LIBC'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='connect' mangled-name='connect' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='connect@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='baac96cf' name='addr'/>
      <parameter type-id='6b2697b0' name='addr_length'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='creat' mangled-name='creat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='creat@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='d50d396c' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ctime' mangled-name='ctime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ctime@@LIBC'>
      <parameter type-id='9f201474' name='timep'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='ctime64' mangled-name='ctime64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ctime64@@LIBC'>
      <parameter type-id='677def82' name='time'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='ctime64_r' mangled-name='ctime64_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ctime64_r@@LIBC'>
      <parameter type-id='677def82' name='time'/>
      <parameter type-id='26a90f95' name='result'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='ctime_r' mangled-name='ctime_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ctime_r@@LIBC'>
      <parameter type-id='9f201474' name='timep'/>
      <parameter type-id='26a90f95' name='buf'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='daemon' mangled-name='daemon' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='daemon@@LIBC'>
      <parameter type-id='95e97e5e' name='nochdir'/>
      <parameter type-id='95e97e5e' name='noclose'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <var-decl name='daylight' type-id='95e97e5e' mangled-name='daylight' visibility='default' elf-symbol-id='daylight@@LIBC'/>
    <function-decl name='difftime' mangled-name='difftime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='difftime@@LIBC'>
      <parameter type-id='c9d12d66' name='time1'/>
      <parameter type-id='c9d12d66' name='time0'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='dirfd' mangled-name='dirfd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='dirfd@@LIBC'>
      <parameter type-id='f09217ba' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='dirname' mangled-name='dirname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='dirname@@LIBC'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='dirname_r' mangled-name='dirname_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='dirname_r@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='26a90f95' name='buffer'/>
      <parameter type-id='b59d7dce' name='buffer_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='div' mangled-name='div' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='div@@LIBC'>
      <parameter type-id='95e97e5e' name='num'/>
      <parameter type-id='95e97e5e' name='denom'/>
      <return type-id='f702ecec'/>
    </function-decl>
    <function-decl name='dn_expand' mangled-name='dn_expand' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='dn_expand@@LIBC'>
      <parameter type-id='2102bd36' name='msg'/>
      <parameter type-id='2102bd36' name='eom'/>
      <parameter type-id='2102bd36' name='src'/>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='95e97e5e' name='dstsiz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='drand48' mangled-name='drand48' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='drand48@@LIBC'>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='dup' mangled-name='dup' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='dup@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='dup2' mangled-name='dup2' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='dup2@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='endservent' mangled-name='endservent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='endservent@@LIBC'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='endutent' mangled-name='endutent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='endutent@@LIBC'>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='environ' type-id='9b23c9ad' mangled-name='environ' visibility='default' elf-symbol-id='environ@@LIBC'/>
    <function-decl name='epoll_create' mangled-name='epoll_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='epoll_create@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='epoll_wait' mangled-name='epoll_wait' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='epoll_wait@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='9da7f678' name='events'/>
      <parameter type-id='95e97e5e' name='max_events'/>
      <parameter type-id='95e97e5e' name='timeout'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='erand48' mangled-name='erand48' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='erand48@@LIBC'>
      <parameter type-id='e9e550dd'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='err' mangled-name='err' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='err@@LIBC'>
      <parameter type-id='95e97e5e' name='eval'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='errx' mangled-name='errx' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='errx@@LIBC'>
      <parameter type-id='95e97e5e' name='eval'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ether_aton' mangled-name='ether_aton' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ether_aton@@LIBC'>
      <parameter type-id='80f4b756' name='asc'/>
      <return type-id='a9c37abf'/>
    </function-decl>
    <function-decl name='ether_aton_r' mangled-name='ether_aton_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ether_aton_r@@LIBC'>
      <parameter type-id='80f4b756' name='asc'/>
      <parameter type-id='a9c37abf' name='addr'/>
      <return type-id='a9c37abf'/>
    </function-decl>
    <function-decl name='ether_ntoa' mangled-name='ether_ntoa' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ether_ntoa@@LIBC'>
      <parameter type-id='b2a8571c' name='addr'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='ether_ntoa_r' mangled-name='ether_ntoa_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ether_ntoa_r@@LIBC'>
      <parameter type-id='b2a8571c' name='addr'/>
      <parameter type-id='26a90f95' name='buf'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='eventfd' mangled-name='eventfd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='eventfd@@LIBC'>
      <parameter type-id='f0981eeb' name='initval'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='eventfd_read' mangled-name='eventfd_read' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='eventfd_read@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='b0009ec4' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='eventfd_write' mangled-name='eventfd_write' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='eventfd_write@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='ef543c9d' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='execl' mangled-name='execl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='execl@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='arg'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='execle' mangled-name='execle' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='execle@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='arg'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='execlp' mangled-name='execlp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='execlp@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='arg'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='execv' mangled-name='execv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='execv@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='f319fae0' name='argv'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='execve' mangled-name='execve' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='execve@@LIBC'>
      <parameter type-id='80f4b756' name='pathname'/>
      <parameter type-id='f319fae0' name='argv'/>
      <parameter type-id='f319fae0' name='envp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='execvp' mangled-name='execvp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='execvp@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='f319fae0' name='argv'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='exit@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='faccessat' mangled-name='faccessat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='faccessat@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fchmod' mangled-name='fchmod' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fchmod@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='d50d396c' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fchmodat' mangled-name='fchmodat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fchmodat@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='d50d396c'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fclose@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fcntl' mangled-name='fcntl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fcntl@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='95e97e5e' name='cmd'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fdopen' mangled-name='fdopen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fdopen@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='80f4b756' name='mode'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='fdopendir' mangled-name='fdopendir' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fdopendir@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='f09217ba'/>
    </function-decl>
    <function-decl name='fdprintf' mangled-name='fdprintf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fdprintf@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='feof' mangled-name='feof' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='feof@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ferror' mangled-name='ferror' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ferror@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fflush@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ffs' mangled-name='ffs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ffs@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fgetc' mangled-name='fgetc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fgetc@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fgetln' mangled-name='fgetln' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fgetln@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='78c01427' name='lenp'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='fgetpos' mangled-name='fgetpos' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fgetpos@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='c5f12884' name='pos'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fgets' mangled-name='fgets' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fgets@@LIBC'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='fgetws' mangled-name='fgetws' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fgetws@@LIBC'>
      <parameter type-id='f1358bc3' name='ws'/>
      <parameter type-id='95e97e5e' name='n'/>
      <parameter type-id='e75a27e9' name='fp'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='fgetxattr' mangled-name='fgetxattr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fgetxattr@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='eaa32e2f' name='value'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fileno@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='flistxattr' mangled-name='flistxattr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='flistxattr@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='26a90f95' name='list'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='flockfile' mangled-name='flockfile' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='flockfile@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnmatch' mangled-name='fnmatch' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fnmatch@@LIBC'>
      <parameter type-id='80f4b756' name='pattern'/>
      <parameter type-id='80f4b756' name='string'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fopen@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='80f4b756' name='mode'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='fork' mangled-name='fork' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fork@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fpathconf' mangled-name='fpathconf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fpathconf@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='95e97e5e' name='name'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fputc@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fputs' mangled-name='fputs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fputs@@LIBC'>
      <parameter type-id='80f4b756' name='s'/>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fputws' mangled-name='fputws' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fputws@@LIBC'>
      <parameter type-id='598aab80' name='ws'/>
      <parameter type-id='e75a27e9' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fread' mangled-name='fread' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fread@@LIBC'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='822cd80b'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='free@@LIBC'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='free_malloc_leak_info' mangled-name='free_malloc_leak_info' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='free_malloc_leak_info@@LIBC_DEPRECATED'>
      <parameter type-id='ae3e8ca6' name='info'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='freeaddrinfo' mangled-name='freeaddrinfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='freeaddrinfo@@LIBC'>
      <parameter type-id='61e7b2c0' name='ai'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='freopen' mangled-name='freopen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='freopen@@LIBC'>
      <parameter type-id='80f4b756' name='file'/>
      <parameter type-id='80f4b756' name='mode'/>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='fscanf' mangled-name='fscanf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fscanf@@LIBC'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fseeko' mangled-name='fseeko' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fseeko@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='ad707ada' name='offset'/>
      <parameter type-id='95e97e5e' name='whence'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fsetpos' mangled-name='fsetpos' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fsetpos@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='3b76d94f' name='pos'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fsetxattr' mangled-name='fsetxattr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fsetxattr@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='eaa32e2f' name='value'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fstatfs' mangled-name='fstatfs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fstatfs@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='00ae9cee' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fstatvfs' mangled-name='fstatvfs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fstatvfs@@LIBC'>
      <parameter type-id='95e97e5e' name='__fd'/>
      <parameter type-id='1994577a' name='__result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ftello' mangled-name='ftello' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ftello@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='ad707ada'/>
    </function-decl>
    <function-decl name='ftok' mangled-name='ftok' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ftok@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='95e97e5e' name='id'/>
      <return type-id='c420f708'/>
    </function-decl>
    <function-decl name='ftruncate' mangled-name='ftruncate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ftruncate@@LIBC'>
      <parameter type-id='95e97e5e' name='filedes'/>
      <parameter type-id='ad707ada' name='length'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ftrylockfile' mangled-name='ftrylockfile' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ftrylockfile@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ftw' mangled-name='ftw' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ftw@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='b4feaaec' name='ftw_fn'/>
      <parameter type-id='95e97e5e' name='nfds'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='funlockfile' mangled-name='funlockfile' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='funlockfile@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='funopen' mangled-name='funopen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='funopen@@LIBC'>
      <parameter type-id='eaa32e2f' name='cookie'/>
      <parameter type-id='1ab298b6' name='read_fn'/>
      <parameter type-id='09fdfd4b' name='write_fn'/>
      <parameter type-id='12a4f187' name='seek_fn'/>
      <parameter type-id='b9b212f5' name='close_fn'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='futimens' mangled-name='futimens' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='futimens@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='e05e8614' name='times'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fwide' mangled-name='fwide' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fwide@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='95e97e5e' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fwprintf' mangled-name='fwprintf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fwprintf@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='f077d3f8' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fwrite@@LIBC'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='822cd80b'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='fwscanf' mangled-name='fwscanf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='fwscanf@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='f077d3f8' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='gai_strerror' mangled-name='gai_strerror' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gai_strerror@@LIBC'>
      <parameter type-id='95e97e5e' name='ecode'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='get_malloc_leak_info' mangled-name='get_malloc_leak_info' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='get_malloc_leak_info@@LIBC_DEPRECATED'>
      <parameter type-id='d8774064' name='info'/>
      <parameter type-id='78c01427' name='overall_size'/>
      <parameter type-id='78c01427' name='info_size'/>
      <parameter type-id='78c01427' name='total_memory'/>
      <parameter type-id='78c01427' name='backtrace_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='getaddrinfo' mangled-name='getaddrinfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getaddrinfo@@LIBC'>
      <parameter type-id='80f4b756' name='hostname'/>
      <parameter type-id='80f4b756' name='servname'/>
      <parameter type-id='3ab8f2e3' name='hints'/>
      <parameter type-id='09bea65e' name='res'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getauxval' mangled-name='getauxval' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getauxval@@LIBC'>
      <parameter type-id='7359adad'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='getc' mangled-name='getc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getc@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getc_unlocked' mangled-name='getc_unlocked' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getc_unlocked@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getchar' mangled-name='getchar' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getchar@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getchar_unlocked' mangled-name='getchar_unlocked' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getchar_unlocked@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getcwd' mangled-name='getcwd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getcwd@@LIBC'>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='getdelim' mangled-name='getdelim' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getdelim@@LIBC'>
      <parameter type-id='8c85230f' name='buf'/>
      <parameter type-id='d19b2c25' name='buflen'/>
      <parameter type-id='95e97e5e' name='sep'/>
      <parameter type-id='e75a27e9' name='fp'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getenv@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='getgrgid' mangled-name='getgrgid' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getgrgid@@LIBC'>
      <parameter type-id='2bb2b96f' name='gid'/>
      <return type-id='566b3f52'/>
    </function-decl>
    <function-decl name='getgrnam' mangled-name='getgrnam' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getgrnam@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='566b3f52'/>
    </function-decl>
    <function-decl name='getgrouplist' mangled-name='getgrouplist' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getgrouplist@@LIBC'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2bb2b96f' name='group'/>
      <parameter type-id='b52814e6' name='groups'/>
      <parameter type-id='7292109c' name='ngroups'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='gethostbyaddr' mangled-name='gethostbyaddr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gethostbyaddr@@LIBC'>
      <parameter type-id='eaa32e2f' name='addr'/>
      <parameter type-id='6b2697b0' name='len'/>
      <parameter type-id='95e97e5e' name='af'/>
      <return type-id='556b8b92'/>
    </function-decl>
    <function-decl name='gethostbyname' mangled-name='gethostbyname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gethostbyname@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='556b8b92'/>
    </function-decl>
    <function-decl name='gethostbyname2' mangled-name='gethostbyname2' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gethostbyname2@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='95e97e5e' name='af'/>
      <return type-id='556b8b92'/>
    </function-decl>
    <function-decl name='gethostbyname_r' mangled-name='gethostbyname_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gethostbyname_r@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='556b8b92' name='hp'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <parameter type-id='304cf2a8' name='result'/>
      <parameter type-id='7292109c' name='errorp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='gethostent' mangled-name='gethostent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gethostent@@LIBC'>
      <return type-id='556b8b92'/>
    </function-decl>
    <function-decl name='gethostname' mangled-name='gethostname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gethostname@@LIBC'>
      <parameter type-id='26a90f95' name='name'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getline' mangled-name='getline' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getline@@LIBC'>
      <parameter type-id='9b23c9ad' name='buf'/>
      <parameter type-id='78c01427' name='len'/>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='getlogin' mangled-name='getlogin' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getlogin@@LIBC'>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='getmntent' mangled-name='getmntent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getmntent@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='b6b61d2f'/>
    </function-decl>
    <function-decl name='getnameinfo' mangled-name='getnameinfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getnameinfo@@LIBC'>
      <parameter type-id='baac96cf' name='sa'/>
      <parameter type-id='6b2697b0' name='salen'/>
      <parameter type-id='26a90f95' name='host'/>
      <parameter type-id='b59d7dce' name='hostlen'/>
      <parameter type-id='26a90f95' name='serv'/>
      <parameter type-id='b59d7dce' name='servlen'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getnetbyaddr' mangled-name='getnetbyaddr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getnetbyaddr@@LIBC'>
      <parameter type-id='8f92235e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='769f5205'/>
    </function-decl>
    <function-decl name='getnetbyname' mangled-name='getnetbyname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getnetbyname@@LIBC'>
      <parameter type-id='80f4b756'/>
      <return type-id='769f5205'/>
    </function-decl>
    <function-decl name='getopt' mangled-name='getopt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getopt@@LIBC'>
      <parameter type-id='95e97e5e' name='nargc'/>
      <parameter type-id='f319fae0' name='nargv'/>
      <parameter type-id='80f4b756' name='options'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getopt_long' mangled-name='getopt_long' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getopt_long@@LIBC'>
      <parameter type-id='95e97e5e' name='nargc'/>
      <parameter type-id='f319fae0' name='nargv'/>
      <parameter type-id='80f4b756' name='options'/>
      <parameter type-id='df0d999d' name='long_options'/>
      <parameter type-id='7292109c' name='idx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getopt_long_only' mangled-name='getopt_long_only' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getopt_long_only@@LIBC'>
      <parameter type-id='95e97e5e' name='nargc'/>
      <parameter type-id='f319fae0' name='nargv'/>
      <parameter type-id='80f4b756' name='options'/>
      <parameter type-id='df0d999d' name='long_options'/>
      <parameter type-id='7292109c' name='idx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getpgrp' mangled-name='getpgrp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpgrp@@LIBC'>
      <return type-id='587f89d2'/>
    </function-decl>
    <function-decl name='getpid' mangled-name='getpid' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpid@@LIBC'>
      <return type-id='587f89d2'/>
    </function-decl>
    <function-decl name='getpriority' mangled-name='getpriority' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpriority@@LIBC'>
      <parameter type-id='95e97e5e' name='which'/>
      <parameter type-id='05d99cca' name='who'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getprotobyname' mangled-name='getprotobyname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getprotobyname@@LIBC'>
      <parameter type-id='80f4b756'/>
      <return type-id='11a9f084'/>
    </function-decl>
    <function-decl name='getprotobynumber' mangled-name='getprotobynumber' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getprotobynumber@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <return type-id='11a9f084'/>
    </function-decl>
    <function-decl name='getpt' mangled-name='getpt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpt@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getpwnam' mangled-name='getpwnam' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpwnam@@LIBC'>
      <parameter type-id='80f4b756' name='login'/>
      <return type-id='a195f4a3'/>
    </function-decl>
    <function-decl name='getpwnam_r' mangled-name='getpwnam_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpwnam_r@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='a195f4a3' name='pwd'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='byte_count'/>
      <parameter type-id='e80ff3ab' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getpwuid' mangled-name='getpwuid' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpwuid@@LIBC'>
      <parameter type-id='354978ed' name='uid'/>
      <return type-id='a195f4a3'/>
    </function-decl>
    <function-decl name='getpwuid_r' mangled-name='getpwuid_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getpwuid_r@@LIBC'>
      <parameter type-id='354978ed' name='uid'/>
      <parameter type-id='a195f4a3' name='pwd'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='byte_count'/>
      <parameter type-id='e80ff3ab' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='gets' mangled-name='gets' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gets@@LIBC'>
      <parameter type-id='26a90f95' name='buf'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='getservbyname' mangled-name='getservbyname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getservbyname@@LIBC'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='proto'/>
      <return type-id='4b94036c'/>
    </function-decl>
    <function-decl name='getservbyport' mangled-name='getservbyport' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getservbyport@@LIBC'>
      <parameter type-id='95e97e5e' name='port'/>
      <parameter type-id='80f4b756' name='proto'/>
      <return type-id='4b94036c'/>
    </function-decl>
    <function-decl name='getservent' mangled-name='getservent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getservent@@LIBC'>
      <return type-id='4b94036c'/>
    </function-decl>
    <function-decl name='gettid' mangled-name='gettid' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gettid@@LIBC'>
      <return type-id='587f89d2'/>
    </function-decl>
    <function-decl name='gettimeofday' mangled-name='gettimeofday' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gettimeofday@@LIBC'>
      <parameter type-id='896f1b83' name='tv'/>
      <parameter type-id='cab52998' name='tz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getutent' mangled-name='getutent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getutent@@LIBC'>
      <return type-id='45361809'/>
    </function-decl>
    <function-decl name='getwc' mangled-name='getwc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getwc@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='getwchar' mangled-name='getwchar' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='getwchar@@LIBC'>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='gmtime' mangled-name='gmtime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gmtime@@LIBC'>
      <parameter type-id='9f201474' name='timep'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='gmtime64' mangled-name='gmtime64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gmtime64@@LIBC'>
      <parameter type-id='677def82' name='time'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='gmtime64_r' mangled-name='gmtime64_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gmtime64_r@@LIBC'>
      <parameter type-id='677def82' name='in_time'/>
      <parameter type-id='d915a820' name='p'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='gmtime_r' mangled-name='gmtime_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='gmtime_r@@LIBC'>
      <parameter type-id='9f201474' name='timep'/>
      <parameter type-id='d915a820' name='tmp'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='herror' mangled-name='herror' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='herror@@LIBC'>
      <parameter type-id='80f4b756' name='s'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hstrerror' mangled-name='hstrerror' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='hstrerror@@LIBC'>
      <parameter type-id='95e97e5e' name='err'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='if_indextoname' mangled-name='if_indextoname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='if_indextoname@@LIBC'>
      <parameter type-id='f0981eeb' name='ifindex'/>
      <parameter type-id='26a90f95' name='ifname'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='if_nametoindex' mangled-name='if_nametoindex' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='if_nametoindex@@LIBC'>
      <parameter type-id='80f4b756' name='ifname'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='imaxabs' mangled-name='imaxabs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='imaxabs@@LIBC'>
      <parameter type-id='e104d842' name='j'/>
      <return type-id='e104d842'/>
    </function-decl>
    <function-decl name='imaxdiv' mangled-name='imaxdiv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='imaxdiv@@LIBC'>
      <parameter type-id='e104d842' name='num'/>
      <parameter type-id='e104d842' name='denom'/>
      <return type-id='5c0b4dc9'/>
    </function-decl>
    <function-decl name='inet_addr' mangled-name='inet_addr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inet_addr@@LIBC'>
      <parameter type-id='80f4b756' name='cp'/>
      <return type-id='f8234714'/>
    </function-decl>
    <function-decl name='inet_aton' mangled-name='inet_aton' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inet_aton@@LIBC'>
      <parameter type-id='80f4b756' name='cp'/>
      <parameter type-id='1d895792' name='addr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inet_nsap_addr' mangled-name='inet_nsap_addr' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inet_nsap_addr@@LIBC'>
      <parameter type-id='80f4b756' name='ascii'/>
      <parameter type-id='93d633bd' name='binary'/>
      <parameter type-id='95e97e5e' name='maxlen'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='inet_nsap_ntoa' mangled-name='inet_nsap_ntoa' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inet_nsap_ntoa@@LIBC'>
      <parameter type-id='95e97e5e' name='binlen'/>
      <parameter type-id='2102bd36' name='binary'/>
      <parameter type-id='26a90f95' name='ascii'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='inet_ntoa' mangled-name='inet_ntoa' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inet_ntoa@@LIBC'>
      <parameter type-id='34f03654' name='in'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='inet_ntop' mangled-name='inet_ntop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inet_ntop@@LIBC'>
      <parameter type-id='95e97e5e' name='af'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='6b2697b0' name='size'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='inet_pton' mangled-name='inet_pton' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inet_pton@@LIBC'>
      <parameter type-id='95e97e5e' name='af'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='eaa32e2f' name='dst'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='initgroups' mangled-name='initgroups' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='initgroups@@LIBC'>
      <parameter type-id='80f4b756' name='user'/>
      <parameter type-id='2bb2b96f' name='group'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='inotify_init' mangled-name='inotify_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='inotify_init@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ioctl' mangled-name='ioctl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ioctl@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='95e97e5e' name='cmd'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isalnum' mangled-name='isalnum' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isalnum@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isalpha' mangled-name='isalpha' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isalpha@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isascii' mangled-name='isascii' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isascii@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isatty@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isblank' mangled-name='isblank' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isblank@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iscntrl' mangled-name='iscntrl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iscntrl@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isdigit' mangled-name='isdigit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isdigit@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isgraph' mangled-name='isgraph' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isgraph@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='islower' mangled-name='islower' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='islower@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isprint' mangled-name='isprint' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isprint@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ispunct' mangled-name='ispunct' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ispunct@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isspace' mangled-name='isspace' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isspace@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isupper' mangled-name='isupper' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isupper@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswalnum' mangled-name='iswalnum' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswalnum@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswalpha' mangled-name='iswalpha' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswalpha@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswcntrl' mangled-name='iswcntrl' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswcntrl@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswctype' mangled-name='iswctype' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswctype@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <parameter type-id='ba50424d' name='char_class'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswdigit' mangled-name='iswdigit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswdigit@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswgraph' mangled-name='iswgraph' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswgraph@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswlower' mangled-name='iswlower' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswlower@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswprint' mangled-name='iswprint' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswprint@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswpunct' mangled-name='iswpunct' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswpunct@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswspace' mangled-name='iswspace' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswspace@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswupper' mangled-name='iswupper' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswupper@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswxdigit' mangled-name='iswxdigit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='iswxdigit@@LIBC'>
      <parameter type-id='6dd37369' name='wc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='isxdigit' mangled-name='isxdigit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='isxdigit@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='jrand48' mangled-name='jrand48' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='jrand48@@LIBC'>
      <parameter type-id='e9e550dd' name='xseed'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='killpg' mangled-name='killpg' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='killpg@@LIBC'>
      <parameter type-id='587f89d2' name='tid'/>
      <parameter type-id='95e97e5e' name='sig'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='labs' mangled-name='labs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='labs@@LIBC'>
      <parameter type-id='bd54fe1a' name='j'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='lchown' mangled-name='lchown' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='lchown@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='354978ed' name='uid'/>
      <parameter type-id='2bb2b96f' name='gid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ldexp' mangled-name='ldexp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ldexp@@LIBC'>
      <parameter type-id='a0eb0f08' name='x'/>
      <parameter type-id='95e97e5e' name='n'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='ldiv' mangled-name='ldiv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ldiv@@LIBC'>
      <parameter type-id='bd54fe1a' name='num'/>
      <parameter type-id='bd54fe1a' name='denom'/>
      <return type-id='30397bf8'/>
    </function-decl>
    <function-decl name='link' mangled-name='link' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='link@@LIBC'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='llabs' mangled-name='llabs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='llabs@@LIBC'>
      <parameter type-id='1eb56b1e' name='j'/>
      <return type-id='1eb56b1e'/>
    </function-decl>
    <function-decl name='lldiv' mangled-name='lldiv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='lldiv@@LIBC'>
      <parameter type-id='1eb56b1e' name='num'/>
      <parameter type-id='1eb56b1e' name='denom'/>
      <return type-id='f5fa3b34'/>
    </function-decl>
    <function-decl name='localtime' mangled-name='localtime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='localtime@@LIBC'>
      <parameter type-id='9f201474' name='timep'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='localtime64' mangled-name='localtime64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='localtime64@@LIBC'>
      <parameter type-id='677def82' name='time'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='localtime64_r' mangled-name='localtime64_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='localtime64_r@@LIBC'>
      <parameter type-id='677def82' name='time'/>
      <parameter type-id='d915a820' name='local_tm'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='localtime_r' mangled-name='localtime_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='localtime_r@@LIBC'>
      <parameter type-id='9f201474' name='timep'/>
      <parameter type-id='d915a820' name='tmp'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='lrand48' mangled-name='lrand48' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='lrand48@@LIBC'>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='lseek64' mangled-name='lseek64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='lseek64@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='05d4c620' name='off'/>
      <parameter type-id='95e97e5e' name='whence'/>
      <return type-id='05d4c620'/>
    </function-decl>
    <function-decl name='lstat' mangled-name='lstat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='lstat@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='4330df87' name='sb'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='mallinfo' mangled-name='mallinfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mallinfo@@LIBC'>
      <return type-id='2acba5a7'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='malloc@@LIBC'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='malloc_usable_size' mangled-name='malloc_usable_size' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='malloc_usable_size@@LIBC'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mbrlen' mangled-name='mbrlen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mbrlen@@LIBC'>
      <parameter type-id='9d26089a' name='s'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='03aaab72' name='ps'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mbrtowc' mangled-name='mbrtowc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mbrtowc@@LIBC'>
      <parameter type-id='323d93c1' name='pwc'/>
      <parameter type-id='80f4b756' name='s'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='a68021ce' name='ps'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mbsinit' mangled-name='mbsinit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mbsinit@@LIBC'>
      <parameter type-id='5d006ebf' name='ps'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='mbsrtowcs' mangled-name='mbsrtowcs' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mbsrtowcs@@LIBC'>
      <parameter type-id='323d93c1' name='dst'/>
      <parameter type-id='7d3cd834' name='src'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='a68021ce' name='ps'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='memalign' mangled-name='memalign' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='memalign@@LIBC'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='memccpy' mangled-name='memccpy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='memccpy@@LIBC'>
      <parameter type-id='eaa32e2f' name='t'/>
      <parameter type-id='eaa32e2f' name='f'/>
      <parameter type-id='95e97e5e' name='c'/>
      <parameter type-id='b59d7dce' name='n'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='memcpy_resolver' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='memcpy@@LIBC'>
      <parameter type-id='7359adad' name='hwcap'/>
      <return type-id='3a476383'/>
    </function-decl>
    <function-decl name='memmem' mangled-name='memmem' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='memmem@@LIBC'>
      <parameter type-id='eaa32e2f' name='h0'/>
      <parameter type-id='b59d7dce' name='k'/>
      <parameter type-id='eaa32e2f' name='n0'/>
      <parameter type-id='b59d7dce' name='l'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='memmove_resolver' mangled-name='memmove' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='memmove@@LIBC'>
      <parameter type-id='7359adad' name='hwcap'/>
      <return type-id='6f5dd1b0'/>
    </function-decl>
    <function-decl name='memset_resolver' mangled-name='memset' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='memset@@LIBC'>
      <parameter type-id='7359adad' name='hwcap'/>
      <return type-id='1afef1c1'/>
    </function-decl>
    <function-decl name='mkdir' mangled-name='mkdir' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mkdir@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='d50d396c' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='mkdtemp' mangled-name='mkdtemp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mkdtemp@@LIBC'>
      <parameter type-id='26a90f95' name='path'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='mknod' mangled-name='mknod' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mknod@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='d50d396c' name='mode'/>
      <parameter type-id='8504f260' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='mktime' mangled-name='mktime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mktime@@LIBC'>
      <parameter type-id='d915a820' name='tmp'/>
      <return type-id='c9d12d66'/>
    </function-decl>
    <function-decl name='mktime64' mangled-name='mktime64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mktime64@@LIBC'>
      <parameter type-id='d6ad37ff' name='input_date'/>
      <return type-id='1afd27ac'/>
    </function-decl>
    <function-decl name='mmap' mangled-name='mmap' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mmap@@LIBC'>
      <parameter type-id='eaa32e2f' name='addr'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='95e97e5e' name='prot'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='ad707ada' name='offset'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='mrand48' mangled-name='mrand48' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mrand48@@LIBC'>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='mremap' mangled-name='mremap' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='mremap@@LIBC'>
      <parameter type-id='eaa32e2f' name='old_address'/>
      <parameter type-id='b59d7dce' name='old_size'/>
      <parameter type-id='b59d7dce' name='new_size'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter is-variadic='yes'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='nftw' mangled-name='nftw' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='nftw@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='e5411fa7' name='nftw_fn'/>
      <parameter type-id='95e97e5e' name='nfds'/>
      <parameter type-id='95e97e5e' name='nftw_flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nice' mangled-name='nice' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='nice@@LIBC'>
      <parameter type-id='95e97e5e' name='incr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nrand48' mangled-name='nrand48' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='nrand48@@LIBC'>
      <parameter type-id='e9e550dd' name='xseed'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='nsdispatch' mangled-name='nsdispatch' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='nsdispatch@@LIBC'>
      <parameter type-id='eaa32e2f' name='retval'/>
      <parameter type-id='d4c8e533' name='disp_tab'/>
      <parameter type-id='80f4b756' name='database'/>
      <parameter type-id='80f4b756' name='method'/>
      <parameter type-id='ce3c8d24' name='defaults'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='open' mangled-name='open' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='open@@LIBC'>
      <parameter type-id='80f4b756' name='pathname'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='openat' mangled-name='openat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='openat@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='80f4b756' name='pathname'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='opendir' mangled-name='opendir' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='opendir@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='f09217ba'/>
    </function-decl>
    <function-decl name='openlog' mangled-name='openlog' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='openlog@@LIBC'>
      <parameter type-id='80f4b756' name='log_tag'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='optarg' type-id='26a90f95' mangled-name='optarg' visibility='default' elf-symbol-id='optarg@@LIBC'/>
    <var-decl name='opterr' type-id='95e97e5e' mangled-name='opterr' visibility='default' elf-symbol-id='opterr@@LIBC'/>
    <var-decl name='optind' type-id='95e97e5e' mangled-name='optind' visibility='default' elf-symbol-id='optind@@LIBC'/>
    <var-decl name='optopt' type-id='95e97e5e' mangled-name='optopt' visibility='default' elf-symbol-id='optopt@@LIBC'/>
    <var-decl name='optreset' type-id='95e97e5e' mangled-name='optreset' visibility='default' elf-symbol-id='optreset@@LIBC'/>
    <function-decl name='pathconf' mangled-name='pathconf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pathconf@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='95e97e5e' name='name'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='pause' mangled-name='pause' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pause@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pclose' mangled-name='pclose' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pclose@@LIBC'>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='perror' mangled-name='perror' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='perror@@LIBC'>
      <parameter type-id='80f4b756' name='msg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pipe' mangled-name='pipe' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pipe@@LIBC'>
      <parameter type-id='7292109c' name='pipefd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pipe2' mangled-name='pipe2' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pipe2@@LIBC'>
      <parameter type-id='7292109c' name='pipefd'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='poll' mangled-name='poll' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='poll@@LIBC'>
      <parameter type-id='3ac36db0' name='fds'/>
      <parameter type-id='555eef66' name='fd_count'/>
      <parameter type-id='95e97e5e' name='ms'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='popen' mangled-name='popen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='popen@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='80f4b756' name='mode'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='posix_memalign' mangled-name='posix_memalign' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='posix_memalign@@LIBC'>
      <parameter type-id='63e171df'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pread' mangled-name='pread' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pread@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='ad707ada'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='printf' mangled-name='printf' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='printf@@LIBC'>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pselect' mangled-name='pselect' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pselect@@LIBC'>
      <parameter type-id='95e97e5e' name='fd_count'/>
      <parameter type-id='e172b126' name='read_fds'/>
      <parameter type-id='e172b126' name='write_fds'/>
      <parameter type-id='e172b126' name='error_fds'/>
      <parameter type-id='e05e8614' name='ts'/>
      <parameter type-id='f1ef6e5a' name='ss'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='psiginfo' mangled-name='psiginfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='psiginfo@@LIBC'>
      <parameter type-id='70389988' name='si'/>
      <parameter type-id='80f4b756' name='s'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='psignal' mangled-name='psignal' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='psignal@@LIBC'>
      <parameter type-id='95e97e5e' name='sig'/>
      <parameter type-id='80f4b756' name='s'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pthread_atfork' mangled-name='pthread_atfork' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_atfork@@LIBC'>
      <parameter type-id='953b12f8' name='prepare'/>
      <parameter type-id='953b12f8' name='parent'/>
      <parameter type-id='953b12f8' name='child'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' mangled-name='pthread_attr_destroy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_destroy@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getdetachstate' mangled-name='pthread_attr_getdetachstate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_getdetachstate@@LIBC'>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='7292109c' name='flag'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getguardsize' mangled-name='pthread_attr_getguardsize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_getguardsize@@LIBC'>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='78c01427' name='stack_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedparam' mangled-name='pthread_attr_getschedparam' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_getschedparam@@LIBC'>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='23cbcb08' name='param'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedpolicy' mangled-name='pthread_attr_getschedpolicy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_getschedpolicy@@LIBC'>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='7292109c' name='flag'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getscope' mangled-name='pthread_attr_getscope' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_getscope@@LIBC'>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='7292109c' name='flag'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getstack' mangled-name='pthread_attr_getstack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_getstack@@LIBC'>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='63e171df' name='stack_base'/>
      <parameter type-id='78c01427' name='stack_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getstacksize' mangled-name='pthread_attr_getstacksize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_getstacksize@@LIBC'>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='78c01427' name='stack_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_init' mangled-name='pthread_attr_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_init@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' mangled-name='pthread_attr_setdetachstate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_setdetachstate@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <parameter type-id='95e97e5e' name='flag'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setguardsize' mangled-name='pthread_attr_setguardsize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_setguardsize@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <parameter type-id='b59d7dce' name='stack_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedparam' mangled-name='pthread_attr_setschedparam' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_setschedparam@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <parameter type-id='36fca399' name='param'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedpolicy' mangled-name='pthread_attr_setschedpolicy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_setschedpolicy@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <parameter type-id='95e97e5e' name='flag'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setscope' mangled-name='pthread_attr_setscope' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_setscope@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <parameter type-id='95e97e5e' name='flag'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setstack' mangled-name='pthread_attr_setstack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_setstack@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <parameter type-id='eaa32e2f' name='stack_base'/>
      <parameter type-id='b59d7dce' name='stack_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setstacksize' mangled-name='pthread_attr_setstacksize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_attr_setstacksize@@LIBC'>
      <parameter type-id='7347a39e' name='attr'/>
      <parameter type-id='b59d7dce' name='stack_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' mangled-name='pthread_cond_broadcast' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_broadcast@@LIBC'>
      <parameter type-id='db285b03'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_destroy' mangled-name='pthread_cond_destroy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_destroy@@LIBC'>
      <parameter type-id='db285b03'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_init' mangled-name='pthread_cond_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_init@@LIBC'>
      <parameter type-id='db285b03' name='cond_interface'/>
      <parameter type-id='a7e325e5' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' mangled-name='pthread_cond_signal' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_signal@@LIBC'>
      <parameter type-id='db285b03'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait' mangled-name='pthread_cond_timedwait' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_timedwait@@LIBC'>
      <parameter type-id='db285b03' name='cond_interface'/>
      <parameter type-id='18c91f9e' name='mutex'/>
      <parameter type-id='e05e8614' name='abstime'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait_monotonic' mangled-name='pthread_cond_timedwait_monotonic' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_timedwait_monotonic@@LIBC'>
      <parameter type-id='db285b03' name='cond_interface'/>
      <parameter type-id='18c91f9e' name='mutex'/>
      <parameter type-id='e05e8614' name='abstime'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait_monotonic_np' mangled-name='pthread_cond_timedwait_monotonic_np' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_timedwait_monotonic_np@@LIBC'>
      <parameter type-id='db285b03' name='cond_interface'/>
      <parameter type-id='18c91f9e' name='mutex'/>
      <parameter type-id='e05e8614' name='abstime'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait_relative_np' mangled-name='pthread_cond_timedwait_relative_np' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_timedwait_relative_np@@LIBC'>
      <parameter type-id='db285b03' name='cond_interface'/>
      <parameter type-id='18c91f9e' name='mutex'/>
      <parameter type-id='e05e8614' name='abstime'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_timeout_np' mangled-name='pthread_cond_timeout_np' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_timeout_np@@LIBC'>
      <parameter type-id='db285b03' name='cond_interface'/>
      <parameter type-id='18c91f9e' name='mutex'/>
      <parameter type-id='f0981eeb' name='ms'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' mangled-name='pthread_cond_wait' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_cond_wait@@LIBC'>
      <parameter type-id='db285b03' name='cond_interface'/>
      <parameter type-id='18c91f9e' name='mutex'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_condattr_destroy' mangled-name='pthread_condattr_destroy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_condattr_destroy@@LIBC'>
      <parameter type-id='45bc197e' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_condattr_getpshared' mangled-name='pthread_condattr_getpshared' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_condattr_getpshared@@LIBC'>
      <parameter type-id='a7e325e5' name='attr'/>
      <parameter type-id='7292109c' name='pshared'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_condattr_init' mangled-name='pthread_condattr_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_condattr_init@@LIBC'>
      <parameter type-id='45bc197e' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_condattr_setpshared' mangled-name='pthread_condattr_setpshared' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_condattr_setpshared@@LIBC'>
      <parameter type-id='45bc197e' name='attr'/>
      <parameter type-id='95e97e5e' name='pshared'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_create' mangled-name='pthread_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_create@@LIBC'>
      <parameter type-id='e01b5462' name='thread_out'/>
      <parameter type-id='540db505' name='attr'/>
      <parameter type-id='5ad9edb6' name='start_routine'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_detach' mangled-name='pthread_detach' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_detach@@LIBC'>
      <parameter type-id='4051f5e7' name='t'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_equal' mangled-name='pthread_equal' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_equal@@LIBC'>
      <parameter type-id='4051f5e7'/>
      <parameter type-id='4051f5e7'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_exit' mangled-name='pthread_exit' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_exit@@LIBC'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pthread_getattr_np' mangled-name='pthread_getattr_np' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_getattr_np@@LIBC'>
      <parameter type-id='4051f5e7' name='t'/>
      <parameter type-id='7347a39e' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_getcpuclockid' mangled-name='pthread_getcpuclockid' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_getcpuclockid@@LIBC'>
      <parameter type-id='4051f5e7' name='t'/>
      <parameter type-id='6f92701b' name='clockid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_getschedparam' mangled-name='pthread_getschedparam' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_getschedparam@@LIBC'>
      <parameter type-id='4051f5e7' name='t'/>
      <parameter type-id='7292109c' name='policy'/>
      <parameter type-id='23cbcb08' name='param'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_getspecific' mangled-name='pthread_getspecific' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_getspecific@@LIBC'>
      <parameter type-id='2de5383b'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='pthread_join' mangled-name='pthread_join' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_join@@LIBC'>
      <parameter type-id='4051f5e7'/>
      <parameter type-id='63e171df'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_key_create' mangled-name='pthread_key_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_key_create@@LIBC'>
      <parameter type-id='ce04b822'/>
      <parameter type-id='b7f9d8e6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_key_delete' mangled-name='pthread_key_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_key_delete@@LIBC'>
      <parameter type-id='2de5383b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_kill' mangled-name='pthread_kill' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_kill@@LIBC'>
      <parameter type-id='4051f5e7' name='t'/>
      <parameter type-id='95e97e5e' name='sig'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' mangled-name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutex_destroy@@LIBC'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' mangled-name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutex_init@@LIBC'>
      <parameter type-id='18c91f9e'/>
      <parameter type-id='c2afbd7e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutex_lock@@LIBC'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock_timeout_np' mangled-name='pthread_mutex_lock_timeout_np' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutex_lock_timeout_np@@LIBC'>
      <parameter type-id='18c91f9e' name='mutex_interface'/>
      <parameter type-id='f0981eeb' name='ms'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_trylock' mangled-name='pthread_mutex_trylock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutex_trylock@@LIBC'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_destroy' mangled-name='pthread_mutexattr_destroy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutexattr_destroy@@LIBC'>
      <parameter type-id='8cc71127' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_getpshared' mangled-name='pthread_mutexattr_getpshared' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutexattr_getpshared@@LIBC'>
      <parameter type-id='c2afbd7e' name='attr'/>
      <parameter type-id='7292109c' name='type_p'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_gettype' mangled-name='pthread_mutexattr_gettype' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutexattr_gettype@@LIBC'>
      <parameter type-id='c2afbd7e' name='attr'/>
      <parameter type-id='7292109c' name='type_p'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_init' mangled-name='pthread_mutexattr_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutexattr_init@@LIBC'>
      <parameter type-id='8cc71127' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_setpshared' mangled-name='pthread_mutexattr_setpshared' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutexattr_setpshared@@LIBC'>
      <parameter type-id='8cc71127' name='attr'/>
      <parameter type-id='95e97e5e' name='type'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_settype' mangled-name='pthread_mutexattr_settype' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_mutexattr_settype@@LIBC'>
      <parameter type-id='8cc71127' name='attr'/>
      <parameter type-id='95e97e5e' name='type'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_once' mangled-name='pthread_once' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_once@@LIBC'>
      <parameter type-id='d9bab700'/>
      <parameter type-id='953b12f8'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_destroy' mangled-name='pthread_rwlock_destroy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_destroy@@LIBC'>
      <parameter type-id='a6210c87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_init' mangled-name='pthread_rwlock_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_init@@LIBC'>
      <parameter type-id='a6210c87' name='rwlock_interface'/>
      <parameter type-id='fc5edc31' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_rdlock' mangled-name='pthread_rwlock_rdlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_rdlock@@LIBC'>
      <parameter type-id='a6210c87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_timedrdlock' mangled-name='pthread_rwlock_timedrdlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_timedrdlock@@LIBC'>
      <parameter type-id='a6210c87' name='rwlock_interface'/>
      <parameter type-id='e05e8614' name='abs_timeout'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_timedwrlock' mangled-name='pthread_rwlock_timedwrlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_timedwrlock@@LIBC'>
      <parameter type-id='a6210c87' name='rwlock_interface'/>
      <parameter type-id='e05e8614' name='abs_timeout'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_tryrdlock' mangled-name='pthread_rwlock_tryrdlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_tryrdlock@@LIBC'>
      <parameter type-id='a6210c87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_trywrlock' mangled-name='pthread_rwlock_trywrlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_trywrlock@@LIBC'>
      <parameter type-id='a6210c87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_unlock' mangled-name='pthread_rwlock_unlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_unlock@@LIBC'>
      <parameter type-id='a6210c87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlock_wrlock' mangled-name='pthread_rwlock_wrlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlock_wrlock@@LIBC'>
      <parameter type-id='a6210c87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_destroy' mangled-name='pthread_rwlockattr_destroy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlockattr_destroy@@LIBC'>
      <parameter type-id='128de512' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_getpshared' mangled-name='pthread_rwlockattr_getpshared' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlockattr_getpshared@@LIBC'>
      <parameter type-id='fc5edc31' name='attr'/>
      <parameter type-id='7292109c' name='pshared'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_init' mangled-name='pthread_rwlockattr_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlockattr_init@@LIBC'>
      <parameter type-id='128de512' name='attr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_setpshared' mangled-name='pthread_rwlockattr_setpshared' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_rwlockattr_setpshared@@LIBC'>
      <parameter type-id='128de512' name='attr'/>
      <parameter type-id='95e97e5e' name='pshared'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_self' mangled-name='pthread_self' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_self@@LIBC'>
      <return type-id='4051f5e7'/>
    </function-decl>
    <function-decl name='pthread_setname_np' mangled-name='pthread_setname_np' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_setname_np@@LIBC'>
      <parameter type-id='4051f5e7' name='t'/>
      <parameter type-id='80f4b756' name='thread_name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_setschedparam' mangled-name='pthread_setschedparam' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_setschedparam@@LIBC'>
      <parameter type-id='4051f5e7' name='t'/>
      <parameter type-id='95e97e5e' name='policy'/>
      <parameter type-id='36fca399' name='param'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_setspecific' mangled-name='pthread_setspecific' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_setspecific@@LIBC'>
      <parameter type-id='2de5383b' name='key'/>
      <parameter type-id='eaa32e2f' name='ptr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_sigmask' mangled-name='pthread_sigmask' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pthread_sigmask@@LIBC'>
      <parameter type-id='95e97e5e' name='how'/>
      <parameter type-id='f1ef6e5a' name='new_set'/>
      <parameter type-id='9e80f729' name='old_set'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ptrace' mangled-name='ptrace' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ptrace@@LIBC'>
      <parameter type-id='95e97e5e' name='req'/>
      <parameter is-variadic='yes'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='ptsname' mangled-name='ptsname' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ptsname@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='ptsname_r' mangled-name='ptsname_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ptsname_r@@LIBC'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putc' mangled-name='putc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putc@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putc_unlocked' mangled-name='putc_unlocked' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putc_unlocked@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putchar' mangled-name='putchar' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putchar@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putchar_unlocked' mangled-name='putchar_unlocked' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putchar_unlocked@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putenv' mangled-name='putenv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putenv@@LIBC'>
      <parameter type-id='26a90f95' name='str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='puts@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pututline' mangled-name='pututline' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pututline@@LIBC'>
      <parameter type-id='606f2d4e'/>
      <return type-id='45361809'/>
    </function-decl>
    <function-decl name='putw' mangled-name='putw' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putw@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putwc' mangled-name='putwc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putwc@@LIBC'>
      <parameter type-id='c523b9f1' name='wc'/>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='putwchar' mangled-name='putwchar' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='putwchar@@LIBC'>
      <parameter type-id='c523b9f1' name='wc'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='pvalloc' mangled-name='pvalloc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pvalloc@@LIBC'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='pwrite' mangled-name='pwrite' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='pwrite@@LIBC'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='ad707ada'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='qsort' mangled-name='qsort' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='qsort@@LIBC'>
      <parameter type-id='eaa32e2f' name='a'/>
      <parameter type-id='b59d7dce' name='n'/>
      <parameter type-id='b59d7dce' name='es'/>
      <parameter type-id='111634da' name='cmp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='raise' mangled-name='raise' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='raise@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='readdir@@LIBC'>
      <parameter type-id='f09217ba' name='d'/>
      <return type-id='2e243169'/>
    </function-decl>
    <function-decl name='readdir_r' mangled-name='readdir_r' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='readdir_r@@LIBC'>
      <parameter type-id='f09217ba' name='d'/>
      <parameter type-id='2e243169' name='entry'/>
      <parameter type-id='e5f98c79' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='readlink' mangled-name='readlink' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='readlink@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='realloc' mangled-name='realloc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='realloc@@LIBC'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='realpath' mangled-name='realpath' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='realpath@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='26a90f95' name='result'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='reboot' mangled-name='reboot' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='reboot@@LIBC'>
      <parameter type-id='95e97e5e' name='__ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='recv' mangled-name='recv' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='recv@@LIBC'>
      <parameter type-id='95e97e5e' name='socket'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='recvmsg' mangled-name='recvmsg' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='recvmsg@@LIBC'>
      <parameter type-id='95e97e5e' name='__fd'/>
      <parameter type-id='6b9b777a' name='__msg'/>
      <parameter type-id='95e97e5e' name='__flags'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='regcomp' mangled-name='regcomp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='regcomp@@LIBC'>
      <parameter type-id='d33f11cb' name='preg'/>
      <parameter type-id='80f4b756' name='pattern'/>
      <parameter type-id='95e97e5e' name='cflags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='regerror' mangled-name='regerror' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='regerror@@LIBC'>
      <parameter type-id='95e97e5e' name='errcode'/>
      <parameter type-id='eed6c816' name='preg'/>
      <parameter type-id='26a90f95' name='errbuf'/>
      <parameter type-id='b59d7dce' name='errbuf_size'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='regexec@@LIBC'>
      <parameter type-id='eed6c816' name='preg'/>
      <parameter type-id='80f4b756' name='string'/>
      <parameter type-id='b59d7dce' name='nmatch'/>
      <parameter type-id='7e2979d5' name='pmatch'/>
      <parameter type-id='95e97e5e' name='eflags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='regfree' mangled-name='regfree' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='regfree@@LIBC'>
      <parameter type-id='d33f11cb' name='preg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='remove' mangled-name='remove' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='remove@@LIBC'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='rename' mangled-name='rename' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='rename@@LIBC'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='res_init' mangled-name='res_init' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='res_init@@LIBC'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='res_mkquery' mangled-name='res_mkquery' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='res_mkquery@@LIBC'>
      <parameter type-id='95e97e5e' name='op'/>
      <parameter type-id='80f4b756' name='dname'/>
      <parameter type-id='95e97e5e' name='klass'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='2102bd36' name='data'/>
      <parameter type-id='95e97e5e' name='datalen'/>
      <parameter type-id='2102bd36' name='newrr_in'/>
      <parameter type-id='93d633bd' name='buf'/>
      <parameter type-id='95e97e5e' name='buflen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
