<abi-corpus version='2.1' architecture='elf-arm' soname='libjnigraphics.so'>
  <elf-needed>
    <dependency name='libhwui.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libandroid.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AImageDecoderFrameInfo_create' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoderFrameInfo_delete' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoderFrameInfo_getBlendOp' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoderFrameInfo_getDisposeOp' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoderFrameInfo_getDuration' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoderFrameInfo_getFrameRect' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoderFrameInfo_hasAlphaWithinBounds' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoder_getFrameInfo' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AImageDecoder_setInternallyHandleDisposePrevious' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AndroidBitmap_getDataSpace' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AndroidBitmap_getInfo' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AndroidBitmap_lockPixels' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AndroidBitmap_unlockPixels' version='LIBJNIGRAPHICS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <class-decl name='AImageDecoder' is-struct='yes' visibility='default' is-declaration-only='yes' id='cdce5fc3'/>
    <class-decl name='AImageDecoderFrameInfo' is-struct='yes' visibility='default' is-declaration-only='yes' id='050fecd4'/>
    <class-decl name='ARect' size-in-bits='128' is-struct='yes' visibility='default' id='c9ee9172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='top' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bottom' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_JNIEnv' is-struct='yes' visibility='default' is-declaration-only='yes' id='c9459134'/>
    <class-decl name='_jobject' size-in-bits='8' visibility='default' id='baffb083'/>
    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' visibility='default' id='7f4b0f2b' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='width' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='height' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stride' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='format' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='AImageDecoderFrameInfo_create' mangled-name='AImageDecoderFrameInfo_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoderFrameInfo_create@@LIBJNIGRAPHICS'>
      <return type-id='3a5f0bc2'/>
    </function-decl>
    <function-decl name='AImageDecoderFrameInfo_delete' mangled-name='AImageDecoderFrameInfo_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoderFrameInfo_delete@@LIBJNIGRAPHICS'>
      <parameter type-id='3a5f0bc2' name='info'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AImageDecoderFrameInfo_getBlendOp' mangled-name='AImageDecoderFrameInfo_getBlendOp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoderFrameInfo_getBlendOp@@LIBJNIGRAPHICS'>
      <parameter type-id='e324d581' name='info'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AImageDecoderFrameInfo_getDisposeOp' mangled-name='AImageDecoderFrameInfo_getDisposeOp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoderFrameInfo_getDisposeOp@@LIBJNIGRAPHICS'>
      <parameter type-id='e324d581' name='info'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AImageDecoderFrameInfo_getDuration' mangled-name='AImageDecoderFrameInfo_getDuration' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoderFrameInfo_getDuration@@LIBJNIGRAPHICS'>
      <parameter type-id='e324d581' name='info'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AImageDecoderFrameInfo_getFrameRect' mangled-name='AImageDecoderFrameInfo_getFrameRect' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoderFrameInfo_getFrameRect@@LIBJNIGRAPHICS'>
      <parameter type-id='e324d581' name='info'/>
      <return type-id='d6dabff9'/>
    </function-decl>
    <function-decl name='AImageDecoderFrameInfo_hasAlphaWithinBounds' mangled-name='AImageDecoderFrameInfo_hasAlphaWithinBounds' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoderFrameInfo_hasAlphaWithinBounds@@LIBJNIGRAPHICS'>
      <parameter type-id='e324d581' name='info'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AImageDecoder_getFrameInfo' mangled-name='AImageDecoder_getFrameInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoder_getFrameInfo@@LIBJNIGRAPHICS'>
      <parameter type-id='f34b0223' name='decoder'/>
      <parameter type-id='3a5f0bc2' name='info'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AImageDecoder_setInternallyHandleDisposePrevious' mangled-name='AImageDecoder_setInternallyHandleDisposePrevious' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AImageDecoder_setInternallyHandleDisposePrevious@@LIBJNIGRAPHICS'>
      <parameter type-id='f34b0223' name='decoder'/>
      <parameter type-id='c894953d' name='handle'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AndroidBitmap_getDataSpace' mangled-name='AndroidBitmap_getDataSpace' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AndroidBitmap_getDataSpace@@LIBJNIGRAPHICS'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='jbitmap'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AndroidBitmap_getInfo' mangled-name='AndroidBitmap_getInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AndroidBitmap_getInfo@@LIBJNIGRAPHICS'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='jbitmap'/>
      <parameter type-id='f2910bdb' name='info'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AndroidBitmap_lockPixels' mangled-name='AndroidBitmap_lockPixels' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AndroidBitmap_lockPixels@@LIBJNIGRAPHICS'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='jbitmap'/>
      <parameter type-id='63e171df' name='addrPtr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AndroidBitmap_unlockPixels' mangled-name='AndroidBitmap_unlockPixels' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AndroidBitmap_unlockPixels@@LIBJNIGRAPHICS'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='jbitmap'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <pointer-type-def type-id='fe0dede1' size-in-bits='32' id='3a5f0bc2'/>
    <pointer-type-def type-id='baffb083' size-in-bits='32' id='478e3663'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <pointer-type-def type-id='1f9f8931' size-in-bits='32' id='e324d581'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <pointer-type-def type-id='0913ea1c' size-in-bits='32' id='f2910bdb'/>
    <pointer-type-def type-id='93b8437c' size-in-bits='32' id='f34b0223'/>
    <pointer-type-def type-id='d357872a' size-in-bits='32' id='fae49a1f'/>
    <qualified-type-def type-id='fe0dede1' const='yes' id='1f9f8931'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='AImageDecoder' type-id='cdce5fc3' id='93b8437c'/>
    <typedef-decl name='AImageDecoderFrameInfo' type-id='050fecd4' id='fe0dede1'/>
    <typedef-decl name='ARect' type-id='c9ee9172' id='d6dabff9'/>
    <typedef-decl name='AndroidBitmapInfo' type-id='7f4b0f2b' id='0913ea1c'/>
    <typedef-decl name='JNIEnv' type-id='c9459134' id='d357872a'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' id='0c9942d2'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <typedef-decl name='jobject' type-id='478e3663' id='96f3d089'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
  </abi-instr>
</abi-corpus>
