<abi-corpus version='2.1' architecture='elf-arm' soname='libneuralnetworks.so'>
  <elf-needed>
    <dependency name='libbinder_ndk.so'/>
    <dependency name='libcgrouprc.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libneuralnetworks_packageinfo.so'/>
    <dependency name='libnativewindow.so'/>
    <dependency name='libstatssocket.so'/>
    <dependency name='libvndksupport.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ANeuralNetworksBurst_create' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksBurst_free' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksCompilation_create' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksCompilation_createForDevices' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='ANeuralNetworksMemoryDesc_setDimensions' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksMemory_copy' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksMemory_createFromAHardwareBuffer' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksMemory_createFromDesc' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksMemory_createFromFd' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksMemory_free' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_addOperand' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_addOperation' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_create' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_finish' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_free' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_getSupportedOperationsForDevices' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_identifyInputsAndOutputs' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_relaxComputationFloat32toFloat16' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_setOperandSymmPerChannelQuantParams' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_setOperandValue' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_setOperandValueFromMemory' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworksModel_setOperandValueFromModel' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworks_getDefaultLoopTimeout' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworks_getDevice' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworks_getDeviceCount' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworks_getMaximumLoopTimeout' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANeuralNetworks_getRuntimeFeatureLevel' version='LIBNEURALNETWORKS' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <class-decl name='AHardwareBuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d45f31e'/>
    <class-decl name='ANeuralNetworksBurst' is-struct='yes' visibility='default' is-declaration-only='yes' id='791bc632'/>
    <class-decl name='ANeuralNetworksCompilation' is-struct='yes' visibility='default' is-declaration-only='yes' id='2c86133f'/>
    <class-decl name='ANeuralNetworksDevice' is-struct='yes' visibility='default' is-declaration-only='yes' id='a30f7f2e'/>
    <class-decl name='ANeuralNetworksEvent' is-struct='yes' visibility='default' is-declaration-only='yes' id='7498ddfc'/>
    <class-decl name='ANeuralNetworksExecution' is-struct='yes' visibility='default' is-declaration-only='yes' id='5a972942'/>
    <class-decl name='ANeuralNetworksMemory' is-struct='yes' visibility='default' is-declaration-only='yes' id='c6ecbc47'/>
    <class-decl name='ANeuralNetworksMemoryDesc' is-struct='yes' visibility='default' is-declaration-only='yes' id='449ba272'/>
    <class-decl name='ANeuralNetworksModel' is-struct='yes' visibility='default' is-declaration-only='yes' id='84de98b1'/>
    <class-decl name='ANeuralNetworksOperandType' size-in-bits='160' is-struct='yes' visibility='default' id='5c7593e1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dimensionCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dimensions' type-id='a6798dcc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='scale' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zeroPoint' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ANeuralNetworksSymmPerChannelQuantParams' size-in-bits='96' is-struct='yes' visibility='default' id='6276c741'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='channelDim' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='scaleCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scales' type-id='bc47ccdc' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='ANeuralNetworksBurst_create' mangled-name='ANeuralNetworksBurst_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksBurst_create@@LIBNEURALNETWORKS'>
      <parameter type-id='56144387' name='compilation'/>
      <parameter type-id='914b0c2e' name='burst'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ANeuralNetworksBurst_free' mangled-name='ANeuralNetworksBurst_free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksBurst_free@@LIBNEURALNETWORKS'>
      <parameter type-id='d9b497f0' name='burst'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANeuralNetworksCompilation_create' mangled-name='ANeuralNetworksCompilation_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksCompilation_create@@LIBNEURALNETWORKS'>
      <parameter type-id='32caa7f9' name='model'/>
      <parameter type-id='2ee68957' name='compilation'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ANeuralNetworksCompilation_createForDevices' mangled-name='ANeuralNetworksCompilation_createForDevices' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksCompilation_createForDevices@@LIBNEURALNETWORKS'>
      <parameter type-id='32caa7f9' name='model'/>
      <parameter type-id='e224e1c0' name='devices'/>
      <parameter type-id='8f92235e' name='numDevices'/>
      <parameter type-id='2ee68957' name='compilation'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ANeuralNetworksCompilation_finish' mangled-name='ANeuralNetworksCompilation_finish' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksCompilation_finish@@LIBNEURALNETWORKS'>
      <parameter type-id='56144387' name='compilation'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ANeuralNetworksCompilation_free' mangled-name='ANeuralNetworksCompilation_free' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksCompilation_free@@LIBNEURALNETWORKS'>
      <parameter type-id='56144387' name='compilation'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANeuralNetworksCompilation_getPreferredMemoryAlignmentForInput' mangled-name='ANeuralNetworksCompilation_getPreferredMemoryAlignmentForInput' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksCompilation_getPreferredMemoryAlignmentForInput@@LIBNEURALNETWORKS'>
      <parameter type-id='caa43910' name='compilation'/>
      <parameter type-id='8f92235e' name='index'/>
      <parameter type-id='90421557' name='alignment'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ANeuralNetworksCompilation_getPreferredMemoryAlignmentForOutput' mangled-name='ANeuralNetworksCompilation_getPreferredMemoryAlignmentForOutput' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksCompilation_getPreferredMemoryAlignmentForOutput@@LIBNEURALNETWORKS'>
      <parameter type-id='caa43910' name='compilation'/>
      <parameter type-id='8f92235e' name='index'/>
      <parameter type-id='90421557' name='alignment'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ANeuralNetworksCompilation_getPreferredMemoryPaddingForInput' mangled-name='ANeuralNetworksCompilation_getPreferredMemoryPaddingForInput' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANeuralNetworksCompilation_getPreferredMemoryPaddingForInput@@LIBNEURALNETWORKS'>
      <parameter type-id='caa43910' name='compilation'/>
      <parameter type-id='8f92235e' name='index'/>
