<abi-corpus version='2.1' architecture='elf-arm' soname='libz.so'>
  <elf-needed>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='adler32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='adler32_combine' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='adler32_combine64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='adler32_z' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='compress2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='compressBound' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='crc32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='crc32_combine' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gzgetc_' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzgets' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzoffset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzoffset64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzopen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzopen64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzputc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzputs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzrewind' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzseek' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzseek64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzsetparams' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gztell' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gztell64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzungetc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzvprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gzwrite' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateBack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateBackEnd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateBackInit_' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateCodesUsed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateCopy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateEnd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateGetDictionary' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateGetHeader' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateInit2_' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateInit_' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateMark' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflatePrime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateReset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateReset2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateResetKeep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateSetDictionary' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateSync' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateSyncPoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateUndermine' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='inflateValidate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uncompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uncompress2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zError' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zlibCompileFlags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zlibVersion' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C99' path='various'>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <class-decl name='gz_header_s' size-in-bits='416' is-struct='yes' visibility='default' id='05dd269e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='text' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='time' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xflags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='os' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='extra' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='extra_len' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='extra_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='name' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='comment' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='comm_max' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='hcrc' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='done' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uInt' type-id='f0981eeb' id='09110a74'/>
    <pointer-type-def type-id='dd662a32' size-in-bits='32' id='091656ff'/>
    <pointer-type-def type-id='e9af568a' size-in-bits='32' id='0a71128c'/>
    <array-type-def dimensions='1' type-id='e27d4b01' size-in-bits='1248' id='0aa0185d'>
      <subrange length='39' type-id='7ff19f0f' id='ae4a9561'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='60606410' size-in-bits='256' id='0f3e9c3e'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <class-decl name='static_tree_desc_s' is-struct='yes' visibility='default' is-declaration-only='yes' id='11f3905e'/>
    <class-decl name='internal_state' size-in-bits='47296' is-struct='yes' visibility='default' id='221461a6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='strm' type-id='fb4f8c25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='status' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pending_buf' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pending_buf_size' type-id='5f853356' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_out' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pending' type-id='5f853356' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wrap' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='gzhead' type-id='38aaa7b9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='gzindex' type-id='5f853356' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='method' type-id='efb9ba06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_flush' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='crc0' type-id='99977b0d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='w_size' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='w_bits' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='w_mask' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='window' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='window_size' type-id='5f853356' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='prev' type-id='77075c55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='head' type-id='77075c55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ins_h' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='hash_size' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='hash_bits' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='hash_mask' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='hash_shift' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='chromium_zlib_hash' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='block_start' type-id='bd54fe1a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='match_length' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='prev_match' type-id='c326a6df' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='match_available' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='strstart' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='match_start' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='lookahead' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='prev_length' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='max_chain_length' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='max_lazy_match' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='level' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='strategy' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='good_match' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='nice_match' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='dyn_ltree' type-id='447c6992' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20192'>
        <var-decl name='dyn_dtree' type-id='2a86dc5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22144'>
        <var-decl name='bl_tree' type-id='0aa0185d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23392'>
        <var-decl name='l_desc' type-id='f8a0d221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23488'>
        <var-decl name='d_desc' type-id='f8a0d221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23584'>
        <var-decl name='bl_desc' type-id='f8a0d221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23680'>
        <var-decl name='bl_count' type-id='0f3e9c3e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23936'>
        <var-decl name='heap' type-id='2750feef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42272'>
        <var-decl name='heap_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42304'>
        <var-decl name='heap_max' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42336'>
        <var-decl name='depth' type-id='70966dbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46944'>
        <var-decl name='sym_buf' type-id='091656ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46976'>
        <var-decl name='lit_bufsize' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47008'>
        <var-decl name='sym_next' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47040'>
        <var-decl name='sym_end' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47072'>
        <var-decl name='opt_len' type-id='5f853356' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47104'>
        <var-decl name='static_len' type-id='5f853356' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47136'>
        <var-decl name='matches' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47168'>
        <var-decl name='insert' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47200'>
        <var-decl name='bi_buf' type-id='60606410' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47232'>
        <var-decl name='bi_valid' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47264'>
        <var-decl name='high_water' type-id='5f853356' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gz_header' type-id='05dd269e' id='259cb173'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='18336' id='2750feef'>
      <subrange length='573' type-id='7ff19f0f' id='26f2308e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e27d4b01' size-in-bits='1952' id='2a86dc5a'>
      <subrange length='61' type-id='7ff19f0f' id='b51728a6'/>
    </array-type-def>
    <typedef-decl name='va_list' type-id='7f896fb4' id='2aee9912'/>
    <typedef-decl name='z_size_t' type-id='b59d7dce' id='2ecb4085'/>
    <pointer-type-def type-id='dec14004' size-in-bits='32' id='31c621cf'/>
    <typedef-decl name='static_tree_desc' type-id='11f3905e' id='34295ecd'/>
    <pointer-type-def type-id='ea86de29' size-in-bits='32' id='354f7eb9'/>
    <pointer-type-def type-id='59efae17' size-in-bits='32' id='369435a4'/>
    <typedef-decl name='gz_headerp' type-id='a0c92bba' id='38aaa7b9'/>
    <pointer-type-def type-id='221461a6' size-in-bits='32' id='3a49ee4c'/>
    <function-type size-in-bits='32' id='3bf9d798'>
      <parameter type-id='ba959244'/>
      <parameter type-id='09110a74'/>
      <parameter type-id='09110a74'/>
      <return type-id='ba959244'/>
    </function-type>
    <typedef-decl name='uch' type-id='002ac4a6' id='4088d420'/>
    <array-type-def dimensions='1' type-id='e27d4b01' size-in-bits='18336' id='447c6992'>
      <subrange length='573' type-id='7ff19f0f' id='26f2308e'/>
    </array-type-def>
    <typedef-decl name='gzFile' type-id='9149c942' id='45259bf7'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='c1606520' size-in-bits='32' id='4c667223'/>
    <typedef-decl name='uLongf' type-id='5bbcce85' id='4d39af59'/>
    <typedef-decl name='z_stream' type-id='d19a2f20' id='59efae17'/>
    <function-type size-in-bits='32' id='59f855e0'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7f244169'/>
      <return type-id='f0981eeb'/>
    </function-type>
    <typedef-decl name='uLong' type-id='7359adad' id='5bbcce85'/>
    <typedef-decl name='ulg' type-id='7359adad' id='5f853356'/>
    <class-decl name='__va_list' size-in-bits='32' is-struct='yes' visibility='default' id='5f919c1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__ap' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ush' type-id='8efea9e5' id='60606410'/>
    <typedef-decl name='Posf' type-id='f61da996' id='60b284d0'/>
    <pointer-type-def type-id='4d39af59' size-in-bits='32' id='60db3356'/>
    <pointer-type-def type-id='59f855e0' size-in-bits='32' id='65fedd12'/>
    <typedef-decl name='__kernel_long_t' type-id='bd54fe1a' id='6a11bd61'/>
    <array-type-def dimensions='1' type-id='4088d420' size-in-bits='4584' id='70966dbc'>
      <subrange length='573' type-id='7ff19f0f' id='26f2308e'/>
    </array-type-def>
    <pointer-type-def type-id='95e97e5e' size-in-bits='32' id='7292109c'/>
    <type-decl name='unsigned long int' size-in-bits='32' id='7359adad'/>
    <pointer-type-def type-id='60b284d0' size-in-bits='32' id='77075c55'/>
    <pointer-type-def type-id='354f7eb9' size-in-bits='32' id='7f244169'/>
    <typedef-decl name='__builtin_va_list' type-id='5f919c1f' id='7f896fb4'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <pointer-type-def type-id='f0981eeb' size-in-bits='32' id='807869d3'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <typedef-decl name='z_crc_t' type-id='f0981eeb' id='84c44388'/>
    <typedef-decl name='__kernel_off_t' type-id='6a11bd61' id='8dda407a'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <pointer-type-def type-id='fbc67d64' size-in-bits='32' id='9149c942'/>
    <pointer-type-def type-id='b42c11d8' size-in-bits='32' id='93603ff6'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <qualified-type-def type-id='34295ecd' const='yes' id='98f1e9dd'/>
    <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='640' id='99977b0d'>
      <subrange length='20' type-id='7ff19f0f' id='fdca39cf'/>
    </array-type-def>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='3bf9d798' size-in-bits='32' id='9e12fab2'/>
    <pointer-type-def type-id='259cb173' size-in-bits='32' id='a0c92bba'/>
    <typedef-decl name='out_func' type-id='e763b16e' id='a13c062f'/>
    <qualified-type-def type-id='c1606520' const='yes' id='a6124a50'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <union-decl name='__anonymous_union__' size-in-bits='16' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='freq' type-id='60606410' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='code' type-id='60606410' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='16' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='dad' type-id='60606410' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='len' type-id='60606410' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='off_t' type-id='8dda407a' id='ad707ada'/>
    <pointer-type-def type-id='5bbcce85' size-in-bits='32' id='b0c2822c'/>
    <qualified-type-def type-id='84c44388' const='yes' id='b42c11d8'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='alloc_func' type-id='9e12fab2' id='b6ee541c'/>
    <typedef-decl name='voidpc' type-id='eaa32e2f' id='b7958d8b'/>
    <typedef-decl name='voidpf' type-id='eaa32e2f' id='ba959244'/>
    <function-type size-in-bits='32' id='bb9bf664'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='cf536864'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <pointer-type-def type-id='98f1e9dd' size-in-bits='32' id='bbd34fd5'/>
    <type-decl name='long int' size-in-bits='32' id='bd54fe1a'/>
    <typedef-decl name='Bytef' type-id='efb9ba06' id='c1606520'/>
    <typedef-decl name='IPos' type-id='f0981eeb' id='c326a6df'/>
    <pointer-type-def type-id='002ac4a6' size-in-bits='32' id='cf536864'/>
    <class-decl name='z_stream_s' size-in-bits='448' is-struct='yes' visibility='default' id='d19a2f20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_in' type-id='e8cb3e0e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='avail_in' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='total_in' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='next_out' type-id='4c667223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avail_out' type-id='09110a74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='total_out' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='state' type-id='3a49ee4c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zalloc' type-id='b6ee541c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='zfree' type-id='ee14d515' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='opaque' type-id='ba959244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='data_type' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='adler' type-id='5bbcce85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='reserved' type-id='5bbcce85' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uchf' type-id='4088d420' id='dd662a32'/>
    <typedef-decl name='ct_data' type-id='e27d4b01' id='dec14004'/>
    <class-decl name='ct_data_s' size-in-bits='32' is-struct='yes' visibility='default' id='e27d4b01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fc' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dl' type-id='ac5ab596' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='in_func' type-id='65fedd12' id='e2f864e2'/>
    <pointer-type-def type-id='bb9bf664' size-in-bits='32' id='e763b16e'/>
    <pointer-type-def type-id='a6124a50' size-in-bits='32' id='e8cb3e0e'/>
    <typedef-decl name='voidp' type-id='eaa32e2f' id='e8d99f4a'/>
    <function-type size-in-bits='32' id='e9af568a'>
      <parameter type-id='ba959244'/>
      <parameter type-id='ba959244'/>
      <return type-id='48b5725f'/>
    </function-type>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <typedef-decl name='free_func' type-id='0a71128c' id='ee14d515'/>
    <typedef-decl name='Byte' type-id='002ac4a6' id='efb9ba06'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <pointer-type-def type-id='09110a74' size-in-bits='32' id='f27e3d71'/>
    <typedef-decl name='Pos' type-id='60606410' id='f61da996'/>
    <class-decl name='tree_desc_s' size-in-bits='96' is-struct='yes' visibility='default' id='f8a0d221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dyn_tree' type-id='31c621cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_code' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stat_desc' type-id='bbd34fd5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='z_streamp' type-id='369435a4' id='fb4f8c25'/>
    <class-decl name='gzFile_s' size-in-bits='96' is-struct='yes' visibility='default' id='fbc67d64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='have' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='next' type-id='cf536864' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pos' type-id='ad707ada' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='adler32' mangled-name='adler32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='adler32'>
      <parameter type-id='5bbcce85' name='adler'/>
      <parameter type-id='e8cb3e0e' name='buf'/>
      <parameter type-id='09110a74' name='len'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='adler32_combine' mangled-name='adler32_combine' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='adler32_combine'>
      <parameter type-id='5bbcce85' name='adler1'/>
      <parameter type-id='5bbcce85' name='adler2'/>
      <parameter type-id='ad707ada' name='len2'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='adler32_combine64' mangled-name='adler32_combine64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='adler32_combine64'>
      <parameter type-id='5bbcce85' name='adler1'/>
      <parameter type-id='5bbcce85' name='adler2'/>
      <parameter type-id='ad707ada' name='len2'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='adler32_z' mangled-name='adler32_z' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='adler32_z'>
      <parameter type-id='5bbcce85' name='adler'/>
      <parameter type-id='e8cb3e0e' name='buf'/>
      <parameter type-id='2ecb4085' name='len'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='compress' mangled-name='compress' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='compress'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='compress2' mangled-name='compress2' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='compress2'>
      <parameter type-id='4c667223' name='dest'/>
      <parameter type-id='60db3356' name='destLen'/>
      <parameter type-id='e8cb3e0e' name='source'/>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <parameter type-id='95e97e5e' name='level'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='compressBound' mangled-name='compressBound' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='compressBound'>
      <parameter type-id='5bbcce85' name='sourceLen'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='crc32' mangled-name='crc32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='crc32'>
      <parameter type-id='7359adad' name='crc'/>
      <parameter type-id='354f7eb9' name='buf'/>
      <parameter type-id='09110a74' name='len'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='crc32_combine' mangled-name='crc32_combine' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='crc32_combine'>
      <parameter type-id='5bbcce85' name='crc1'/>
      <parameter type-id='5bbcce85' name='crc2'/>
      <parameter type-id='ad707ada' name='len2'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='crc32_combine64' mangled-name='crc32_combine64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='crc32_combine64'>
      <parameter type-id='5bbcce85' name='crc1'/>
      <parameter type-id='5bbcce85' name='crc2'/>
      <parameter type-id='ad707ada' name='len2'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <function-decl name='crc32_z' mangled-name='crc32_z' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='crc32_z'>
      <parameter type-id='7359adad' name='crc'/>
