<abi-corpus version='2.1' architecture='elf-arm' soname='libandroid.so'>
  <elf-needed>
    <dependency name='liblog.so'/>
    <dependency name='libhidlbase.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libandroidfw.so'/>
    <dependency name='libinput.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libbinder.so'/>
    <dependency name='libui.so'/>
    <dependency name='libgui.so'/>
    <dependency name='libharfbuzz_ng.so'/>
    <dependency name='libsensor.so'/>
    <dependency name='libactivitymanager_aidl.so'/>
    <dependency name='libandroid_runtime.so'/>
    <dependency name='libminikin.so'/>
    <dependency name='libnetd_client.so'/>
    <dependency name='libhwui.so'/>
    <dependency name='libxml2.so'/>
    <dependency name='libEGL.so'/>
    <dependency name='libGLESv2.so'/>
    <dependency name='libpowermanager.so'/>
    <dependency name='android.hardware.configstore@1.0.so'/>
    <dependency name='android.hardware.configstore-utils.so'/>
    <dependency name='libnativedisplay.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AAssetDir_close' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='ASensor_isDirectChannelTypeSupported' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASensor_isWakeUpSensor' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASharedMemory_create' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASharedMemory_getSize' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASharedMemory_setProt' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AStorageManager_delete' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AStorageManager_getMountedObbPath' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AStorageManager_isObbMounted' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AStorageManager_mountObb' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AStorageManager_new' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AStorageManager_unmountObb' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_beginSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_endSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_isEnabled' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_getaddrinfofornetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setprocnetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setsocknetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='various' path='various'>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='608' id='19b37a54'>
      <subrange length='38' type-id='7ff19f0f' id='aa4ccdac'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='infinite' id='1fdc7fa6'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16' id='49f79167'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='560' id='5da7196d'>
      <subrange length='35' type-id='7ff19f0f' id='6e6845b5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='512' id='73273128'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='448' id='75a6af5f'>
      <subrange length='14' type-id='7ff19f0f' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='448' id='7722ba46'>
      <subrange length='14' type-id='7ff19f0f' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' id='8e100159'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='512' id='c5d13f42'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='96' id='c723f882'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='96' id='e86b43ed'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' id='f01a039e'>
      <subrange length='14' type-id='7ff19f0f' id='48882d96'/>
    </array-type-def>
    <class-decl name='AAdditionalInfoEvent' size-in-bits='512' is-struct='yes' visibility='default' id='fa893a23'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='448' is-anonymous='yes' visibility='default' id='ac5ab5a3'>
          <data-member access='public'>
            <var-decl name='data_int32' type-id='75a6af5f' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='data_float' type-id='7722ba46' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='serial' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AAsset' size-in-bits='32' is-struct='yes' visibility='default' id='1fc4034c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAsset' type-id='ac070eda' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AAsset' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='57d98aaa' is-artificial='yes'/>
          <parameter type-id='ac070eda'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AAssetDir' size-in-bits='96' is-struct='yes' visibility='default' id='ea9788c3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAssetDir' type-id='6a6c3f8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mCurFileIndex' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mCachedFileName' type-id='bacf3393' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AAssetDir' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='1cdc10c3' is-artificial='yes'/>
          <parameter type-id='6a6c3f8a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AAssetManager' size-in-bits='8' is-struct='yes' visibility='default' id='7907d453'/>
    <class-decl name='AChoreographer' is-struct='yes' visibility='default' is-declaration-only='yes' id='d1af9805'/>
    <class-decl name='AConfiguration' size-in-bits='512' is-struct='yes' visibility='default' id='9896136e'>
      <base-class access='public' layout-offset-in-bits='0' type-id='f8926d95'/>
    </class-decl>
    <class-decl name='ADynamicSensorEvent' size-in-bits='64' is-struct='yes' visibility='default' id='984bb689'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connected' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='handle' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AHardwareBuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d45f31e'/>
    <class-decl name='AHardwareBuffer_Desc' size-in-bits='320' is-struct='yes' visibility='default' id='820e87ae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='width' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='height' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='layers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='format' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='usage' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stride' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='rfu0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rfu1' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AHeadTrackerEvent' size-in-bits='224' is-struct='yes' visibility='default' id='a5ebc1e2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rx' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ry' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rz' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vx' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vy' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vz' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='discontinuity_count' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AHeadingEvent' size-in-bits='64' is-struct='yes' visibility='default' id='2ef93276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='heading' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='accuracy' type-id='a6c45d85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AHeartRateEvent' size-in-bits='64' is-struct='yes' visibility='default' id='14a24fe6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpm' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='status' type-id='ee31ee44' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AInputEvent' size-in-bits='32' is-struct='yes' visibility='default' id='80020150'>
      <member-function access='public' destructor='yes' vtable-offset='0'>
        <function-decl name='~AInputEvent' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='b7c0a646' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AInputQueue' size-in-bits='8' is-struct='yes' visibility='default' id='81665327'/>
    <class-decl name='ALimitedAxesImuEvent' size-in-bits='192' is-struct='yes' visibility='default' id='7ab472e0'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' id='ac5ab5a4'>
          <data-member access='public'>
            <var-decl name='calib' type-id='c723f882' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f7b' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' id='ac5ab5a5'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='x_supported' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='y_supported' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='z_supported' type-id='a6c45d85' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='supported' type-id='c723f882' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f7f' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab5a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='' type-id='ac5ab5a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ALimitedAxesImuUncalibratedEvent' size-in-bits='288' is-struct='yes' visibility='default' id='506dc484'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='' type-id='ac5ab5a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab5a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ALooper' is-struct='yes' visibility='default' is-declaration-only='yes' id='da89ab6d'/>
    <class-decl name='AMetaDataEvent' size-in-bits='64' is-struct='yes' visibility='default' id='6de4236b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='what' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sensor' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ANativeActivity' is-struct='yes' visibility='default' is-declaration-only='yes' id='67c862fe'/>
    <class-decl name='ANativeWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d637dbf'/>
    <class-decl name='ANativeWindow_Buffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='e90e56ba'/>
    <class-decl name='AObbInfo' size-in-bits='288' is-struct='yes' visibility='default' id='3e61dcc9'>
      <base-class access='public' layout-offset-in-bits='0' type-id='c02827ab'/>
    </class-decl>
    <class-decl name='ARect' size-in-bits='128' is-struct='yes' visibility='default' id='c9ee9172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='top' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bottom' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ASensor' size-in-bits='8' is-struct='yes' visibility='default' id='68510cba'/>
    <class-decl name='ASensorEvent' size-in-bits='832' is-struct='yes' visibility='default' id='38b55796'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' id='ac5ab5a6'>
          <member-type access='public'>
            <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' id='ac5ab5a7'>
              <data-member access='public'>
                <var-decl name='data' type-id='73273128' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='vector' type-id='48a1b186' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='acceleration' type-id='48a1b186' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='gyro' type-id='48a1b186' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='magnetic' type-id='48a1b186' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='temperature' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='distance' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='light' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='pressure' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='relative_humidity' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='uncalibrated_acceleration' type-id='f1b274b1' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='uncalibrated_gyro' type-id='f1b274b1' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='uncalibrated_magnetic' type-id='f1b274b1' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='meta_data' type-id='e3dd54c6' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='heart_rate' type-id='a4ce2d4d' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='dynamic_sensor_meta' type-id='22cf32ce' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='additional_info' type-id='1f241bc2' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='head_tracker' type-id='87e93501' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='limited_axes_imu' type-id='c8b559e9' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='limited_axes_imu_uncalibrated' type-id='4e60ff55' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='heading' type-id='65984dc1' visibility='default'/>
              </data-member>
            </union-decl>
          </member-type>
          <member-type access='public'>
            <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' id='ac5ab5a8'>
              <data-member access='public'>
                <var-decl name='data' type-id='c5d13f42' visibility='default'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='step_counter' type-id='9c313c2d' visibility='default'/>
              </data-member>
            </union-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='ac5ab5a7' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='u64' type-id='ac5ab5a8' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sensor' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved0' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timestamp' type-id='9da381c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab5a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='reserved1' type-id='e86b43ed' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ASensorEventQueue' size-in-bits='64' is-struct='yes' visibility='default' id='e7195b11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='looper' type-id='863667dd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='requestAdditionalInfo' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ASensorManager' size-in-bits='8' is-struct='yes' visibility='default' id='85c2b5e1'/>
    <class-decl name='ASensorVector' size-in-bits='128' is-struct='yes' visibility='default' id='b6b8bef1'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' id='ac5ab5a0'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='x' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='y' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='z' type-id='a6c45d85' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='azimuth' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='pitch' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='roll' type-id='a6c45d85' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='v' type-id='c723f882' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f7b' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f7c' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='status' type-id='ee31ee44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='reserved' type-id='d3490169' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AStorageManager' size-in-bits='352' is-struct='yes' visibility='default' id='56516754'>
      <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='mCallbackLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='96'>
        <var-decl name='mCallbacks' type-id='3847ab67' visibility='default'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='mNextNonce' type-id='fda05812' visibility='default'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='288'>
        <var-decl name='mObbActionListener' type-id='788ba3f2' visibility='default'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='mMountService' type-id='f331f373' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AStorageManager' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='df7f8372' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AUncalibratedEvent' size-in-bits='192' is-struct='yes' visibility='default' id='225d4590'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' id='ac5ab5a1'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='x_uncalib' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='y_uncalib' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='z_uncalib' type-id='a6c45d85' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='uncalib' type-id='c723f882' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f7d' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='96' is-anonymous='yes' visibility='default' id='ac5ab5a2'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='x_bias' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='y_bias' type-id='a6c45d85' visibility='default'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='z_bias' type-id='a6c45d85' visibility='default'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='bias' type-id='c723f882' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f7e' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='' type-id='ac5ab5a2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='JNINativeInterface' size-in-bits='7456' is-struct='yes' visibility='default' id='ad414f12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved0' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved3' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='GetVersion' type-id='4b15419a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='DefineClass' type-id='3358ddb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='FindClass' type-id='e905d0ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='FromReflectedMethod' type-id='09176273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='FromReflectedField' type-id='04aa9df2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ToReflectedMethod' type-id='582ba311' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='GetSuperclass' type-id='93737cc2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='IsAssignableFrom' type-id='f39f8bbd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ToReflectedField' type-id='58398eee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='Throw' type-id='4a0b9bf1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ThrowNew' type-id='0571aa74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ExceptionOccurred' type-id='7fdf58e1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ExceptionDescribe' type-id='8bc971a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='ExceptionClear' type-id='8bc971a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='FatalError' type-id='2deb20e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='PushLocalFrame' type-id='9aeb7958' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PopLocalFrame' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='NewGlobalRef' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='DeleteGlobalRef' type-id='8a1f7e9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='DeleteLocalRef' type-id='8a1f7e9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='IsSameObject' type-id='782c53f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='NewLocalRef' type-id='a0ba6dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='EnsureLocalCapacity' type-id='9aeb7958' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='AllocObject' type-id='151a1d63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='NewObject' type-id='f8af7982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='NewObjectV' type-id='a01a6e09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='NewObjectA' type-id='f0a0ff54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='GetObjectClass' type-id='b5f4f133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='IsInstanceOf' type-id='bcee08ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='GetMethodID' type-id='30974818' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='CallObjectMethod' type-id='2dab161d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='CallObjectMethodV' type-id='0290ef52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='CallObjectMethodA' type-id='4278623b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='CallBooleanMethod' type-id='461c5f2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='CallBooleanMethodV' type-id='88d99751' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='CallBooleanMethodA' type-id='74823d0c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='CallByteMethod' type-id='17d955f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='CallByteMethodV' type-id='44bea17b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='CallByteMethodA' type-id='ed0795aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='CallCharMethod' type-id='e747dee6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='CallCharMethodV' type-id='d31f1c35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='CallCharMethodA' type-id='b0061f70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='CallShortMethod' type-id='bf87e894' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='CallShortMethodV' type-id='5da2c37f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='CallShortMethodA' type-id='5db5877e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='CallIntMethod' type-id='3271bf2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='CallIntMethodV' type-id='66ebe6b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='CallIntMethodA' type-id='6c56e815' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='CallLongMethod' type-id='ea8867ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='CallLongMethodV' type-id='5f929ab7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='CallLongMethodA' type-id='a55b35a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='CallFloatMethod' type-id='e8139a80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='CallFloatMethodV' type-id='9ac8b1e3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='CallFloatMethodA' type-id='413559e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='CallDoubleMethod' type-id='a642a393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='CallDoubleMethodV' type-id='95fba39c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='CallDoubleMethodA' type-id='a3ea0661' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='CallVoidMethod' type-id='d696f7b3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='CallVoidMethodV' type-id='bbecc3fc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='CallVoidMethodA' type-id='921cf101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='CallNonvirtualObjectMethod' type-id='4f7677f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='CallNonvirtualObjectMethodV' type-id='15887ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='CallNonvirtualObjectMethodA' type-id='34c67260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='CallNonvirtualBooleanMethod' type-id='f1191df9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='CallNonvirtualBooleanMethodV' type-id='ff535cb6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='CallNonvirtualBooleanMethodA' type-id='fb38167f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='CallNonvirtualByteMethod' type-id='377b5e63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='CallNonvirtualByteMethodV' type-id='1930d02c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='CallNonvirtualByteMethodA' type-id='1d2f8a91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='CallNonvirtualCharMethod' type-id='63f7d65d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='CallNonvirtualCharMethodV' type-id='c32cfa12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='CallNonvirtualCharMethodA' type-id='c2280e7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='CallNonvirtualShortMethod' type-id='0de4af77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='CallNonvirtualShortMethodV' type-id='255ff5d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='CallNonvirtualShortMethodA' type-id='f4bbad8d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='CallNonvirtualIntMethod' type-id='ce1853bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='CallNonvirtualIntMethodV' type-id='d5b0b547' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='CallNonvirtualIntMethodA' type-id='3318dad6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='CallNonvirtualLongMethod' type-id='3459b4cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='CallNonvirtualLongMethodV' type-id='a60dd490' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='CallNonvirtualLongMethodA' type-id='326df5b5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='CallNonvirtualFloatMethod' type-id='eb164d0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='CallNonvirtualFloatMethodV' type-id='8c4e1254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='CallNonvirtualFloatMethodA' type-id='a0bc56e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='CallNonvirtualDoubleMethod' type-id='2dcc8b98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='CallNonvirtualDoubleMethodV' type-id='0e5e0cdb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='CallNonvirtualDoubleMethodA' type-id='a937264a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='CallNonvirtualVoidMethod' type-id='c14258b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='CallNonvirtualVoidMethodV' type-id='1db4c5bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='CallNonvirtualVoidMethodA' type-id='41d61b6a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='GetFieldID' type-id='5d99509b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='GetObjectField' type-id='7139225a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='GetBooleanField' type-id='13196dfd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='GetByteField' type-id='c8bc780f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='GetCharField' type-id='239d7ad9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='GetShortField' type-id='476f48bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='GetIntField' type-id='f7e564c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='GetLongField' type-id='ac4e6cb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GetFloatField' type-id='06fbd437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='GetDoubleField' type-id='47bc557c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='SetObjectField' type-id='e333ff60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='SetBooleanField' type-id='b263848f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='SetByteField' type-id='a4a48a09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='SetCharField' type-id='e4b27ecf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='SetShortField' type-id='090a6901' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='SetIntField' type-id='d3651c96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='SetLongField' type-id='09b49e9d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='SetFloatField' type-id='ac4ad749' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='SetDoubleField' type-id='195d3e42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='GetStaticMethodID' type-id='30974818' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='CallStaticObjectMethod' type-id='f8af7982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='CallStaticObjectMethodV' type-id='a01a6e09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='CallStaticObjectMethodA' type-id='f0a0ff54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='CallStaticBooleanMethod' type-id='916299d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='CallStaticBooleanMethodV' type-id='412650f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='CallStaticBooleanMethodA' type-id='339f696d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='CallStaticByteMethod' type-id='ce9d67cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='CallStaticByteMethodV' type-id='478facc2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='CallStaticByteMethodA' type-id='db28fdcb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='CallStaticCharMethod' type-id='3bd86cfb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='CallStaticCharMethodV' type-id='dddcefc4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='CallStaticCharMethodA' type-id='692552f9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='CallStaticShortMethod' type-id='362e2831' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='CallStaticShortMethodV' type-id='d1173c4e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='CallStaticShortMethodA' type-id='097c7407' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='CallStaticIntMethod' type-id='64ca4b84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='CallStaticIntMethodV' type-id='0323d66f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='CallStaticIntMethodA' type-id='30b9a8ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='CallStaticLongMethod' type-id='8c22ffe9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='CallStaticLongMethodV' type-id='60306f66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='CallStaticLongMethodA' type-id='1fda464f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='CallStaticFloatMethod' type-id='4ed90115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='CallStaticFloatMethodV' type-id='87e0b5ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='CallStaticFloatMethodA' type-id='caa57963' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='CallStaticDoubleMethod' type-id='04b3e5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='CallStaticDoubleMethodV' type-id='be0ed943' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='CallStaticDoubleMethodA' type-id='df8dc702' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='CallStaticVoidMethod' type-id='a86eb340' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='CallStaticVoidMethodV' type-id='cf05fa23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='CallStaticVoidMethodA' type-id='6fc0eca2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='GetStaticFieldID' type-id='5d99509b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='GetStaticObjectField' type-id='d7560895' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='GetStaticBooleanField' type-id='4127a730' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='GetStaticByteField' type-id='c404650a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='GetStaticCharField' type-id='0736b484' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4768'>
        <var-decl name='GetStaticShortField' type-id='0d5970ee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='GetStaticIntField' type-id='771014ab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='GetStaticLongField' type-id='a4a6a786' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='GetStaticFloatField' type-id='337e1672' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4896'>
        <var-decl name='GetStaticDoubleField' type-id='bd4849d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='SetStaticObjectField' type-id='6c160b51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='SetStaticBooleanField' type-id='0a7e4740' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='SetStaticByteField' type-id='0cb5bb00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='SetStaticCharField' type-id='bbfff1aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='SetStaticShortField' type-id='187251e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='SetStaticIntField' type-id='3a8fe115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='SetStaticLongField' type-id='72f7c194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='SetStaticFloatField' type-id='e0227512' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='SetStaticDoubleField' type-id='30411993' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='NewString' type-id='40f183ab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='GetStringLength' type-id='a7d6acc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5280'>
        <var-decl name='GetStringChars' type-id='e5a87447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ReleaseStringChars' type-id='61d681d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5344'>
        <var-decl name='NewStringUTF' type-id='691ba251' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='GetStringUTFLength' type-id='a7d6acc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5408'>
        <var-decl name='GetStringUTFChars' type-id='08565ebd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='ReleaseStringUTFChars' type-id='ac33476b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5472'>
        <var-decl name='GetArrayLength' type-id='a23a76e0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='NewObjectArray' type-id='e4f2ab66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5536'>
        <var-decl name='GetObjectArrayElement' type-id='0ae13aef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='SetObjectArrayElement' type-id='99167093' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5600'>
        <var-decl name='NewBooleanArray' type-id='162473c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='NewByteArray' type-id='be49c182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5664'>
        <var-decl name='NewCharArray' type-id='ac74c0c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='NewShortArray' type-id='978c735e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='NewIntArray' type-id='2041a8d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='NewLongArray' type-id='d7ea3436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5792'>
        <var-decl name='NewFloatArray' type-id='69b7386a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='NewDoubleArray' type-id='31ebf17b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5856'>
        <var-decl name='GetBooleanArrayElements' type-id='9b3c0ac2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='GetByteArrayElements' type-id='33683384' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5920'>
        <var-decl name='GetCharArrayElements' type-id='be2cecec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='GetShortArrayElements' type-id='5353c67e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5984'>
        <var-decl name='GetIntArrayElements' type-id='4f68d4b2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='GetLongArrayElements' type-id='b286ae14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6048'>
        <var-decl name='GetFloatArrayElements' type-id='210c37a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='GetDoubleArrayElements' type-id='b181362a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6112'>
        <var-decl name='ReleaseBooleanArrayElements' type-id='666fc788' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='ReleaseByteArrayElements' type-id='59e7b6c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6176'>
        <var-decl name='ReleaseCharArrayElements' type-id='01eb6566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='ReleaseShortArrayElements' type-id='075b7a00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='ReleaseIntArrayElements' type-id='bc4a7a06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ReleaseLongArrayElements' type-id='0ba6a8b6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='ReleaseFloatArrayElements' type-id='c503a924' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ReleaseDoubleArrayElements' type-id='c8abb79e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6368'>
        <var-decl name='GetBooleanArrayRegion' type-id='67514b72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='GetByteArrayRegion' type-id='c541e6a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6432'>
        <var-decl name='GetCharArrayRegion' type-id='af95e824' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='GetShortArrayRegion' type-id='1f57b15a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='GetIntArrayRegion' type-id='7f0ac28c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='GetLongArrayRegion' type-id='747a49e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='GetFloatArrayRegion' type-id='060c7d5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='GetDoubleArrayRegion' type-id='fce8e074' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='SetBooleanArrayRegion' type-id='a617346d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='SetByteArrayRegion' type-id='5ee69201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='SetCharArrayRegion' type-id='b049b821' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='SetShortArrayRegion' type-id='62d9dee9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='SetIntArrayRegion' type-id='f569444f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='SetLongArrayRegion' type-id='10182119' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='SetFloatArrayRegion' type-id='a975aa19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='SetDoubleArrayRegion' type-id='348c02e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='RegisterNatives' type-id='764ac7bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='UnregisterNatives' type-id='9447819d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='MonitorEnter' type-id='67a46ff2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='MonitorExit' type-id='67a46ff2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7008'>
        <var-decl name='GetJavaVM' type-id='5a4c25bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='GetStringRegion' type-id='fb79cfe8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7072'>
        <var-decl name='GetStringUTFRegion' type-id='629961b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='GetPrimitiveArrayCritical' type-id='d82ed742' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <var-decl name='ReleasePrimitiveArrayCritical' type-id='601f438c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='GetStringCritical' type-id='e5a87447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7200'>
        <var-decl name='ReleaseStringCritical' type-id='61d681d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='NewWeakGlobalRef' type-id='03bcacf3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='DeleteWeakGlobalRef' type-id='ccc141a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='ExceptionCheck' type-id='5796afad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7328'>
        <var-decl name='NewDirectByteBuffer' type-id='2c684c9f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='GetDirectBufferAddress' type-id='bd98ffce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7392'>
        <var-decl name='GetDirectBufferCapacity' type-id='47653e05' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='GetObjectRefType' type-id='500eebf7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ObbActionListener' size-in-bits='224' is-struct='yes' visibility='default' id='38e516d0'>
      <base-class access='public' layout-offset-in-bits='0' type-id='b4c0d64f'/>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='mStorageManager' type-id='4c8890e6' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ObbActionListener' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7376f3a6' is-artificial='yes'/>
          <parameter type-id='df7f8372'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ObbCallback' size-in-bits='96' visibility='default' id='f0b1600d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nonce' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cb' type-id='9299e4b4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ObbCallback' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='547a22ad' is-artificial='yes'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='9299e4b4'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='_JNIEnv' is-struct='yes' visibility='default' is-declaration-only='yes' id='c9459134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='functions' type-id='e48f1427' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_JavaVM' is-struct='yes' visibility='default' is-declaration-only='yes' id='d607eddf'/>
    <class-decl name='_jarray' size-in-bits='8' visibility='default' id='440aaf49'>
      <base-class access='public' layout-offset-in-bits='0' type-id='baffb083'/>
    </class-decl>
    <class-decl name='_jbooleanArray' visibility='default' is-declaration-only='yes' id='2ca86b0d'/>
    <class-decl name='_jbyteArray' visibility='default' is-declaration-only='yes' id='1e7918a7'/>
    <class-decl name='_jcharArray' visibility='default' is-declaration-only='yes' id='eeed1f5d'/>
    <class-decl name='_jclass' visibility='default' is-declaration-only='yes' id='e53ab91c'/>
    <class-decl name='_jdoubleArray' visibility='default' is-declaration-only='yes' id='530c1a32'/>
    <class-decl name='_jfieldID' is-struct='yes' visibility='default' is-declaration-only='yes' id='2e67d715'/>
    <class-decl name='_jfloatArray' visibility='default' is-declaration-only='yes' id='a87003ef'/>
    <class-decl name='_jintArray' visibility='default' is-declaration-only='yes' id='b0749e8e'/>
    <class-decl name='_jlongArray' visibility='default' is-declaration-only='yes' id='fb46a283'/>
    <class-decl name='_jmethodID' is-struct='yes' visibility='default' is-declaration-only='yes' id='d988e2e8'/>
    <class-decl name='_jobject' size-in-bits='8' visibility='default' id='baffb083'/>
    <class-decl name='_jobjectArray' visibility='default' is-declaration-only='yes' id='fdf9f098'/>
    <class-decl name='_jshortArray' visibility='default' is-declaration-only='yes' id='30a4d497'/>
    <class-decl name='_jstring' visibility='default' is-declaration-only='yes' id='ae6a1c55'/>
    <class-decl name='_jthrowable' visibility='default' is-declaration-only='yes' id='07f10124'/>
    <class-decl name='addrinfo' size-in-bits='256' is-struct='yes' visibility='default' id='9194f5e2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='6b2697b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ai_canonname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='5c0abad8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ai_next' type-id='61e7b2c0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='native_handle' size-in-bits='96' is-struct='yes' visibility='default' id='3181ea79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='numFds' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numInts' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='data' type-id='1fdc7fa6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='92fa54c8' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' is-declaration-only='yes' id='e754f6f2' is-anonymous='yes'/>
    <enum-decl name='jobjectRefType' id='4f771c8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='JNIInvalidRefType' value='0'/>
      <enumerator name='JNILocalRefType' value='1'/>
      <enumerator name='JNIGlobalRefType' value='2'/>
      <enumerator name='JNIWeakGlobalRefType' value='3'/>
    </enum-decl>
    <function-decl name='AAssetDir_close' mangled-name='AAssetDir_close' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAssetDir_close@@LIBANDROID'>
      <parameter type-id='1cdc10c3' name='assetDir'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AAssetDir_getNextFileName' mangled-name='AAssetDir_getNextFileName' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAssetDir_getNextFileName@@LIBANDROID'>
      <parameter type-id='1cdc10c3' name='assetDir'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='AAssetDir_rewind' mangled-name='AAssetDir_rewind' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAssetDir_rewind@@LIBANDROID'>
      <parameter type-id='1cdc10c3' name='assetDir'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AAssetManager_fromJava' mangled-name='AAssetManager_fromJava' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAssetManager_fromJava@@LIBANDROID'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='assetManager'/>
      <return type-id='081c2b23'/>
    </function-decl>
    <function-decl name='AAssetManager_open' mangled-name='AAssetManager_open' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAssetManager_open@@LIBANDROID'>
      <parameter type-id='081c2b23' name='amgr'/>
      <parameter type-id='80f4b756' name='filename'/>
      <parameter type-id='95e97e5e' name='mode'/>
      <return type-id='57d98aaa'/>
    </function-decl>
    <function-decl name='AAssetManager_openDir' mangled-name='AAssetManager_openDir' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAssetManager_openDir@@LIBANDROID'>
      <parameter type-id='081c2b23' name='amgr'/>
      <parameter type-id='80f4b756' name='dirName'/>
      <return type-id='1cdc10c3'/>
    </function-decl>
    <function-decl name='AAsset_close' mangled-name='AAsset_close' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_close@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AAsset_getBuffer' mangled-name='AAsset_getBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_getBuffer@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='AAsset_getLength' mangled-name='AAsset_getLength' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_getLength@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <return type-id='ad707ada'/>
    </function-decl>
    <function-decl name='AAsset_getLength64' mangled-name='AAsset_getLength64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_getLength64@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <return type-id='05d4c620'/>
    </function-decl>
    <function-decl name='AAsset_getRemainingLength' mangled-name='AAsset_getRemainingLength' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_getRemainingLength@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <return type-id='ad707ada'/>
    </function-decl>
    <function-decl name='AAsset_getRemainingLength64' mangled-name='AAsset_getRemainingLength64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_getRemainingLength64@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <return type-id='05d4c620'/>
    </function-decl>
    <function-decl name='AAsset_isAllocated' mangled-name='AAsset_isAllocated' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_isAllocated@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AAsset_openFileDescriptor' mangled-name='AAsset_openFileDescriptor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_openFileDescriptor@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <parameter type-id='e90c4311' name='outStart'/>
      <parameter type-id='e90c4311' name='outLength'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AAsset_openFileDescriptor64' mangled-name='AAsset_openFileDescriptor64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_openFileDescriptor64@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <parameter type-id='b8263143' name='outStart'/>
      <parameter type-id='b8263143' name='outLength'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AAsset_read' mangled-name='AAsset_read' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_read@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='count'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AAsset_seek' mangled-name='AAsset_seek' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_seek@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <parameter type-id='ad707ada' name='offset'/>
      <parameter type-id='95e97e5e' name='whence'/>
      <return type-id='ad707ada'/>
    </function-decl>
    <function-decl name='AAsset_seek64' mangled-name='AAsset_seek64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AAsset_seek64@@LIBANDROID'>
      <parameter type-id='57d98aaa' name='asset'/>
      <parameter type-id='05d4c620' name='offset'/>
      <parameter type-id='95e97e5e' name='whence'/>
      <return type-id='05d4c620'/>
    </function-decl>
    <function-decl name='AChoreographer_getInstance' mangled-name='AChoreographer_getInstance' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AChoreographer_getInstance@@LIBANDROID'>
      <return type-id='136b85b5'/>
    </function-decl>
    <function-decl name='AChoreographer_postFrameCallback' mangled-name='AChoreographer_postFrameCallback' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AChoreographer_postFrameCallback@@LIBANDROID'>
      <parameter type-id='136b85b5' name='choreographer'/>
      <parameter type-id='f687fd19' name='callback'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AChoreographer_postFrameCallbackDelayed' mangled-name='AChoreographer_postFrameCallbackDelayed' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AChoreographer_postFrameCallbackDelayed@@LIBANDROID'>
      <parameter type-id='136b85b5' name='choreographer'/>
      <parameter type-id='f687fd19' name='callback'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <parameter type-id='bd54fe1a' name='delayMillis'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_copy' mangled-name='AConfiguration_copy' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_copy@@LIBANDROID'>
      <parameter type-id='138c2704' name='dest'/>
      <parameter type-id='138c2704' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_delete' mangled-name='AConfiguration_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_delete@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_diff' mangled-name='AConfiguration_diff' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_diff@@LIBANDROID'>
      <parameter type-id='138c2704' name='config1'/>
      <parameter type-id='138c2704' name='config2'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_fromAssetManager' mangled-name='AConfiguration_fromAssetManager' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_fromAssetManager@@LIBANDROID'>
      <parameter type-id='138c2704' name='out'/>
      <parameter type-id='081c2b23' name='am'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_getCountry' mangled-name='AConfiguration_getCountry' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getCountry@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='26a90f95' name='outLanguage'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_getDensity' mangled-name='AConfiguration_getDensity' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getDensity@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getKeyboard' mangled-name='AConfiguration_getKeyboard' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getKeyboard@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getKeysHidden' mangled-name='AConfiguration_getKeysHidden' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getKeysHidden@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getLanguage' mangled-name='AConfiguration_getLanguage' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getLanguage@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='26a90f95' name='outLanguage'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_getLayoutDirection' mangled-name='AConfiguration_getLayoutDirection' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getLayoutDirection@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getMcc' mangled-name='AConfiguration_getMcc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getMcc@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getMnc' mangled-name='AConfiguration_getMnc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getMnc@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getNavHidden' mangled-name='AConfiguration_getNavHidden' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getNavHidden@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getNavigation' mangled-name='AConfiguration_getNavigation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getNavigation@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getOrientation' mangled-name='AConfiguration_getOrientation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getOrientation@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getScreenHeightDp' mangled-name='AConfiguration_getScreenHeightDp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getScreenHeightDp@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getScreenLong' mangled-name='AConfiguration_getScreenLong' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getScreenLong@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getScreenSize' mangled-name='AConfiguration_getScreenSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getScreenSize@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getScreenWidthDp' mangled-name='AConfiguration_getScreenWidthDp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getScreenWidthDp@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getSdkVersion' mangled-name='AConfiguration_getSdkVersion' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getSdkVersion@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getSmallestScreenWidthDp' mangled-name='AConfiguration_getSmallestScreenWidthDp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getSmallestScreenWidthDp@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getTouchscreen' mangled-name='AConfiguration_getTouchscreen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getTouchscreen@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getUiModeNight' mangled-name='AConfiguration_getUiModeNight' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getUiModeNight@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_getUiModeType' mangled-name='AConfiguration_getUiModeType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_getUiModeType@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_isBetterThan' mangled-name='AConfiguration_isBetterThan' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_isBetterThan@@LIBANDROID'>
      <parameter type-id='138c2704' name='base'/>
      <parameter type-id='138c2704' name='test'/>
      <parameter type-id='138c2704' name='requested'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_match' mangled-name='AConfiguration_match' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_match@@LIBANDROID'>
      <parameter type-id='138c2704' name='config1'/>
      <parameter type-id='138c2704' name='config2'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AConfiguration_new' mangled-name='AConfiguration_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_new@@LIBANDROID'>
      <return type-id='138c2704'/>
    </function-decl>
    <function-decl name='AConfiguration_setCountry' mangled-name='AConfiguration_setCountry' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setCountry@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='80f4b756' name='language'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setDensity' mangled-name='AConfiguration_setDensity' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setDensity@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setKeyboard' mangled-name='AConfiguration_setKeyboard' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setKeyboard@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setKeysHidden' mangled-name='AConfiguration_setKeysHidden' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setKeysHidden@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setLanguage' mangled-name='AConfiguration_setLanguage' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setLanguage@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='80f4b756' name='language'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setLayoutDirection' mangled-name='AConfiguration_setLayoutDirection' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setLayoutDirection@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setMcc' mangled-name='AConfiguration_setMcc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setMcc@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setMnc' mangled-name='AConfiguration_setMnc' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setMnc@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setNavHidden' mangled-name='AConfiguration_setNavHidden' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setNavHidden@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setNavigation' mangled-name='AConfiguration_setNavigation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setNavigation@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setOrientation' mangled-name='AConfiguration_setOrientation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setOrientation@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setScreenHeightDp' mangled-name='AConfiguration_setScreenHeightDp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setScreenHeightDp@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setScreenLong' mangled-name='AConfiguration_setScreenLong' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setScreenLong@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setScreenSize' mangled-name='AConfiguration_setScreenSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setScreenSize@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setScreenWidthDp' mangled-name='AConfiguration_setScreenWidthDp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setScreenWidthDp@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setSdkVersion' mangled-name='AConfiguration_setSdkVersion' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setSdkVersion@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setSmallestScreenWidthDp' mangled-name='AConfiguration_setSmallestScreenWidthDp' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setSmallestScreenWidthDp@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setTouchscreen' mangled-name='AConfiguration_setTouchscreen' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setTouchscreen@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setUiModeNight' mangled-name='AConfiguration_setUiModeNight' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setUiModeNight@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AConfiguration_setUiModeType' mangled-name='AConfiguration_setUiModeType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AConfiguration_setUiModeType@@LIBANDROID'>
      <parameter type-id='138c2704' name='config'/>
      <parameter type-id='3ff5601b' name='mcc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_acquire' mangled-name='AHardwareBuffer_acquire' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_acquire@@LIBANDROID'>
      <parameter type-id='cdc60214' name='buffer'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_allocate' mangled-name='AHardwareBuffer_allocate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_allocate@@LIBANDROID'>
      <parameter type-id='c6fcc407' name='desc'/>
      <parameter type-id='2cb5879a' name='outBuffer'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_describe' mangled-name='AHardwareBuffer_describe' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_describe@@LIBANDROID'>
      <parameter type-id='277bcce5' name='buffer'/>
      <parameter type-id='f3610084' name='outDesc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_fromHardwareBuffer' mangled-name='AHardwareBuffer_fromHardwareBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_fromHardwareBuffer@@LIBANDROID'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='hardwareBufferObj'/>
      <return type-id='cdc60214'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_getNativeHandle' mangled-name='AHardwareBuffer_getNativeHandle' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_getNativeHandle@@LIBANDROID'>
      <parameter type-id='277bcce5' name='buffer'/>
      <return type-id='346ca4cd'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_lock' mangled-name='AHardwareBuffer_lock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_lock@@LIBANDROID'>
      <parameter type-id='cdc60214' name='buffer'/>
      <parameter type-id='9c313c2d' name='usage'/>
      <parameter type-id='3ff5601b' name='fence'/>
      <parameter type-id='e88cea79' name='rect'/>
      <parameter type-id='63e171df' name='outVirtualAddress'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_recvHandleFromUnixSocket' mangled-name='AHardwareBuffer_recvHandleFromUnixSocket' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_recvHandleFromUnixSocket@@LIBANDROID'>
      <parameter type-id='95e97e5e' name='socketFd'/>
      <parameter type-id='2cb5879a' name='outBuffer'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_release' mangled-name='AHardwareBuffer_release' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_release@@LIBANDROID'>
      <parameter type-id='cdc60214' name='buffer'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_sendHandleToUnixSocket' mangled-name='AHardwareBuffer_sendHandleToUnixSocket' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_sendHandleToUnixSocket@@LIBANDROID'>
      <parameter type-id='277bcce5' name='buffer'/>
      <parameter type-id='95e97e5e' name='socketFd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_toHardwareBuffer' mangled-name='AHardwareBuffer_toHardwareBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_toHardwareBuffer@@LIBANDROID'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='cdc60214' name='hardwareBuffer'/>
      <return type-id='96f3d089'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_unlock' mangled-name='AHardwareBuffer_unlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_unlock@@LIBANDROID'>
      <parameter type-id='cdc60214' name='buffer'/>
      <parameter type-id='4aafb922' name='fence'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AInputEvent_getDeviceId' mangled-name='AInputEvent_getDeviceId' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputEvent_getDeviceId@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AInputEvent_getSource' mangled-name='AInputEvent_getSource' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputEvent_getSource@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AInputEvent_getType' mangled-name='AInputEvent_getType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputEvent_getType@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AInputQueue_attachLooper' mangled-name='AInputQueue_attachLooper' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputQueue_attachLooper@@LIBANDROID'>
      <parameter type-id='dcca009f' name='queue'/>
      <parameter type-id='863667dd' name='looper'/>
      <parameter type-id='95e97e5e' name='ident'/>
      <parameter type-id='0f66625a' name='callback'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AInputQueue_detachLooper' mangled-name='AInputQueue_detachLooper' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputQueue_detachLooper@@LIBANDROID'>
      <parameter type-id='dcca009f' name='queue'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AInputQueue_finishEvent' mangled-name='AInputQueue_finishEvent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputQueue_finishEvent@@LIBANDROID'>
      <parameter type-id='dcca009f' name='queue'/>
      <parameter type-id='b7c0a646' name='event'/>
      <parameter type-id='95e97e5e' name='handled'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AInputQueue_getEvent' mangled-name='AInputQueue_getEvent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputQueue_getEvent@@LIBANDROID'>
      <parameter type-id='dcca009f' name='queue'/>
      <parameter type-id='b045fc04' name='outEvent'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AInputQueue_hasEvents' mangled-name='AInputQueue_hasEvents' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputQueue_hasEvents@@LIBANDROID'>
      <parameter type-id='dcca009f' name='queue'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AInputQueue_preDispatchEvent' mangled-name='AInputQueue_preDispatchEvent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AInputQueue_preDispatchEvent@@LIBANDROID'>
      <parameter type-id='dcca009f' name='queue'/>
      <parameter type-id='b7c0a646' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AKeyEvent_getAction' mangled-name='AKeyEvent_getAction' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getAction@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AKeyEvent_getDownTime' mangled-name='AKeyEvent_getDownTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getDownTime@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='key_event'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AKeyEvent_getEventTime' mangled-name='AKeyEvent_getEventTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getEventTime@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='key_event'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AKeyEvent_getFlags' mangled-name='AKeyEvent_getFlags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getFlags@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AKeyEvent_getKeyCode' mangled-name='AKeyEvent_getKeyCode' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getKeyCode@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AKeyEvent_getMetaState' mangled-name='AKeyEvent_getMetaState' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getMetaState@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AKeyEvent_getRepeatCount' mangled-name='AKeyEvent_getRepeatCount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getRepeatCount@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AKeyEvent_getScanCode' mangled-name='AKeyEvent_getScanCode' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AKeyEvent_getScanCode@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ALooper_acquire' mangled-name='ALooper_acquire' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_acquire@@LIBANDROID'>
      <parameter type-id='863667dd' name='looper'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ALooper_addFd' mangled-name='ALooper_addFd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_addFd@@LIBANDROID'>
      <parameter type-id='863667dd' name='looper'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='95e97e5e' name='ident'/>
      <parameter type-id='95e97e5e' name='events'/>
      <parameter type-id='0f66625a' name='callback'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ALooper_forThread' mangled-name='ALooper_forThread' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_forThread@@LIBANDROID'>
      <return type-id='863667dd'/>
    </function-decl>
    <function-decl name='ALooper_pollAll' mangled-name='ALooper_pollAll' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_pollAll@@LIBANDROID'>
      <parameter type-id='95e97e5e' name='timeoutMillis'/>
      <parameter type-id='7292109c' name='outFd'/>
      <parameter type-id='7292109c' name='outEvents'/>
      <parameter type-id='63e171df' name='outData'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ALooper_pollOnce' mangled-name='ALooper_pollOnce' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_pollOnce@@LIBANDROID'>
      <parameter type-id='95e97e5e' name='timeoutMillis'/>
      <parameter type-id='7292109c' name='outFd'/>
      <parameter type-id='7292109c' name='outEvents'/>
      <parameter type-id='63e171df' name='outData'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ALooper_prepare' mangled-name='ALooper_prepare' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_prepare@@LIBANDROID'>
      <parameter type-id='95e97e5e' name='opts'/>
      <return type-id='863667dd'/>
    </function-decl>
    <function-decl name='ALooper_release' mangled-name='ALooper_release' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_release@@LIBANDROID'>
      <parameter type-id='863667dd' name='looper'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ALooper_removeFd' mangled-name='ALooper_removeFd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_removeFd@@LIBANDROID'>
      <parameter type-id='863667dd' name='looper'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ALooper_wake' mangled-name='ALooper_wake' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ALooper_wake@@LIBANDROID'>
      <parameter type-id='863667dd' name='looper'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMotionEvent_getAction' mangled-name='AMotionEvent_getAction' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getAction@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AMotionEvent_getAxisValue' mangled-name='AMotionEvent_getAxisValue' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getAxisValue@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='3ff5601b' name='axis'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getButtonState' mangled-name='AMotionEvent_getButtonState' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getButtonState@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AMotionEvent_getDownTime' mangled-name='AMotionEvent_getDownTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getDownTime@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='key_event'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AMotionEvent_getEdgeFlags' mangled-name='AMotionEvent_getEdgeFlags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getEdgeFlags@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AMotionEvent_getEventTime' mangled-name='AMotionEvent_getEventTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getEventTime@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='key_event'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AMotionEvent_getFlags' mangled-name='AMotionEvent_getFlags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getFlags@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalAxisValue' mangled-name='AMotionEvent_getHistoricalAxisValue' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalAxisValue@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='3ff5601b' name='axis'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalEventTime' mangled-name='AMotionEvent_getHistoricalEventTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalEventTime@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalOrientation' mangled-name='AMotionEvent_getHistoricalOrientation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalOrientation@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalPressure' mangled-name='AMotionEvent_getHistoricalPressure' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalPressure@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalRawX' mangled-name='AMotionEvent_getHistoricalRawX' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalRawX@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalRawY' mangled-name='AMotionEvent_getHistoricalRawY' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalRawY@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalSize' mangled-name='AMotionEvent_getHistoricalSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalSize@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalToolMajor' mangled-name='AMotionEvent_getHistoricalToolMajor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalToolMajor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalToolMinor' mangled-name='AMotionEvent_getHistoricalToolMinor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalToolMinor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalTouchMajor' mangled-name='AMotionEvent_getHistoricalTouchMajor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalTouchMajor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalTouchMinor' mangled-name='AMotionEvent_getHistoricalTouchMinor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalTouchMinor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalX' mangled-name='AMotionEvent_getHistoricalX' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalX@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistoricalY' mangled-name='AMotionEvent_getHistoricalY' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistoricalY@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <parameter type-id='b59d7dce' name='history_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getHistorySize' mangled-name='AMotionEvent_getHistorySize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getHistorySize@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='AMotionEvent_getMetaState' mangled-name='AMotionEvent_getMetaState' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getMetaState@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='event'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AMotionEvent_getOrientation' mangled-name='AMotionEvent_getOrientation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getOrientation@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getPointerCount' mangled-name='AMotionEvent_getPointerCount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getPointerCount@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='AMotionEvent_getPointerId' mangled-name='AMotionEvent_getPointerId' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getPointerId@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AMotionEvent_getPressure' mangled-name='AMotionEvent_getPressure' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getPressure@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getRawX' mangled-name='AMotionEvent_getRawX' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getRawX@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getRawY' mangled-name='AMotionEvent_getRawY' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getRawY@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getSize' mangled-name='AMotionEvent_getSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getSize@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getToolMajor' mangled-name='AMotionEvent_getToolMajor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getToolMajor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getToolMinor' mangled-name='AMotionEvent_getToolMinor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getToolMinor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getToolType' mangled-name='AMotionEvent_getToolType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getToolType@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AMotionEvent_getTouchMajor' mangled-name='AMotionEvent_getTouchMajor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getTouchMajor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getTouchMinor' mangled-name='AMotionEvent_getTouchMinor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getTouchMinor@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getX' mangled-name='AMotionEvent_getX' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getX@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getXOffset' mangled-name='AMotionEvent_getXOffset' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getXOffset@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getXPrecision' mangled-name='AMotionEvent_getXPrecision' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getXPrecision@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getY' mangled-name='AMotionEvent_getY' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getY@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <parameter type-id='b59d7dce' name='pointer_index'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getYOffset' mangled-name='AMotionEvent_getYOffset' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getYOffset@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='AMotionEvent_getYPrecision' mangled-name='AMotionEvent_getYPrecision' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMotionEvent_getYPrecision@@LIBANDROID'>
      <parameter type-id='a7e09f2f' name='motion_event'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='ANativeActivity_finish' mangled-name='ANativeActivity_finish' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeActivity_finish@@LIBANDROID'>
      <parameter type-id='37fc1694' name='activity'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeActivity_hideSoftInput' mangled-name='ANativeActivity_hideSoftInput' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeActivity_hideSoftInput@@LIBANDROID'>
      <parameter type-id='37fc1694' name='activity'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeActivity_setWindowFlags' mangled-name='ANativeActivity_setWindowFlags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeActivity_setWindowFlags@@LIBANDROID'>
      <parameter type-id='37fc1694' name='activity'/>
      <parameter type-id='8f92235e' name='addFlags'/>
      <parameter type-id='8f92235e' name='removeFlags'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeActivity_setWindowFormat' mangled-name='ANativeActivity_setWindowFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeActivity_setWindowFormat@@LIBANDROID'>
      <parameter type-id='37fc1694' name='activity'/>
      <parameter type-id='3ff5601b' name='format'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeActivity_showSoftInput' mangled-name='ANativeActivity_showSoftInput' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeActivity_showSoftInput@@LIBANDROID'>
      <parameter type-id='37fc1694' name='activity'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeWindow_acquire' mangled-name='ANativeWindow_acquire' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_acquire@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeWindow_fromSurface' mangled-name='ANativeWindow_fromSurface' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_fromSurface@@LIBANDROID'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96f3d089' name='surface'/>
      <return type-id='96ae8d47'/>
    </function-decl>
    <function-decl name='ANativeWindow_getFormat' mangled-name='ANativeWindow_getFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_getFormat@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_getHeight' mangled-name='ANativeWindow_getHeight' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_getHeight@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_getWidth' mangled-name='ANativeWindow_getWidth' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_getWidth@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_lock' mangled-name='ANativeWindow_lock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_lock@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='05466fe8' name='outBuffer'/>
      <parameter type-id='b5e45470' name='inOutDirtyBounds'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_release' mangled-name='ANativeWindow_release' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_release@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeWindow_setBuffersGeometry' mangled-name='ANativeWindow_setBuffersGeometry' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_setBuffersGeometry@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='3ff5601b' name='width'/>
      <parameter type-id='3ff5601b' name='height'/>
      <parameter type-id='3ff5601b' name='format'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_toSurface' mangled-name='ANativeWindow_toSurface' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_toSurface@@LIBANDROID'>
      <parameter type-id='fae49a1f' name='env'/>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='96f3d089'/>
    </function-decl>
    <function-decl name='ANativeWindow_unlockAndPost' mangled-name='ANativeWindow_unlockAndPost' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_unlockAndPost@@LIBANDROID'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AObbInfo_delete' mangled-name='AObbInfo_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AObbInfo_delete@@LIBANDROID'>
      <parameter type-id='24159e91' name='obbInfo'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AObbInfo_getFlags' mangled-name='AObbInfo_getFlags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AObbInfo_getFlags@@LIBANDROID'>
      <parameter type-id='24159e91' name='obbInfo'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AObbInfo_getPackageName' mangled-name='AObbInfo_getPackageName' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AObbInfo_getPackageName@@LIBANDROID'>
      <parameter type-id='24159e91' name='obbInfo'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='AObbInfo_getVersion' mangled-name='AObbInfo_getVersion' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AObbInfo_getVersion@@LIBANDROID'>
      <parameter type-id='24159e91' name='obbInfo'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='AObbScanner_getObbInfo' mangled-name='AObbScanner_getObbInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AObbScanner_getObbInfo@@LIBANDROID'>
      <parameter type-id='80f4b756' name='filename'/>
      <return type-id='24159e91'/>
    </function-decl>
    <function-decl name='ASensorEventQueue_disableSensor' mangled-name='ASensorEventQueue_disableSensor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorEventQueue_disableSensor@@LIBANDROID'>
      <parameter type-id='d6d13e99' name='queue'/>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorEventQueue_enableSensor' mangled-name='ASensorEventQueue_enableSensor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorEventQueue_enableSensor@@LIBANDROID'>
      <parameter type-id='d6d13e99' name='queue'/>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorEventQueue_getEvents' mangled-name='ASensorEventQueue_getEvents' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorEventQueue_getEvents@@LIBANDROID'>
      <parameter type-id='d6d13e99' name='queue'/>
      <parameter type-id='cc80875c' name='events'/>
      <parameter type-id='b59d7dce' name='count'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='ASensorEventQueue_hasEvents' mangled-name='ASensorEventQueue_hasEvents' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorEventQueue_hasEvents@@LIBANDROID'>
      <parameter type-id='d6d13e99' name='queue'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorEventQueue_registerSensor' mangled-name='ASensorEventQueue_registerSensor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorEventQueue_registerSensor@@LIBANDROID'>
      <parameter type-id='d6d13e99' name='queue'/>
      <parameter type-id='a76cf719' name='sensor'/>
      <parameter type-id='3ff5601b' name='samplingPeriodUs'/>
      <parameter type-id='9da381c4' name='maxBatchReportLatencyUs'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorEventQueue_setEventRate' mangled-name='ASensorEventQueue_setEventRate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorEventQueue_setEventRate@@LIBANDROID'>
      <parameter type-id='d6d13e99' name='queue'/>
      <parameter type-id='a76cf719' name='sensor'/>
      <parameter type-id='3ff5601b' name='usec'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorManager_configureDirectReport' mangled-name='ASensorManager_configureDirectReport' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_configureDirectReport@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='a76cf719' name='sensor'/>
      <parameter type-id='95e97e5e' name='channelId'/>
      <parameter type-id='95e97e5e' name='rate'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorManager_createEventQueue' mangled-name='ASensorManager_createEventQueue' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_createEventQueue@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='863667dd' name='looper'/>
      <parameter type-id='95e97e5e' name='ident'/>
      <parameter type-id='0f66625a' name='callback'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='d6d13e99'/>
    </function-decl>
    <function-decl name='ASensorManager_createHardwareBufferDirectChannel' mangled-name='ASensorManager_createHardwareBufferDirectChannel' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_createHardwareBufferDirectChannel@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='277bcce5' name='buffer'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorManager_createSharedMemoryDirectChannel' mangled-name='ASensorManager_createSharedMemoryDirectChannel' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_createSharedMemoryDirectChannel@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorManager_destroyDirectChannel' mangled-name='ASensorManager_destroyDirectChannel' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_destroyDirectChannel@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='95e97e5e' name='channelId'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ASensorManager_destroyEventQueue' mangled-name='ASensorManager_destroyEventQueue' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_destroyEventQueue@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='d6d13e99' name='queue'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensorManager_getDefaultSensor' mangled-name='ASensorManager_getDefaultSensor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_getDefaultSensor@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='95e97e5e' name='type'/>
      <return type-id='a76cf719'/>
    </function-decl>
    <function-decl name='ASensorManager_getDefaultSensorEx' mangled-name='ASensorManager_getDefaultSensorEx' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_getDefaultSensorEx@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='95e97e5e' name='type'/>
      <parameter type-id='c894953d' name='wakeUp'/>
      <return type-id='a76cf719'/>
    </function-decl>
    <function-decl name='ASensorManager_getInstance' mangled-name='ASensorManager_getInstance' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_getInstance@@LIBANDROID'>
      <return type-id='5e281929'/>
    </function-decl>
    <function-decl name='ASensorManager_getInstanceForPackage' mangled-name='ASensorManager_getInstanceForPackage' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_getInstanceForPackage@@LIBANDROID'>
      <parameter type-id='80f4b756' name='packageName'/>
      <return type-id='5e281929'/>
    </function-decl>
    <function-decl name='ASensorManager_getSensorList' mangled-name='ASensorManager_getSensorList' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensorManager_getSensorList@@LIBANDROID'>
      <parameter type-id='5e281929' name='manager'/>
      <parameter type-id='66f5f39c' name='list'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensor_getFifoMaxEventCount' mangled-name='ASensor_getFifoMaxEventCount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getFifoMaxEventCount@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensor_getFifoReservedEventCount' mangled-name='ASensor_getFifoReservedEventCount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getFifoReservedEventCount@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensor_getHighestDirectReportRateLevel' mangled-name='ASensor_getHighestDirectReportRateLevel' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getHighestDirectReportRateLevel@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensor_getMinDelay' mangled-name='ASensor_getMinDelay' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getMinDelay@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensor_getName' mangled-name='ASensor_getName' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getName@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='ASensor_getReportingMode' mangled-name='ASensor_getReportingMode' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getReportingMode@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensor_getResolution' mangled-name='ASensor_getResolution' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getResolution@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='ASensor_getStringType' mangled-name='ASensor_getStringType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getStringType@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='ASensor_getType' mangled-name='ASensor_getType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getType@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASensor_getVendor' mangled-name='ASensor_getVendor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_getVendor@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='ASensor_isDirectChannelTypeSupported' mangled-name='ASensor_isDirectChannelTypeSupported' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_isDirectChannelTypeSupported@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <parameter type-id='95e97e5e' name='channelType'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='ASensor_isWakeUpSensor' mangled-name='ASensor_isWakeUpSensor' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASensor_isWakeUpSensor@@LIBANDROID'>
      <parameter type-id='a76cf719' name='sensor'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='ASharedMemory_create' mangled-name='ASharedMemory_create' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASharedMemory_create@@LIBANDROID'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ASharedMemory_getSize' mangled-name='ASharedMemory_getSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASharedMemory_getSize@@LIBANDROID'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='ASharedMemory_setProt' mangled-name='ASharedMemory_setProt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ASharedMemory_setProt@@LIBANDROID'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='95e97e5e' name='prot'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AStorageManager_delete' mangled-name='AStorageManager_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AStorageManager_delete@@LIBANDROID'>
      <parameter type-id='df7f8372' name='mgr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AStorageManager_getMountedObbPath' mangled-name='AStorageManager_getMountedObbPath' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AStorageManager_getMountedObbPath@@LIBANDROID'>
      <parameter type-id='df7f8372' name='mgr'/>
      <parameter type-id='80f4b756' name='filename'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='AStorageManager_isObbMounted' mangled-name='AStorageManager_isObbMounted' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AStorageManager_isObbMounted@@LIBANDROID'>
      <parameter type-id='df7f8372' name='mgr'/>
      <parameter type-id='80f4b756' name='filename'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AStorageManager_mountObb' mangled-name='AStorageManager_mountObb' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AStorageManager_mountObb@@LIBANDROID'>
      <parameter type-id='df7f8372' name='mgr'/>
      <parameter type-id='80f4b756' name='filename'/>
      <parameter type-id='80f4b756' name='key'/>
      <parameter type-id='9299e4b4' name='cb'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AStorageManager_new' mangled-name='AStorageManager_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AStorageManager_new@@LIBANDROID'>
      <return type-id='df7f8372'/>
    </function-decl>
    <function-decl name='AStorageManager_unmountObb' mangled-name='AStorageManager_unmountObb' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AStorageManager_unmountObb@@LIBANDROID'>
      <parameter type-id='df7f8372' name='mgr'/>
      <parameter type-id='80f4b756' name='filename'/>
      <parameter type-id='95e97e5e' name='force'/>
      <parameter type-id='9299e4b4' name='cb'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ATrace_beginSection' mangled-name='ATrace_beginSection' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ATrace_beginSection@@LIBANDROID'>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ATrace_endSection' mangled-name='ATrace_endSection' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ATrace_endSection@@LIBANDROID'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ATrace_isEnabled' mangled-name='ATrace_isEnabled' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ATrace_isEnabled@@LIBANDROID'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='android_getaddrinfofornetwork' mangled-name='android_getaddrinfofornetwork' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='android_getaddrinfofornetwork@@LIBANDROID'>
      <parameter type-id='d42e41d5' name='network'/>
      <parameter type-id='80f4b756' name='node'/>
      <parameter type-id='80f4b756' name='service'/>
      <parameter type-id='3ab8f2e3' name='hints'/>
      <parameter type-id='09bea65e' name='res'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='android_setprocnetwork' mangled-name='android_setprocnetwork' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='android_setprocnetwork@@LIBANDROID'>
      <parameter type-id='d42e41d5' name='network'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='android_setsocknetwork' mangled-name='android_setsocknetwork' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='android_setsocknetwork@@LIBANDROID'>
      <parameter type-id='d42e41d5' name='network'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='32' id='0149d965'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b89f496'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='02a81098'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='02c4e402'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='c2fb5303'/>
    </function-type>
    <function-type size-in-bits='32' id='03e3ce24'>
      <parameter type-id='fae49a1f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='0411e2cc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='a6979e77'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='055a6f41'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='80f4b756'/>
    </function-type>
    <function-type size-in-bits='32' id='06074860'>
      <parameter type-id='fae49a1f'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='073bc15f'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='07f91629'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='09ecfd6f'>
      <parameter type-id='bd54fe1a'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='0ccd5902'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='0df96076'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='d4a328b7'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='0ed3c13b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='0fce6948'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='106bd8ac'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='071e4e5d'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='126e53d0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='148c6738'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='14c3a3b0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='1f3810cb'/>
    </function-type>
    <function-type size-in-bits='32' id='16cc647b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='181a3db0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='973e3c3f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='18caaa83'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='1a9d598b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='1ab7137e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='38565182'/>
    </function-type>
    <function-type size-in-bits='32' id='1cd86ccf'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='1d639c93'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='8ec52105'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='1dba3069'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='1ded82e5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='adf18958'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='1f8f9f18'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='21042e4a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='21fee85f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='223133a2'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='a6979e77'/>
    </function-type>
    <function-type size-in-bits='32' id='26ee7735'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='640aedbe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='27a87596'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2987b0c7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='2b209300'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='2c8ecc6a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='c2fb5303'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2e19a82f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2d5e6f72'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2e613a3e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='2e6e32b5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='c5b6437f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2f02ea7a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='2f03f5b7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='a8d5bec6'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='2f0b7817'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='307d2c7d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='30f9fd2c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='c2fb5303'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='3197286d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='31d87a2b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='181f4ac0'/>
    </function-type>
    <function-type size-in-bits='32' id='32a29f07'>
      <parameter type-id='b5e7b678'/>
      <parameter type-id='b5e7b678'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='386e18fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='a6979e77'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='38d85c8f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='38edd3d4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='96f3d089'/>
      <return type-id='2d5e6f72'/>
    </function-type>
    <function-type size-in-bits='32' id='3b720171'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='96f3d089'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='3d2d0c38'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='1a7fe6b0'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='3d8c391f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='6c9a8402'/>
    </function-type>
    <function-type size-in-bits='32' id='3eafa32f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='3fa8e199'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='41301cf9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='413b072a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='4142d35b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='41b981f8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='42337f0c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='461d0e9f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='467aaa2c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='470aec15'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='b43b1271'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='884af3d2'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='47891898'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='4890b95b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='49617147'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='4a42a622'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='4aec61f6'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='4b5c8855'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='5b7c7bab'/>
    </function-type>
    <function-type size-in-bits='32' id='4bcddb36'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='4bd440f5'>
      <parameter type-id='fae49a1f'/>
      <return type-id='5b89f496'/>
    </function-type>
    <function-type size-in-bits='32' id='4dd30b7b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='4e053e6d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='1a7fe6b0'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='4e7eaf04'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='50ce2e7b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='17ed04c8'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='533df676'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='5368e5fc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='7f83e8c4'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='5432adc5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6c9a8402'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='554d87f1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='558a0aa4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='152bf3a9'/>
    </function-type>
    <function-type size-in-bits='32' id='56c055db'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='57aaeac5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='588dec50'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='59330a47'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='973e3c3f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='59b5ee8a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='59da7e0d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='59ed1e59'>
      <parameter type-id='fae49a1f'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='5ad5f77b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='5d4b6f06'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <return type-id='2c2f1adb'/>
    </function-type>
    <function-type size-in-bits='32' id='5d529e9d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='5e933196'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='5fea4ff8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='aa210e95'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='60e6a162'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='7f83e8c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='625a21da'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='66c316f9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='67748225'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='6878e9a8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='7f83e8c4'/>
    </function-type>
    <function-type size-in-bits='32' id='6935722a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='6ab04463'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2d5e6f72'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='6b5c9008'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='d4a328b7'/>
    </function-type>
    <function-type size-in-bits='32' id='6b6501bd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='6bb2df61'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='e825b06b'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='067e0250'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6c431008'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='6d519b6e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='aa210e95'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6da5b67e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='6e3cf71b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='8dfe2e06'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6e835a19'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6f160e3a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='6292c81e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='70b02f6f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='717ad472'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='088b642f'/>
    </function-type>
    <function-type size-in-bits='32' id='735b63b3'>
      <parameter type-id='b5e7b678'/>
      <parameter type-id='b5e7b678'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='757515fe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='784a10a1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='792136c4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='6292c81e'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='7a6fe7df'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='38565182'/>
    </function-type>
    <function-type size-in-bits='32' id='7ba71958'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <function-type size-in-bits='32' id='7be75d9e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='7de99def'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='3b4676f4'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='5b7c7bab'/>
    </function-type>
    <function-type size-in-bits='32' id='7f57b6c0'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='7f8ca3fe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='81719d6d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='82d29439'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='83574fe4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='837777dd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='84110544'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='d8263a65'/>
    </function-type>
    <function-type size-in-bits='32' id='8570b09c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='85d5402e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='86910635'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='69d41a4a'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='8833c461'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='88f16d4f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='8c344f84'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='8e80bdd8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='8f71b7e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='61dc2b35'/>
    </function-type>
    <function-type size-in-bits='32' id='90c673e3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='9441d304'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='b43b1271'/>
    </function-type>
    <function-type size-in-bits='32' id='9539c406'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='95d32fc8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='9a10f134'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='968ef04b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='96fb4d64'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='9863e9ef'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='98accb07'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='98f7aa67'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='995d71ea'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='071e4e5d'/>
    </function-type>
    <function-type size-in-bits='32' id='a017e9d1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='a1159711'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='a1390ee9'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='70de5c42'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='a18ab994'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <function-type size-in-bits='32' id='a4a61472'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='a8186878'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='ab5a280f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='aca2cd7e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='e825b06b'/>
    </function-type>
    <function-type size-in-bits='32' id='ae2834f4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='b01f64aa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='b10103d8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='b142692f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='b2cf38da'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='b3b907e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='b3d5cbab'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='3b4676f4'/>
    </function-type>
    <function-type size-in-bits='32' id='b66924e8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='b6d76995'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='b6e5053d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='61dc2b35'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='a8d5bec6'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='b7d01ad5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='b7e7edbe'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='b9c972b8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='bcf91e7a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='d8263a65'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='becc631c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='becc7143'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='bed9a8c1'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='cc6e09ca'/>
    </function-type>
    <function-type size-in-bits='32' id='bf1e0391'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='c12bf182'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='c355496b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='181f4ac0'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='3c8ecc03'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c4cf512d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='3b4676f4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c5a3852b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c5c8084e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='26a90f95'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c8bb07fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='088b642f'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='071e4e5d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c9f7d0f5'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='9a10f134'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='ca62bfca'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='caf8409f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='cb425c26'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='071e4e5d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='cd5e6e48'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='6e9854cd'/>
    </function-type>
    <function-type size-in-bits='32' id='d1ff2147'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d318157e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <return type-id='2c2f1adb'/>
    </function-type>
    <function-type size-in-bits='32' id='d413ac7e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='adf18958'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d47c1022'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='65b69bb3'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d47f2e6e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='d664a6f7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='d776b039'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='da11822e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='96f3d089'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='da4ac88c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='152bf3a9'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='aa210e95'/>
    </function-type>
    <function-type size-in-bits='32' id='da5acea4'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='dad530df'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='db9b93fa'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='dc0b1ac7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='2c2f1adb'/>
      <return type-id='feee141c'/>
    </function-type>
    <function-type size-in-bits='32' id='dc1ed48c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='dcbb605e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='dd7295b3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='e0efb9de'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='e1e0781a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='80f4b756'/>
      <return type-id='70de5c42'/>
    </function-type>
    <function-type size-in-bits='32' id='e24417ff'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='e3e7515c'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='e5e01142'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='8dfe2e06'/>
    </function-type>
    <function-type size-in-bits='32' id='e612672d'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='e6efff49'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='e81ac6f8'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='8dfe2e06'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='e8f54abb'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <return type-id='c36bf49e'/>
    </function-type>
    <function-type size-in-bits='32' id='eb796c24'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='6e9854cd'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='2c2f1adb'/>
      <parameter type-id='d8263a65'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='ed3044e3'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <return type-id='973e3c3f'/>
    </function-type>
    <function-type size-in-bits='32' id='ed5f0798'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='ee0744fc'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='c8745fdc'/>
    </function-type>
    <function-type size-in-bits='32' id='ef48369b'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='c8745fdc'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='efa46d99'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='5b7c7bab'/>
      <parameter type-id='3b4676f4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='f341e414'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='1f3810cb'/>
      <parameter type-id='cc6e09ca'/>
      <return type-id='96f3d089'/>
    </function-type>
    <function-type size-in-bits='32' id='f4d3e94e'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='0b9c02cb'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='f5043860'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='feee141c'/>
      <parameter type-id='d4a328b7'/>
      <return type-id='6292c81e'/>
    </function-type>
    <function-type size-in-bits='32' id='f521429f'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='3ff5601b'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='f6de0a0a'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter is-variadic='yes'/>
      <return type-id='9a10f134'/>
    </function-type>
    <function-type size-in-bits='32' id='fba5b0d7'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='38565182'/>
      <parameter type-id='2aee9912'/>
      <return type-id='1a7fe6b0'/>
    </function-type>
    <function-type size-in-bits='32' id='fcac2709'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <return type-id='0b9c02cb'/>
    </function-type>
    <function-type size-in-bits='32' id='fe213acd'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='96f3d089'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='38565182'/>
      <parameter type-id='786cbe73'/>
      <return type-id='adf18958'/>
    </function-type>
    <function-type size-in-bits='32' id='fea2690f'>
      <parameter type-id='fae49a1f'/>
      <parameter type-id='70de5c42'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='1f3810cb'/>
    </function-type>
    <pointer-type-def type-id='106bd8ac' size-in-bits='32' id='01eb6566'/>
    <pointer-type-def type-id='b66924e8' size-in-bits='32' id='0290ef52'/>
    <pointer-type-def type-id='dd7295b3' size-in-bits='32' id='0323d66f'/>
    <pointer-type-def type-id='3d8c391f' size-in-bits='32' id='03bcacf3'/>
    <pointer-type-def type-id='1e7918a7' size-in-bits='32' id='047d4fff'/>
    <pointer-type-def type-id='14c3a3b0' size-in-bits='32' id='04aa9df2'/>
    <pointer-type-def type-id='9539c406' size-in-bits='32' id='04b3e5a0'/>
    <pointer-type-def type-id='1b5f78db' size-in-bits='32' id='05466fe8'/>
    <pointer-type-def type-id='c12bf182' size-in-bits='32' id='0571aa74'/>
    <pointer-type-def type-id='eb796c24' size-in-bits='32' id='060c7d5e'/>
    <pointer-type-def type-id='5fa8a65a' size-in-bits='32' id='067e0250'/>
    <pointer-type-def type-id='16cc647b' size-in-bits='32' id='06fbd437'/>
    <pointer-type-def type-id='8dfe2e06' size-in-bits='32' id='071e4e5d'/>
    <pointer-type-def type-id='db9b93fa' size-in-bits='32' id='0736b484'/>
    <pointer-type-def type-id='6d519b6e' size-in-bits='32' id='075b7a00'/>
    <pointer-type-def type-id='f41387f0' size-in-bits='32' id='081c2b23'/>
    <pointer-type-def type-id='055a6f41' size-in-bits='32' id='08565ebd'/>
    <pointer-type-def type-id='c9f7d0f5' size-in-bits='32' id='090a6901'/>
    <pointer-type-def type-id='7a6fe7df' size-in-bits='32' id='09176273'/>
    <pointer-type-def type-id='0ed3c13b' size-in-bits='32' id='097c7407'/>
    <pointer-type-def type-id='784a10a1' size-in-bits='32' id='09b49e9d'/>
    <pointer-type-def type-id='61e7b2c0' size-in-bits='32' id='09bea65e'/>
    <pointer-type-def type-id='dcbb605e' size-in-bits='32' id='0a7e4740'/>
    <pointer-type-def type-id='6ab04463' size-in-bits='32' id='0ae13aef'/>
    <pointer-type-def type-id='30f9fd2c' size-in-bits='32' id='0ba6a8b6'/>
    <pointer-type-def type-id='d413ac7e' size-in-bits='32' id='0cb5bb00'/>
    <pointer-type-def type-id='dc1ed48c' size-in-bits='32' id='0d5970ee'/>
    <pointer-type-def type-id='afb20d38' size-in-bits='32' id='0d7186ae'/>
    <pointer-type-def type-id='90c673e3' size-in-bits='32' id='0de4af77'/>
    <pointer-type-def type-id='2f0b7817' size-in-bits='32' id='0e5e0cdb'/>
    <pointer-type-def type-id='b0749e8e' size-in-bits='32' id='0faa6e74'/>
    <pointer-type-def type-id='470aec15' size-in-bits='32' id='10182119'/>
    <pointer-type-def type-id='bed9a8c1' size-in-bits='32' id='13196dfd'/>
    <pointer-type-def type-id='7b0c0278' size-in-bits='32' id='136b85b5'/>
    <pointer-type-def type-id='11179a67' size-in-bits='32' id='138c2704'/>
    <pointer-type-def type-id='fdf9f098' size-in-bits='32' id='14c7458e'/>
    <pointer-type-def type-id='38d85c8f' size-in-bits='32' id='151a1d63'/>
    <pointer-type-def type-id='bf1e0391' size-in-bits='32' id='15887ec5'/>
    <pointer-type-def type-id='fb46a283' size-in-bits='32' id='15b6e673'/>
    <pointer-type-def type-id='e7c31614' size-in-bits='32' id='161c039a'/>
    <pointer-type-def type-id='aca2cd7e' size-in-bits='32' id='162473c8'/>
    <pointer-type-def type-id='e0efb9de' size-in-bits='32' id='17d955f8'/>
    <pointer-type-def type-id='c3a70532' size-in-bits='32' id='17ed04c8'/>
    <pointer-type-def type-id='95d32fc8' size-in-bits='32' id='187251e2'/>
    <pointer-type-def type-id='ca62bfca' size-in-bits='32' id='1930d02c'/>
    <pointer-type-def type-id='181a3db0' size-in-bits='32' id='195d3e42'/>
    <pointer-type-def type-id='ea9788c3' size-in-bits='32' id='1cdc10c3'/>
    <pointer-type-def type-id='fe213acd' size-in-bits='32' id='1d2f8a91'/>
    <pointer-type-def type-id='d1ff2147' size-in-bits='32' id='1db4c5bb'/>
    <pointer-type-def type-id='0cd1084c' size-in-bits='32' id='1e82fc3a'/>
    <pointer-type-def type-id='5fea4ff8' size-in-bits='32' id='1f57b15a'/>
    <pointer-type-def type-id='56c055db' size-in-bits='32' id='1fda464f'/>
    <pointer-type-def type-id='31d87a2b' size-in-bits='32' id='2041a8d7'/>
    <pointer-type-def type-id='84110544' size-in-bits='32' id='210c37a6'/>
    <pointer-type-def type-id='f521429f' size-in-bits='32' id='238ccd13'/>
    <pointer-type-def type-id='57aaeac5' size-in-bits='32' id='239d7ad9'/>
    <pointer-type-def type-id='0b958588' size-in-bits='32' id='24159e91'/>
    <pointer-type-def type-id='5e933196' size-in-bits='32' id='255ff5d8'/>
    <pointer-type-def type-id='c73fabea' size-in-bits='32' id='26924198'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <pointer-type-def type-id='0eede28d' size-in-bits='32' id='277bcce5'/>
    <pointer-type-def type-id='32a29f07' size-in-bits='32' id='2841c17b'/>
    <pointer-type-def type-id='ef48369b' size-in-bits='32' id='2c684c9f'/>
    <pointer-type-def type-id='cdc60214' size-in-bits='32' id='2cb5879a'/>
    <pointer-type-def type-id='d776b039' size-in-bits='32' id='2dab161d'/>
    <pointer-type-def type-id='b7e7edbe' size-in-bits='32' id='2dcc8b98'/>
    <pointer-type-def type-id='a1159711' size-in-bits='32' id='2deb20e5'/>
    <pointer-type-def type-id='22e56ec2' size-in-bits='32' id='2e0abaf0'/>
    <pointer-type-def type-id='59330a47' size-in-bits='32' id='30411993'/>
    <pointer-type-def type-id='1ab7137e' size-in-bits='32' id='30974818'/>
    <pointer-type-def type-id='83574fe4' size-in-bits='32' id='30b9a8ce'/>
    <pointer-type-def type-id='dc0b1ac7' size-in-bits='32' id='31ebf17b'/>
    <pointer-type-def type-id='30a4d497' size-in-bits='32' id='3239e3af'/>
    <pointer-type-def type-id='82d29439' size-in-bits='32' id='326df5b5'/>
    <pointer-type-def type-id='becc7143' size-in-bits='32' id='3271bf2f'/>
    <pointer-type-def type-id='42337f0c' size-in-bits='32' id='3318dad6'/>
    <pointer-type-def type-id='2f03f5b7' size-in-bits='32' id='3358ddb3'/>
    <pointer-type-def type-id='223133a2' size-in-bits='32' id='33683384'/>
    <pointer-type-def type-id='41b981f8' size-in-bits='32' id='337e1672'/>
    <pointer-type-def type-id='554d87f1' size-in-bits='32' id='339f696d'/>
    <pointer-type-def type-id='18caaa83' size-in-bits='32' id='3459b4cf'/>
    <pointer-type-def type-id='777a3c35' size-in-bits='32' id='346ca4cd'/>
    <pointer-type-def type-id='2e6e32b5' size-in-bits='32' id='348c02e9'/>
    <pointer-type-def type-id='eeed1f5d' size-in-bits='32' id='349a45dd'/>
    <pointer-type-def type-id='7f8ca3fe' size-in-bits='32' id='34c67260'/>
    <pointer-type-def type-id='307d2c7d' size-in-bits='32' id='362e2831'/>
    <pointer-type-def type-id='9c4a3aff' size-in-bits='32' id='36c07807'/>
    <pointer-type-def type-id='b142692f' size-in-bits='32' id='377b5e63'/>
    <pointer-type-def type-id='6a6c3f8a' size-in-bits='32' id='37b2d578'/>
    <pointer-type-def type-id='788ba3f2' size-in-bits='32' id='37fc04a0'/>
    <pointer-type-def type-id='1471d4b9' size-in-bits='32' id='37fc1694'/>
    <pointer-type-def type-id='6e835a19' size-in-bits='32' id='3a8fe115'/>
    <pointer-type-def type-id='afd35b5b' size-in-bits='32' id='3ab8f2e3'/>
    <pointer-type-def type-id='9bf2d596' size-in-bits='32' id='3b4676f4'/>
    <pointer-type-def type-id='3847ab67' size-in-bits='32' id='3b89821f'/>
    <pointer-type-def type-id='2987b0c7' size-in-bits='32' id='3bd86cfb'/>
    <pointer-type-def type-id='897a51fb' size-in-bits='32' id='3c8ecc03'/>
    <pointer-type-def type-id='663ed4a0' size-in-bits='32' id='3f4fcd66'/>
    <pointer-type-def type-id='fd376fcf' size-in-bits='32' id='40a3d947'/>
    <pointer-type-def type-id='7de99def' size-in-bits='32' id='40f183ab'/>
    <pointer-type-def type-id='6da5b67e' size-in-bits='32' id='412650f8'/>
    <pointer-type-def type-id='7be75d9e' size-in-bits='32' id='4127a730'/>
    <pointer-type-def type-id='b9c972b8' size-in-bits='32' id='413559e2'/>
    <pointer-type-def type-id='0fce6948' size-in-bits='32' id='41d61b6a'/>
    <pointer-type-def type-id='2ef4b79c' size-in-bits='32' id='41f63f2a'/>
    <pointer-type-def type-id='e24417ff' size-in-bits='32' id='4278623b'/>
    <pointer-type-def type-id='d664a6f7' size-in-bits='32' id='44bea17b'/>
    <pointer-type-def type-id='2b209300' size-in-bits='32' id='461c5f2a'/>
    <pointer-type-def type-id='a017e9d1' size-in-bits='32' id='47653e05'/>
    <pointer-type-def type-id='49617147' size-in-bits='32' id='476f48bb'/>
    <pointer-type-def type-id='baffb083' size-in-bits='32' id='478e3663'/>
    <pointer-type-def type-id='148c6738' size-in-bits='32' id='478facc2'/>
    <pointer-type-def type-id='a4a61472' size-in-bits='32' id='47bc557c'/>
    <pointer-type-def type-id='ba4fbcc4' size-in-bits='32' id='498e4692'/>
    <pointer-type-def type-id='0149d965' size-in-bits='32' id='4a0b9bf1'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='32' id='4aafb922'/>
    <pointer-type-def type-id='06074860' size-in-bits='32' id='4b15419a'/>
    <pointer-type-def type-id='1dba3069' size-in-bits='32' id='4ed90115'/>
    <pointer-type-def type-id='6878e9a8' size-in-bits='32' id='4f68d4b2'/>
    <pointer-type-def type-id='ae2834f4' size-in-bits='32' id='4f7677f6'/>
    <pointer-type-def type-id='e8f54abb' size-in-bits='32' id='500eebf7'/>
    <pointer-type-def type-id='da4ac88c' size-in-bits='32' id='5353c67e'/>
    <pointer-type-def type-id='f0b1600d' size-in-bits='32' id='547a22ad'/>
    <pointer-type-def type-id='59ed1e59' size-in-bits='32' id='5796afad'/>
    <pointer-type-def type-id='1fc4034c' size-in-bits='32' id='57d98aaa'/>
    <pointer-type-def type-id='67748225' size-in-bits='32' id='582ba311'/>
    <pointer-type-def type-id='f341e414' size-in-bits='32' id='58398eee'/>
    <pointer-type-def type-id='0411e2cc' size-in-bits='32' id='59e7b6c6'/>
    <pointer-type-def type-id='50ce2e7b' size-in-bits='32' id='5a4c25bf'/>
    <pointer-type-def type-id='406f4753' size-in-bits='32' id='5a5e1f63'/>
    <pointer-type-def type-id='5221b18a' size-in-bits='32' id='5c0abad8'/>
    <pointer-type-def type-id='fea2690f' size-in-bits='32' id='5d99509b'/>
    <pointer-type-def type-id='5ad5f77b' size-in-bits='32' id='5da2c37f'/>
    <pointer-type-def type-id='e3e7515c' size-in-bits='32' id='5db5877e'/>
    <pointer-type-def type-id='de193dd8' size-in-bits='32' id='5e281929'/>
    <pointer-type-def type-id='b6e5053d' size-in-bits='32' id='5ee69201'/>
    <pointer-type-def type-id='4890b95b' size-in-bits='32' id='5f929ab7'/>
    <pointer-type-def type-id='d47c1022' size-in-bits='32' id='601f438c'/>
    <pointer-type-def type-id='8c344f84' size-in-bits='32' id='60306f66'/>
    <pointer-type-def type-id='efa46d99' size-in-bits='32' id='61d681d5'/>
    <pointer-type-def type-id='9194f5e2' size-in-bits='32' id='61e7b2c0'/>
    <pointer-type-def type-id='973e3c3f' size-in-bits='32' id='6292c81e'/>
    <pointer-type-def type-id='c5c8084e' size-in-bits='32' id='629961b8'/>
    <pointer-type-def type-id='86910635' size-in-bits='32' id='62d9dee9'/>
    <pointer-type-def type-id='0713c6a2' size-in-bits='32' id='6327cc10'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <pointer-type-def type-id='07f91629' size-in-bits='32' id='63f7d65d'/>
    <pointer-type-def type-id='af8c6a20' size-in-bits='32' id='640aedbe'/>
    <pointer-type-def type-id='4a42a622' size-in-bits='32' id='64ca4b84'/>
    <pointer-type-def type-id='0df96076' size-in-bits='32' id='666fc788'/>
    <pointer-type-def type-id='4bcddb36' size-in-bits='32' id='66ebe6b0'/>
    <pointer-type-def type-id='310273a5' size-in-bits='32' id='66f5f39c'/>
    <pointer-type-def type-id='588dec50' size-in-bits='32' id='67514b72'/>
    <pointer-type-def type-id='47891898' size-in-bits='32' id='67a46ff2'/>
    <pointer-type-def type-id='4b5c8855' size-in-bits='32' id='691ba251'/>
    <pointer-type-def type-id='b6d76995' size-in-bits='32' id='692552f9'/>
    <pointer-type-def type-id='cd5e6e48' size-in-bits='32' id='69b7386a'/>
    <pointer-type-def type-id='c17f92e4' size-in-bits='32' id='69d41a4a'/>
    <pointer-type-def type-id='81719d6d' size-in-bits='32' id='6c160b51'/>
    <pointer-type-def type-id='66c316f9' size-in-bits='32' id='6c56e815'/>
    <pointer-type-def type-id='7f57b6c0' size-in-bits='32' id='6fc0eca2'/>
    <pointer-type-def type-id='6c431008' size-in-bits='32' id='7139225a'/>
    <pointer-type-def type-id='2ca86b0d' size-in-bits='32' id='715a5bad'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='32' id='7292109c'/>
    <pointer-type-def type-id='625a21da' size-in-bits='32' id='72f7c194'/>
    <pointer-type-def type-id='38e516d0' size-in-bits='32' id='7376f3a6'/>
    <pointer-type-def type-id='2c8ecc6a' size-in-bits='32' id='747a49e4'/>
    <pointer-type-def type-id='0ccd5902' size-in-bits='32' id='74823d0c'/>
    <pointer-type-def type-id='92343ec8' size-in-bits='32' id='7566205e'/>
    <pointer-type-def type-id='e31c3bd7' size-in-bits='32' id='759fcd0f'/>
    <pointer-type-def type-id='1d639c93' size-in-bits='32' id='764ac7bf'/>
    <pointer-type-def type-id='530c1a32' size-in-bits='32' id='76b5a6a0'/>
    <pointer-type-def type-id='21fee85f' size-in-bits='32' id='771014ab'/>
    <pointer-type-def type-id='3b720171' size-in-bits='32' id='782c53f5'/>
    <pointer-type-def type-id='a981db8b' size-in-bits='32' id='786cbe73'/>
    <pointer-type-def type-id='60e6a162' size-in-bits='32' id='7f0ac28c'/>
    <pointer-type-def type-id='0b9c02cb' size-in-bits='32' id='7f83e8c4'/>
    <pointer-type-def type-id='4bd440f5' size-in-bits='32' id='7fdf58e1'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <pointer-type-def type-id='ee40a95f' size-in-bits='32' id='81e381a7'/>
    <pointer-type-def type-id='547a22ad' size-in-bits='32' id='83445a85'/>
    <pointer-type-def type-id='440aaf49' size-in-bits='32' id='85c463b1'/>
    <pointer-type-def type-id='b02ad8ee' size-in-bits='32' id='863667dd'/>
    <pointer-type-def type-id='02a81098' size-in-bits='32' id='87e0b5ea'/>
    <pointer-type-def type-id='7c1d680c' size-in-bits='32' id='884af3d2'/>
    <pointer-type-def type-id='b7d01ad5' size-in-bits='32' id='88d99751'/>
    <pointer-type-def type-id='becc631c' size-in-bits='32' id='8a1f7e9e'/>
    <pointer-type-def type-id='03e3ce24' size-in-bits='32' id='8bc971a6'/>
    <pointer-type-def type-id='5d529e9d' size-in-bits='32' id='8c22ffe9'/>
    <pointer-type-def type-id='413b072a' size-in-bits='32' id='8c4e1254'/>
    <pointer-type-def type-id='f62c522d' size-in-bits='32' id='8ec52105'/>
    <pointer-type-def type-id='1a9d598b' size-in-bits='32' id='916299d7'/>
    <pointer-type-def type-id='59da7e0d' size-in-bits='32' id='921cf101'/>
    <pointer-type-def type-id='b3b907e8' size-in-bits='32' id='93737cc2'/>
    <pointer-type-def type-id='fcac2709' size-in-bits='32' id='9447819d'/>
    <pointer-type-def type-id='2f02ea7a' size-in-bits='32' id='95fba39c'/>
    <pointer-type-def type-id='d81eed6b' size-in-bits='32' id='963caaab'/>
    <pointer-type-def type-id='739fb858' size-in-bits='32' id='96ae8d47'/>
    <pointer-type-def type-id='558a0aa4' size-in-bits='32' id='978c735e'/>
    <pointer-type-def type-id='2e19a82f' size-in-bits='32' id='99167093'/>
    <pointer-type-def type-id='fba5b0d7' size-in-bits='32' id='9ac8b1e3'/>
    <pointer-type-def type-id='f4d3e94e' size-in-bits='32' id='9aeb7958'/>
    <pointer-type-def type-id='6b5c9008' size-in-bits='32' id='9b3c0ac2'/>
    <pointer-type-def type-id='bf075117' size-in-bits='32' id='9cb9149f'/>
    <pointer-type-def type-id='e612672d' size-in-bits='32' id='a01a6e09'/>
    <pointer-type-def type-id='2e613a3e' size-in-bits='32' id='a0ba6dc8'/>
    <pointer-type-def type-id='3197286d' size-in-bits='32' id='a0bc56e9'/>
    <pointer-type-def type-id='5d4b6f06' size-in-bits='32' id='a23a76e0'/>
    <pointer-type-def type-id='837777dd' size-in-bits='32' id='a3ea0661'/>
    <pointer-type-def type-id='1ded82e5' size-in-bits='32' id='a4a48a09'/>
    <pointer-type-def type-id='467aaa2c' size-in-bits='32' id='a4a6a786'/>
    <pointer-type-def type-id='ee0744fc' size-in-bits='32' id='a55b35a6'/>
    <pointer-type-def type-id='e53ab91c' size-in-bits='32' id='a5a1fc5a'/>
    <pointer-type-def type-id='07f10124' size-in-bits='32' id='a5fd6882'/>
    <pointer-type-def type-id='4aec61f6' size-in-bits='32' id='a60dd490'/>
    <pointer-type-def type-id='6bb2df61' size-in-bits='32' id='a617346d'/>
    <pointer-type-def type-id='461d0e9f' size-in-bits='32' id='a642a393'/>
    <pointer-type-def type-id='adf18958' size-in-bits='32' id='a6979e77'/>
    <pointer-type-def type-id='10d84009' size-in-bits='32' id='a76cf719'/>
    <pointer-type-def type-id='d318157e' size-in-bits='32' id='a7d6acc8'/>
    <pointer-type-def type-id='0aecdd5f' size-in-bits='32' id='a7e09f2f'/>
    <pointer-type-def type-id='27a87596' size-in-bits='32' id='a86eb340'/>
    <pointer-type-def type-id='3ebf19c8' size-in-bits='32' id='a8d5bec6'/>
    <pointer-type-def type-id='a8186878' size-in-bits='32' id='a937264a'/>
    <pointer-type-def type-id='26ee7735' size-in-bits='32' id='a975aa19'/>
    <pointer-type-def type-id='9a10f134' size-in-bits='32' id='aa210e95'/>
    <pointer-type-def type-id='98accb07' size-in-bits='32' id='ac33476b'/>
    <pointer-type-def type-id='4e053e6d' size-in-bits='32' id='ac4ad749'/>
    <pointer-type-def type-id='98f7aa67' size-in-bits='32' id='ac4e6cb3'/>
    <pointer-type-def type-id='717ad472' size-in-bits='32' id='ac74c0c4'/>
    <pointer-type-def type-id='c8bb07fa' size-in-bits='32' id='af95e824'/>
    <pointer-type-def type-id='85d5402e' size-in-bits='32' id='b0061f70'/>
    <pointer-type-def type-id='b7c0a646' size-in-bits='32' id='b045fc04'/>
    <pointer-type-def type-id='c4cf512d' size-in-bits='32' id='b049b821'/>
    <pointer-type-def type-id='d988e2e8' size-in-bits='32' id='b09bab5e'/>
    <pointer-type-def type-id='f5043860' size-in-bits='32' id='b181362a'/>
    <pointer-type-def type-id='c5a3852b' size-in-bits='32' id='b263848f'/>
    <pointer-type-def type-id='02c4e402' size-in-bits='32' id='b286ae14'/>
    <pointer-type-def type-id='d6dabff9' size-in-bits='32' id='b5e45470'/>
    <pointer-type-def type-id='b8e35a82' size-in-bits='32' id='b5e7b678'/>
    <pointer-type-def type-id='caf8409f' size-in-bits='32' id='b5f4f133'/>
    <pointer-type-def type-id='ac070eda' size-in-bits='32' id='b60be548'/>
    <pointer-type-def type-id='4c8890e6' size-in-bits='32' id='b795223c'/>
    <pointer-type-def type-id='80020150' size-in-bits='32' id='b7c0a646'/>
    <pointer-type-def type-id='05d4c620' size-in-bits='32' id='b8263143'/>
    <pointer-type-def type-id='09ecfd6f' size-in-bits='32' id='b877ce2b'/>
    <pointer-type-def type-id='59b5ee8a' size-in-bits='32' id='bbecc3fc'/>
    <pointer-type-def type-id='e81ac6f8' size-in-bits='32' id='bbfff1aa'/>
    <pointer-type-def type-id='5368e5fc' size-in-bits='32' id='bc4a7a06'/>
    <pointer-type-def type-id='6935722a' size-in-bits='32' id='bcee08ac'/>
    <pointer-type-def type-id='ed3044e3' size-in-bits='32' id='bd4849d7'/>
    <pointer-type-def type-id='a18ab994' size-in-bits='32' id='bd98ffce'/>
    <pointer-type-def type-id='dad530df' size-in-bits='32' id='be0ed943'/>
    <pointer-type-def type-id='995d71ea' size-in-bits='32' id='be2cecec'/>
    <pointer-type-def type-id='8f71b7e8' size-in-bits='32' id='be49c182'/>
    <pointer-type-def type-id='f6de0a0a' size-in-bits='32' id='bf87e894'/>
    <pointer-type-def type-id='d47f2e6e' size-in-bits='32' id='c14258b8'/>
    <pointer-type-def type-id='ab5a280f' size-in-bits='32' id='c2280e7b'/>
    <pointer-type-def type-id='c8745fdc' size-in-bits='32' id='c2fb5303'/>
    <pointer-type-def type-id='b10103d8' size-in-bits='32' id='c32cfa12'/>
    <pointer-type-def type-id='ebc81181' size-in-bits='32' id='c3a70532'/>
    <pointer-type-def type-id='8e80bdd8' size-in-bits='32' id='c404650a'/>
    <pointer-type-def type-id='bcf91e7a' size-in-bits='32' id='c503a924'/>
    <pointer-type-def type-id='386e18fa' size-in-bits='32' id='c541e6a4'/>
    <pointer-type-def type-id='8bac99cf' size-in-bits='32' id='c5b6437f'/>
    <pointer-type-def type-id='86608c17' size-in-bits='32' id='c6fcc407'/>
    <pointer-type-def type-id='f7c5ae1e' size-in-bits='32' id='c70198d4'/>
    <pointer-type-def type-id='792136c4' size-in-bits='32' id='c8abb79e'/>
    <pointer-type-def type-id='4142d35b' size-in-bits='32' id='c8bc780f'/>
    <pointer-type-def type-id='88f16d4f' size-in-bits='32' id='caa57963'/>
    <pointer-type-def type-id='735b63b3' size-in-bits='32' id='cb44d457'/>
    <pointer-type-def type-id='d3154b53' size-in-bits='32' id='cc80875c'/>
    <pointer-type-def type-id='5432adc5' size-in-bits='32' id='ccc141a1'/>
    <pointer-type-def type-id='7a58eebd' size-in-bits='32' id='cdc60214'/>
    <pointer-type-def type-id='b2cf38da' size-in-bits='32' id='ce1853bc'/>
    <pointer-type-def type-id='e6efff49' size-in-bits='32' id='ce9d67cd'/>
    <pointer-type-def type-id='9863e9ef' size-in-bits='32' id='cf05fa23'/>
    <pointer-type-def type-id='073bc15f' size-in-bits='32' id='d08b57b3'/>
    <pointer-type-def type-id='da5acea4' size-in-bits='32' id='d1173c4e'/>
    <pointer-type-def type-id='8833c461' size-in-bits='32' id='d31f1c35'/>
    <pointer-type-def type-id='8570b09c' size-in-bits='32' id='d3651c96'/>
    <pointer-type-def type-id='cc6e09ca' size-in-bits='32' id='d4a328b7'/>
    <pointer-type-def type-id='968ef04b' size-in-bits='32' id='d5b0b547'/>
    <pointer-type-def type-id='70b02f6f' size-in-bits='32' id='d696f7b3'/>
    <pointer-type-def type-id='ee156a12' size-in-bits='32' id='d6d13e99'/>
    <pointer-type-def type-id='41301cf9' size-in-bits='32' id='d7560895'/>
    <pointer-type-def type-id='9441d304' size-in-bits='32' id='d7ea3436'/>
    <pointer-type-def type-id='1a7fe6b0' size-in-bits='32' id='d8263a65'/>
    <pointer-type-def type-id='7ba71958' size-in-bits='32' id='d82ed742'/>
    <pointer-type-def type-id='3eafa32f' size-in-bits='32' id='db28fdcb'/>
    <pointer-type-def type-id='18581c08' size-in-bits='32' id='dcca009f'/>
    <pointer-type-def type-id='a87003ef' size-in-bits='32' id='dda33667'/>
    <pointer-type-def type-id='e5e01142' size-in-bits='32' id='dddcefc4'/>
    <pointer-type-def type-id='f331f373' size-in-bits='32' id='de638c93'/>
    <pointer-type-def type-id='6fc023b3' size-in-bits='32' id='df7f8372'/>
    <pointer-type-def type-id='126e53d0' size-in-bits='32' id='df8dc702'/>
    <pointer-type-def type-id='3d2d0c38' size-in-bits='32' id='e0227512'/>
    <pointer-type-def type-id='da11822e' size-in-bits='32' id='e333ff60'/>
    <pointer-type-def type-id='bebf8fb7' size-in-bits='32' id='e48f1427'/>
    <pointer-type-def type-id='6e3cf71b' size-in-bits='32' id='e4b27ecf'/>
    <pointer-type-def type-id='38edd3d4' size-in-bits='32' id='e4f2ab66'/>
    <pointer-type-def type-id='b3d5cbab' size-in-bits='32' id='e5a87447'/>
    <pointer-type-def type-id='ae6a1c55' size-in-bits='32' id='e65fd0e5'/>
    <pointer-type-def type-id='4e7eaf04' size-in-bits='32' id='e747dee6'/>
    <pointer-type-def type-id='757515fe' size-in-bits='32' id='e8139a80'/>
    <pointer-type-def type-id='2a561b69' size-in-bits='32' id='e88cea79'/>
    <pointer-type-def type-id='e1e0781a' size-in-bits='32' id='e905d0ac'/>
    <pointer-type-def type-id='ad707ada' size-in-bits='32' id='e90c4311'/>
    <pointer-type-def type-id='b01f64aa' size-in-bits='32' id='ea8867ec'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <pointer-type-def type-id='1cd86ccf' size-in-bits='32' id='eb164d0b'/>
    <pointer-type-def type-id='ed5f0798' size-in-bits='32' id='ed0795aa'/>
    <pointer-type-def type-id='2e67d715' size-in-bits='32' id='ee3187c5'/>
    <pointer-type-def type-id='21042e4a' size-in-bits='32' id='f0a0ff54'/>
    <pointer-type-def type-id='8d9552b9' size-in-bits='32' id='f0e04c01'/>
    <pointer-type-def type-id='6b6501bd' size-in-bits='32' id='f1191df9'/>
    <pointer-type-def type-id='f5bb5067' size-in-bits='32' id='f3610084'/>
    <pointer-type-def type-id='a1390ee9' size-in-bits='32' id='f39f8bbd'/>
    <pointer-type-def type-id='3fa8e199' size-in-bits='32' id='f4bbad8d'/>
    <pointer-type-def type-id='c355496b' size-in-bits='32' id='f569444f'/>
    <pointer-type-def type-id='533df676' size-in-bits='32' id='f7e564c8'/>
    <pointer-type-def type-id='1f8f9f18' size-in-bits='32' id='f8af7982'/>
    <pointer-type-def type-id='d357872a' size-in-bits='32' id='fae49a1f'/>
    <pointer-type-def type-id='4dd30b7b' size-in-bits='32' id='fb38167f'/>
    <pointer-type-def type-id='cb425c26' size-in-bits='32' id='fb79cfe8'/>
    <pointer-type-def type-id='6f160e3a' size-in-bits='32' id='fce8e074'/>
    <pointer-type-def type-id='96fb4d64' size-in-bits='32' id='ff535cb6'/>
    <pointer-type-def type-id='cfd4ccfe' size-in-bits='32' id='fffe71bc'/>
    <qualified-type-def type-id='afb20d38' const='yes' id='036f5893'/>
    <qualified-type-def type-id='92343ec8' const='yes' id='0a81a029'/>
    <qualified-type-def type-id='5c3d41cf' const='yes' id='0aecdd5f'/>
    <qualified-type-def type-id='7a58eebd' const='yes' id='0eede28d'/>
    <qualified-type-def type-id='a01f4379' const='yes' id='10d84009'/>
    <qualified-type-def type-id='3847ab67' const='yes' id='27297916'/>
    <qualified-type-def type-id='d6dabff9' const='yes' id='2a561b69'/>
    <qualified-type-def type-id='788ba3f2' const='yes' id='2d0d8ce7'/>
    <qualified-type-def type-id='fd376fcf' const='yes' id='2e96e5aa'/>
    <qualified-type-def type-id='adf18958' const='yes' id='3ebf19c8'/>
    <qualified-type-def type-id='759fcd0f' const='yes' id='4c08731c'/>
    <qualified-type-def type-id='cc6e09ca' const='yes' id='5fa8a65a'/>
    <qualified-type-def type-id='ee40a95f' const='yes' id='615b0cd6'/>
    <qualified-type-def type-id='f331f373' const='yes' id='62294afc'/>
    <qualified-type-def type-id='bacf3393' const='yes' id='745c9152'/>
    <qualified-type-def type-id='40cec2e5' const='yes' id='777a3c35'/>
    <qualified-type-def type-id='c8745fdc' const='yes' id='7c1d680c'/>
    <qualified-type-def type-id='f5bb5067' const='yes' id='86608c17'/>
    <qualified-type-def type-id='0b9c02cb' const='yes' id='897a51fb'/>
    <qualified-type-def type-id='973e3c3f' const='yes' id='8bac99cf'/>
    <qualified-type-def type-id='5d81b3b0' const='yes' id='94d46bf9'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <qualified-type-def type-id='8dfe2e06' const='yes' id='9bf2d596'/>
    <qualified-type-def type-id='d81eed6b' const='yes' id='9e890de2'/>
    <qualified-type-def type-id='c73fabea' const='yes' id='a3cec311'/>
    <qualified-type-def type-id='406f4753' const='yes' id='a3f5ae0e'/>
    <qualified-type-def type-id='0994533b' const='yes' id='a981db8b'/>
    <qualified-type-def type-id='3f4fcd66' const='yes' id='a9c47199'/>
    <qualified-type-def type-id='1a7fe6b0' const='yes' id='af8c6a20'/>
    <qualified-type-def type-id='9194f5e2' const='yes' id='afd35b5b'/>
    <qualified-type-def type-id='547a22ad' const='yes' id='b8e35a82'/>
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <qualified-type-def type-id='ad414f12' const='yes' id='bebf8fb7'/>
    <qualified-type-def type-id='9a10f134' const='yes' id='c17f92e4'/>
    <qualified-type-def type-id='0cd1084c' const='yes' id='c41c33a1'/>
    <qualified-type-def type-id='d818aa2e' const='yes' id='cfd4ccfe'/>
    <qualified-type-def type-id='801a266d' const='yes' id='e7c31614'/>
    <qualified-type-def type-id='4c8890e6' const='yes' id='f4bc7ed7'/>
    <qualified-type-def type-id='b7b5d51d' const='yes' id='f62c522d'/>
    <qualified-type-def type-id='3ff5601b' volatile='yes' id='fda05812'/>
    <reference-type-def kind='lvalue' type-id='afb20d38' size-in-bits='32' id='09718062'/>
    <reference-type-def kind='lvalue' type-id='a3cec311' size-in-bits='32' id='157d4f95'/>
    <reference-type-def kind='lvalue' type-id='036f5893' size-in-bits='32' id='1d48a4ef'/>
    <reference-type-def kind='rvalue' type-id='afb20d38' size-in-bits='32' id='21aceb0c'/>
    <reference-type-def kind='rvalue' type-id='ac070eda' size-in-bits='32' id='22afd12e'/>
    <reference-type-def kind='lvalue' type-id='94d46bf9' size-in-bits='32' id='2965d00d'/>
    <reference-type-def kind='lvalue' type-id='615b0cd6' size-in-bits='32' id='32555dd0'/>
    <reference-type-def kind='lvalue' type-id='f4bc7ed7' size-in-bits='32' id='35bbd563'/>
    <reference-type-def kind='rvalue' type-id='759fcd0f' size-in-bits='32' id='38a2e557'/>
    <reference-type-def kind='lvalue' type-id='c41c33a1' size-in-bits='32' id='3f651d85'/>
    <reference-type-def kind='rvalue' type-id='3f4fcd66' size-in-bits='32' id='400beb12'/>
    <reference-type-def kind='lvalue' type-id='a3f5ae0e' size-in-bits='32' id='43c128f8'/>
    <reference-type-def kind='rvalue' type-id='f331f373' size-in-bits='32' id='4bd3cc83'/>
    <reference-type-def kind='lvalue' type-id='759fcd0f' size-in-bits='32' id='538ff78b'/>
    <reference-type-def kind='lvalue' type-id='9e890de2' size-in-bits='32' id='55c0ab8c'/>
    <reference-type-def kind='lvalue' type-id='62294afc' size-in-bits='32' id='6100d52e'/>
    <reference-type-def kind='lvalue' type-id='406f4753' size-in-bits='32' id='665e3247'/>
    <reference-type-def kind='rvalue' type-id='6a6c3f8a' size-in-bits='32' id='6c7becbe'/>
    <reference-type-def kind='lvalue' type-id='d81eed6b' size-in-bits='32' id='923ca45f'/>
    <reference-type-def kind='lvalue' type-id='0a81a029' size-in-bits='32' id='990ef79d'/>
    <reference-type-def kind='lvalue' type-id='745c9152' size-in-bits='32' id='a1b8f99c'/>
    <reference-type-def kind='rvalue' type-id='788ba3f2' size-in-bits='32' id='a7d93406'/>
    <reference-type-def kind='lvalue' type-id='2d0d8ce7' size-in-bits='32' id='ad5493d3'/>
    <reference-type-def kind='rvalue' type-id='d81eed6b' size-in-bits='32' id='ae76ea7b'/>
    <reference-type-def kind='rvalue' type-id='92343ec8' size-in-bits='32' id='b7bb3fdc'/>
    <reference-type-def kind='rvalue' type-id='c73fabea' size-in-bits='32' id='d63387de'/>
    <reference-type-def kind='lvalue' type-id='27297916' size-in-bits='32' id='d649c690'/>
    <reference-type-def kind='lvalue' type-id='2e96e5aa' size-in-bits='32' id='e38b5b64'/>
    <reference-type-def kind='lvalue' type-id='3f4fcd66' size-in-bits='32' id='eaa01bc0'/>
    <reference-type-def kind='lvalue' type-id='4c08731c' size-in-bits='32' id='eb4d644e'/>
    <reference-type-def kind='rvalue' type-id='4c8890e6' size-in-bits='32' id='f9cf09ea'/>
    <reference-type-def kind='lvalue' type-id='a9c47199' size-in-bits='32' id='ff3f0fad'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='char16_t' size-in-bits='16' id='801a266d'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='32' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='0d77e947'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='void' id='48b5725f'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <typedef-decl name='AAdditionalInfoEvent' type-id='fa893a23' id='1f241bc2'/>
    <typedef-decl name='AAssetManager' type-id='7907d453' id='f41387f0'/>
    <typedef-decl name='AChoreographer' type-id='d1af9805' id='7b0c0278'/>
    <typedef-decl name='AChoreographer_frameCallback' type-id='b877ce2b' id='f687fd19'/>
    <typedef-decl name='AConfiguration' type-id='9896136e' id='11179a67'/>
    <typedef-decl name='ADynamicSensorEvent' type-id='984bb689' id='22cf32ce'/>
    <typedef-decl name='AHardwareBuffer' type-id='4d45f31e' id='7a58eebd'/>
    <typedef-decl name='AHardwareBuffer_Desc' type-id='820e87ae' id='f5bb5067'/>
    <typedef-decl name='AHeadTrackerEvent' type-id='a5ebc1e2' id='87e93501'/>
    <typedef-decl name='AHeadingEvent' type-id='2ef93276' id='65984dc1'/>
    <typedef-decl name='AHeartRateEvent' type-id='14a24fe6' id='a4ce2d4d'/>
    <typedef-decl name='AInputEvent' type-id='80020150' id='5c3d41cf'/>
    <typedef-decl name='AInputQueue' type-id='81665327' id='18581c08'/>
    <typedef-decl name='ALimitedAxesImuEvent' type-id='7ab472e0' id='c8b559e9'/>
    <typedef-decl name='ALimitedAxesImuUncalibratedEvent' type-id='506dc484' id='4e60ff55'/>
    <typedef-decl name='ALooper' type-id='da89ab6d' id='b02ad8ee'/>
    <typedef-decl name='ALooper_callbackFunc' type-id='d08b57b3' id='0f66625a'/>
    <typedef-decl name='AMetaDataEvent' type-id='6de4236b' id='e3dd54c6'/>
    <typedef-decl name='ANativeActivity' type-id='67c862fe' id='1471d4b9'/>
    <typedef-decl name='ANativeWindow' type-id='4d637dbf' id='739fb858'/>
    <typedef-decl name='ANativeWindow_Buffer' type-id='e90e56ba' id='1b5f78db'/>
    <typedef-decl name='AObbInfo' type-id='3e61dcc9' id='0b958588'/>
    <typedef-decl name='ARect' type-id='c9ee9172' id='d6dabff9'/>
    <typedef-decl name='ASensor' type-id='68510cba' id='a01f4379'/>
    <typedef-decl name='ASensorEvent' type-id='38b55796' id='d3154b53'/>
    <typedef-decl name='ASensorEventQueue' type-id='e7195b11' id='ee156a12'/>
    <typedef-decl name='ASensorList' type-id='fffe71bc' id='310273a5'/>
    <typedef-decl name='ASensorManager' type-id='85c2b5e1' id='de193dd8'/>
    <typedef-decl name='ASensorRef' type-id='a76cf719' id='d818aa2e'/>
    <typedef-decl name='ASensorVector' type-id='b6b8bef1' id='48a1b186'/>
    <typedef-decl name='AStorageManager' type-id='56516754' id='6fc023b3'/>
    <typedef-decl name='AStorageManager_obbCallbackFunc' type-id='238ccd13' id='9299e4b4'/>
    <typedef-decl name='AUncalibratedEvent' type-id='225d4590' id='f1b274b1'/>
    <typedef-decl name='JNIEnv' type-id='c9459134' id='d357872a'/>
    <typedef-decl name='JNINativeMethod' type-id='e754f6f2' id='b7b5d51d'/>
    <typedef-decl name='JavaVM' type-id='d607eddf' id='ebc81181'/>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' id='7f896fb4'/>
    <typedef-decl name='__int16_t' type-id='a2185560' id='03896e23'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' id='0c9942d2'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__kernel_loff_t' type-id='1eb56b1e' id='537a730e'/>
    <typedef-decl name='__kernel_long_t' type-id='bd54fe1a' id='6a11bd61'/>
    <typedef-decl name='__kernel_off_t' type-id='6a11bd61' id='8dda407a'/>
    <typedef-decl name='__kernel_ssize_t' type-id='95e97e5e' id='b6b3ebaf'/>
    <typedef-decl name='__socklen_t' type-id='3ff5601b' id='83f97a0a'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='0d77e947' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='int16_t' type-id='03896e23' id='23bd8cb5'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='jarray' type-id='85c463b1' id='65b69bb3'/>
    <typedef-decl name='jboolean' type-id='b96825af' id='cc6e09ca'/>
    <typedef-decl name='jbooleanArray' type-id='715a5bad' id='e825b06b'/>
    <typedef-decl name='jbyte' type-id='ee31ee44' id='adf18958'/>
    <typedef-decl name='jbyteArray' type-id='047d4fff' id='61dc2b35'/>
    <typedef-decl name='jchar' type-id='149c6638' id='8dfe2e06'/>
    <typedef-decl name='jcharArray' type-id='349a45dd' id='088b642f'/>
    <typedef-decl name='jclass' type-id='a5a1fc5a' id='70de5c42'/>
    <typedef-decl name='jdouble' type-id='a0eb0f08' id='973e3c3f'/>
    <typedef-decl name='jdoubleArray' type-id='76b5a6a0' id='feee141c'/>
    <typedef-decl name='jfieldID' type-id='ee3187c5' id='1f3810cb'/>
    <typedef-decl name='jfloat' type-id='a6c45d85' id='1a7fe6b0'/>
    <typedef-decl name='jfloatArray' type-id='dda33667' id='6e9854cd'/>
    <typedef-decl name='jint' type-id='3ff5601b' id='0b9c02cb'/>
    <typedef-decl name='jintArray' type-id='0faa6e74' id='181f4ac0'/>
    <typedef-decl name='jlong' type-id='9da381c4' id='c8745fdc'/>
    <typedef-decl name='jlongArray' type-id='15b6e673' id='b43b1271'/>
    <typedef-decl name='jmethodID' type-id='b09bab5e' id='38565182'/>
    <typedef-decl name='jobject' type-id='478e3663' id='96f3d089'/>
    <typedef-decl name='jobjectArray' type-id='14c7458e' id='2d5e6f72'/>
    <typedef-decl name='jobjectRefType' type-id='4f771c8a' id='c36bf49e'/>
    <typedef-decl name='jshort' type-id='23bd8cb5' id='9a10f134'/>
    <typedef-decl name='jshortArray' type-id='3239e3af' id='152bf3a9'/>
    <typedef-decl name='jsize' type-id='0b9c02cb' id='2c2f1adb'/>
    <typedef-decl name='jstring' type-id='e65fd0e5' id='5b7c7bab'/>
    <typedef-decl name='jthrowable' type-id='a5fd6882' id='5b89f496'/>
    <typedef-decl name='jvalue' type-id='2eab072b' id='0994533b'/>
    <typedef-decl name='jweak' type-id='478e3663' id='6c9a8402'/>
    <typedef-decl name='loff_t' type-id='537a730e' id='69bf7bee'/>
    <typedef-decl name='native_handle_t' type-id='3181ea79' id='40cec2e5'/>
    <typedef-decl name='net_handle_t' type-id='9c313c2d' id='d42e41d5'/>
    <typedef-decl name='off64_t' type-id='69bf7bee' id='05d4c620'/>
    <typedef-decl name='off_t' type-id='8dda407a' id='ad707ada'/>
    <typedef-decl name='pthread_mutex_t' type-id='92fa54c8' id='7a6844eb'/>
    <typedef-decl name='sa_family_t' type-id='8efea9e5' id='376fda66'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='socklen_t' type-id='83f97a0a' id='6b2697b0'/>
    <typedef-decl name='ssize_t' type-id='b6b3ebaf' id='79a0948f'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='va_list' type-id='7f896fb4' id='2aee9912'/>
    <union-decl name='jvalue' visibility='default' is-declaration-only='yes' id='2eab072b'/>
    <namespace-decl name='android'>
      <class-decl name='Asset' visibility='default' is-declaration-only='yes' id='663ed4a0'>
        <member-type access='private'>
          <enum-decl name='AccessMode' id='250d9dc8'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='ACCESS_UNKNOWN' value='0'/>
            <enumerator name='ACCESS_RANDOM' value='1'/>
            <enumerator name='ACCESS_STREAMING' value='2'/>
            <enumerator name='ACCESS_BUFFER' value='3'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='AssetDir' visibility='default' is-declaration-only='yes' id='e31c3bd7'>
        <member-type access='private'>
          <class-decl name='FileInfo' visibility='default' is-declaration-only='yes' id='32d026f1'/>
        </member-type>
      </class-decl>
      <class-decl name='BBinder' visibility='default' is-declaration-only='yes' id='a4d376c6'/>
      <class-decl name='BnInterface&lt;android::IObbActionListener&gt;' size-in-bits='192' visibility='default' id='2144ef38'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f7c5ae1e'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='a4d376c6'/>
      </class-decl>
      <class-decl name='BnObbActionListener' size-in-bits='192' visibility='default' id='b4c0d64f'>
        <base-class access='public' layout-offset-in-bits='0' type-id='2144ef38'/>
      </class-decl>
      <class-decl name='IInterface' visibility='default' is-declaration-only='yes' id='40b6343a'/>
      <class-decl name='IMountService' size-in-bits='96' visibility='default' id='bf075117'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343a'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' mangled-name='_ZN7android13IMountService10descriptorE' visibility='default'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='default_impl' type-id='f331f373' mangled-name='_ZN7android13IMountService12default_implE' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='IMountService' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IObbActionListener' size-in-bits='96' visibility='default' id='f7c5ae1e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343a'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' mangled-name='_ZN7android18IObbActionListener10descriptorE' visibility='default'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='default_impl' type-id='92343ec8' mangled-name='_ZN7android18IObbActionListener12default_implE' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='IObbActionListener' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Mutex' size-in-bits='32' visibility='default' id='406f4753'>
        <member-type access='public'>
          <class-decl name='Autolock' size-in-bits='32' visibility='default' id='fd376fcf'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mLock' type-id='665e3247' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='665e3247'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='5a5e1f63'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='e38b5b64'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mMutex' type-id='7a6844eb' visibility='default'/>
        </data-member>
        <member-function access='public' destructor='yes'>
          <function-decl name='~Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='43c128f8'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='ObbFile' visibility='default' is-declaration-only='yes' id='c02827ab'/>
      <class-decl name='RefBase' visibility='default' is-declaration-only='yes' id='12f619c0'/>
      <class-decl name='ResTable_config' size-in-bits='512' is-struct='yes' visibility='default' id='f8926d95'>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab597'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='mcc' type-id='149c6638' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='mnc' type-id='149c6638' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f72' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='imsi' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab598'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='language' type-id='49f79167' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='country' type-id='49f79167' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f73' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='locale' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab599'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='orientation' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='8'>
                  <var-decl name='touchscreen' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='density' type-id='149c6638' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f74' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='screenType' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca1c'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='MASK_KEYSHIDDEN' value='3'/>
            <enumerator name='KEYSHIDDEN_ANY' value='0'/>
            <enumerator name='KEYSHIDDEN_NO' value='1'/>
            <enumerator name='KEYSHIDDEN_YES' value='2'/>
            <enumerator name='KEYSHIDDEN_SOFT' value='3'/>
          </enum-decl>
        </member-type>
        <member-type access='public'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca1d'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='MASK_NAVHIDDEN' value='12'/>
            <enumerator name='SHIFT_NAVHIDDEN' value='2'/>
            <enumerator name='NAVHIDDEN_ANY' value='0'/>
            <enumerator name='NAVHIDDEN_NO' value='4'/>
            <enumerator name='NAVHIDDEN_YES' value='8'/>
          </enum-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59a'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='keyboard' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='8'>
                  <var-decl name='navigation' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='inputFlags' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='24'>
                  <var-decl name='inputPad0' type-id='b96825af' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f75' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='input' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59b'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='screenWidth' type-id='149c6638' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='screenHeight' type-id='149c6638' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f76' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='screenSize' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59c'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='sdkVersion' type-id='149c6638' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='minorVersion' type-id='149c6638' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f77' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='version' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca1e'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='MASK_SCREENSIZE' value='15'/>
            <enumerator name='SCREENSIZE_ANY' value='0'/>
            <enumerator name='SCREENSIZE_SMALL' value='1'/>
            <enumerator name='SCREENSIZE_NORMAL' value='2'/>
            <enumerator name='SCREENSIZE_LARGE' value='3'/>
            <enumerator name='SCREENSIZE_XLARGE' value='4'/>
            <enumerator name='MASK_SCREENLONG' value='48'/>
            <enumerator name='SHIFT_SCREENLONG' value='4'/>
            <enumerator name='SCREENLONG_ANY' value='0'/>
            <enumerator name='SCREENLONG_NO' value='16'/>
            <enumerator name='SCREENLONG_YES' value='32'/>
            <enumerator name='MASK_LAYOUTDIR' value='192'/>
            <enumerator name='SHIFT_LAYOUTDIR' value='6'/>
            <enumerator name='LAYOUTDIR_ANY' value='0'/>
            <enumerator name='LAYOUTDIR_LTR' value='64'/>
            <enumerator name='LAYOUTDIR_RTL' value='128'/>
          </enum-decl>
        </member-type>
        <member-type access='public'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca1f'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='MASK_UI_MODE_TYPE' value='15'/>
            <enumerator name='UI_MODE_TYPE_ANY' value='0'/>
            <enumerator name='UI_MODE_TYPE_NORMAL' value='1'/>
            <enumerator name='UI_MODE_TYPE_DESK' value='2'/>
            <enumerator name='UI_MODE_TYPE_CAR' value='3'/>
            <enumerator name='UI_MODE_TYPE_TELEVISION' value='4'/>
            <enumerator name='UI_MODE_TYPE_APPLIANCE' value='5'/>
            <enumerator name='UI_MODE_TYPE_WATCH' value='6'/>
            <enumerator name='UI_MODE_TYPE_VR_HEADSET' value='7'/>
            <enumerator name='MASK_UI_MODE_NIGHT' value='48'/>
            <enumerator name='SHIFT_UI_MODE_NIGHT' value='4'/>
            <enumerator name='UI_MODE_NIGHT_ANY' value='0'/>
            <enumerator name='UI_MODE_NIGHT_NO' value='16'/>
            <enumerator name='UI_MODE_NIGHT_YES' value='32'/>
          </enum-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59d'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='screenLayout' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='8'>
                  <var-decl name='uiMode' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='smallestScreenWidthDp' type-id='149c6638' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f78' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='screenConfig' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59e'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='screenWidthDp' type-id='149c6638' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='screenHeightDp' type-id='149c6638' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f79' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='screenSizeDp' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <member-type access='public'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca20'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='MASK_SCREENROUND' value='3'/>
            <enumerator name='SCREENROUND_ANY' value='0'/>
            <enumerator name='SCREENROUND_NO' value='1'/>
            <enumerator name='SCREENROUND_YES' value='2'/>
          </enum-decl>
        </member-type>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59f'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='screenLayout2' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='8'>
                  <var-decl name='colorMode' type-id='b96825af' visibility='default'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='16'>
                  <var-decl name='screenConfigPad2' type-id='149c6638' visibility='default'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='' type-id='e7f43f7a' visibility='default'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='screenConfig2' type-id='8f92235e' visibility='default'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='size' type-id='8f92235e' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='' type-id='ac5ab597' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='' type-id='ac5ab598' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='' type-id='ac5ab599' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='' type-id='ac5ab59a' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='' type-id='ac5ab59b' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='' type-id='ac5ab59c' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='' type-id='ac5ab59d' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='' type-id='ac5ab59e' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='localeScript' type-id='8e0573fd' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='localeVariant' type-id='8e100159' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='' type-id='ac5ab59f' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='416'>
          <var-decl name='localeScriptWasComputed' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='424'>
          <var-decl name='localeNumberingSystem' type-id='8e100159' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='SortedVector&lt;ObbCallback *&gt;' visibility='default' is-declaration-only='yes' id='5d81b3b0'/>
      <class-decl name='String16' size-in-bits='32' visibility='default' id='c73fabea'>
        <member-type access='private'>
          <class-decl name='StaticData&lt;35U&gt;' size-in-bits='608' is-struct='yes' visibility='default' id='ee40a95f'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='b9930aae' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='data' type-id='5da7196d' visibility='default'/>
            </data-member>
            <member-function access='public'>
              <function-decl name='StaticData' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='81e381a7' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='StaticData' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='81e381a7' is-artificial='yes'/>
                <parameter type-id='32555dd0'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='StaticData&lt;38U&gt;' size-in-bits='640' is-struct='yes' visibility='default' id='0cd1084c'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='b9930aae' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='data' type-id='19b37a54' visibility='default'/>
            </data-member>
            <member-function access='public'>
              <function-decl name='StaticData' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='1e82fc3a' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='StaticData' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='1e82fc3a' is-artificial='yes'/>
                <parameter type-id='3f651d85'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kIsSharedBufferAllocated' type-id='b9930aae' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mString' type-id='161c039a' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='d63387de'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='b59d7dce'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='161c039a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='161c039a'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='a1b8f99c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~String16' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='String8' visibility='default' is-declaration-only='yes' id='bacf3393'/>
      <class-decl name='Vector&lt;ObbCallback *&gt;' size-in-bits='160' visibility='default' id='3847ab67'>
        <base-class access='private' layout-offset-in-bits='0' type-id='86634f01'/>
        <member-type access='private'>
          <typedef-decl name='compar_t' type-id='cb44d457' id='2dd55475'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='compar_r_t' type-id='2841c17b' id='071d6ee0'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='83445a85' id='764c9ed0'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='b5e7b678' id='0dc1dca0'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <parameter type-id='d649c690'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <parameter type-id='2965d00d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='VectorImpl' visibility='default' is-declaration-only='yes' id='86634f01'>
        <member-type access='private'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca19'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='HAS_TRIVIAL_CTOR' value='1'/>
            <enumerator name='HAS_TRIVIAL_DTOR' value='2'/>
            <enumerator name='HAS_TRIVIAL_COPY' value='4'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='sp&lt;AStorageManager&gt;' size-in-bits='32' visibility='default' id='4c8890e6'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='df7f8372' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <parameter type-id='df7f8372'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <parameter type-id='35bbd563'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <parameter type-id='f9cf09ea'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;ObbActionListener&gt;' size-in-bits='32' visibility='default' id='788ba3f2'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='7376f3a6' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <parameter type-id='7376f3a6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <parameter type-id='ad5493d3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <parameter type-id='a7d93406'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IMountService&gt;' size-in-bits='32' visibility='default' id='f331f373'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='9cb9149f' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <parameter type-id='9cb9149f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <parameter type-id='6100d52e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <parameter type-id='4bd3cc83'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IObbActionListener&gt;' visibility='default' is-declaration-only='yes' id='92343ec8'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='c70198d4' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='c70198d4'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='990ef79d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='b7bb3fdc'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp&lt;ObbActionListener&gt;' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='ad5493d3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='std'>
      <class-decl name='__va_list' size-in-bits='32' is-struct='yes' visibility='default' id='30357e0a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='__ap' type-id='eaa32e2f' visibility='default'/>
        </data-member>
      </class-decl>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair&lt;android::Asset *, std::__1::default_delete&lt;android::Asset&gt; &gt;' size-in-bits='32' visibility='default' id='ba4fbcc4'>
          <base-class access='private' layout-offset-in-bits='0' type-id='9c4a3aff'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='0713c6a2'/>
          <member-function access='public' constructor='yes'>
            <function-decl name='__compressed_pair&lt;android::Asset *, std::__1::default_delete&lt;android::Asset&gt; &gt;' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='498e4692' is-artificial='yes'/>
              <parameter type-id='400beb12'/>
              <parameter type-id='ae76ea7b'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair&lt;android::AssetDir *, std::__1::default_delete&lt;android::AssetDir&gt; &gt;' size-in-bits='32' visibility='default' id='2ef4b79c'>
          <base-class access='private' layout-offset-in-bits='0' type-id='22e56ec2'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='8d9552b9'/>
          <member-function access='public' constructor='yes'>
            <function-decl name='__compressed_pair&lt;android::AssetDir *, std::__1::default_delete&lt;android::AssetDir&gt; &gt;' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='41f63f2a' is-artificial='yes'/>
              <parameter type-id='38a2e557'/>
              <parameter type-id='21aceb0c'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::Asset *, 0, false&gt;' size-in-bits='32' is-struct='yes' visibility='default' id='9c4a3aff'>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='eaa01bc0' id='67d4e493'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='ff3f0fad' id='f0058e83'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='3f4fcd66' visibility='default'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='36c07807' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem&lt;android::Asset *, void&gt;' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='36c07807' is-artificial='yes'/>
              <parameter type-id='400beb12'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::AssetDir *, 0, false&gt;' size-in-bits='32' is-struct='yes' visibility='default' id='22e56ec2'>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='538ff78b' id='ca6ad396'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='eb4d644e' id='547dd01a'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='759fcd0f' visibility='default'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='2e0abaf0' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem&lt;android::AssetDir *, void&gt;' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='2e0abaf0' is-artificial='yes'/>
              <parameter type-id='38a2e557'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::Asset&gt;, 1, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='0713c6a2'>
          <base-class access='private' layout-offset-in-bits='0' type-id='d81eed6b'/>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='923ca45f' id='971bc93a'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='55c0ab8c' id='7cdb9e0e'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='6327cc10' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::AssetDir&gt;, 1, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='8d9552b9'>
          <base-class access='private' layout-offset-in-bits='0' type-id='afb20d38'/>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='09718062' id='542c7635'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='1d48a4ef' id='1586f681'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='f0e04c01' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::Asset, std::__1::default_delete&lt;android::Asset&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='f292a5ec'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='162705dd' id='67cbb073'/>
          </member-type>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::AssetDir, std::__1::default_delete&lt;android::AssetDir&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='fa06986c'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='8e4d349d' id='5d35c65b'/>
          </member-type>
        </class-decl>
        <class-decl name='default_delete&lt;android::Asset&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='d81eed6b'>
          <member-function access='public'>
            <function-decl name='default_delete' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='963caaab' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='default_delete&lt;android::AssetDir&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='afb20d38'>
          <member-function access='public'>
            <function-decl name='default_delete' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0d7186ae' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='unique_ptr&lt;android::Asset, std::__1::default_delete&lt;android::Asset&gt; &gt;' size-in-bits='32' visibility='default' id='ac070eda'>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='d81eed6b' id='5f48c471'/>
          </member-type>
          <member-type access='private'>
