<abi-corpus version='2.1' architecture='elf-arm' soname='libnativewindow.so'>
  <elf-needed>
    <dependency name='libcutils.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libui.so'/>
    <dependency name='android.hardware.graphics.common@1.1.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AHardwareBuffer_acquire' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_allocate' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_describe' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_isSupported' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_lock' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_lockAndGetInfo' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_lockPlanes' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_recvHandleFromUnixSocket' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_release' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_sendHandleToUnixSocket' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AHardwareBuffer_unlock' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_acquire' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_getBuffersDataSpace' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_getFormat' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_getHeight' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_getWidth' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_lock' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_release' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_setBuffersDataSpace' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_setBuffersGeometry' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_setBuffersTransform' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_setFrameRate' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_tryAllocateBuffers' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ANativeWindow_unlockAndPost' version='LIBNATIVEWINDOW' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <array-type-def dimensions='1' type-id='b1c6a238' size-in-bits='384' id='9dfa4d7b'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <class-decl name='AHardwareBuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d45f31e'/>
    <class-decl name='AHardwareBuffer_Desc' size-in-bits='320' is-struct='yes' visibility='default' id='820e87ae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='width' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='height' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='layers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='format' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='usage' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stride' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='rfu0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rfu1' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AHardwareBuffer_Plane' size-in-bits='96' is-struct='yes' visibility='default' id='b428b08b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pixelStride' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rowStride' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AHardwareBuffer_Planes' size-in-bits='416' is-struct='yes' visibility='default' id='940e9668'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='planeCount' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='planes' type-id='9dfa4d7b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ANativeWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d637dbf'/>
    <class-decl name='ANativeWindow_Buffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='e90e56ba'/>
    <class-decl name='ARect' size-in-bits='128' is-struct='yes' visibility='default' id='c9ee9172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='top' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bottom' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='AHardwareBuffer_acquire' mangled-name='AHardwareBuffer_acquire' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_acquire@@LIBNATIVEWINDOW'>
      <parameter type-id='cdc60214' name='buffer'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_allocate' mangled-name='AHardwareBuffer_allocate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_allocate@@LIBNATIVEWINDOW'>
      <parameter type-id='c6fcc407' name='desc'/>
      <parameter type-id='2cb5879a' name='outBuffer'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_describe' mangled-name='AHardwareBuffer_describe' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_describe@@LIBNATIVEWINDOW'>
      <parameter type-id='277bcce5' name='buffer'/>
      <parameter type-id='f3610084' name='outDesc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_isSupported' mangled-name='AHardwareBuffer_isSupported' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_isSupported@@LIBNATIVEWINDOW'>
      <parameter type-id='c6fcc407' name='desc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_lock' mangled-name='AHardwareBuffer_lock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_lock@@LIBNATIVEWINDOW'>
      <parameter type-id='cdc60214' name='buffer'/>
      <parameter type-id='9c313c2d' name='usage'/>
      <parameter type-id='3ff5601b' name='fence'/>
      <parameter type-id='e88cea79' name='rect'/>
      <parameter type-id='63e171df' name='outVirtualAddress'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_lockAndGetInfo' mangled-name='AHardwareBuffer_lockAndGetInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_lockAndGetInfo@@LIBNATIVEWINDOW'>
      <parameter type-id='cdc60214' name='buffer'/>
      <parameter type-id='9c313c2d' name='usage'/>
      <parameter type-id='3ff5601b' name='fence'/>
      <parameter type-id='e88cea79' name='rect'/>
      <parameter type-id='63e171df' name='outVirtualAddress'/>
      <parameter type-id='4aafb922' name='outBytesPerPixel'/>
      <parameter type-id='4aafb922' name='outBytesPerStride'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_lockPlanes' mangled-name='AHardwareBuffer_lockPlanes' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_lockPlanes@@LIBNATIVEWINDOW'>
      <parameter type-id='cdc60214' name='buffer'/>
      <parameter type-id='9c313c2d' name='usage'/>
      <parameter type-id='3ff5601b' name='fence'/>
      <parameter type-id='e88cea79' name='rect'/>
      <parameter type-id='36b2fc1e' name='outPlanes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_recvHandleFromUnixSocket' mangled-name='AHardwareBuffer_recvHandleFromUnixSocket' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_recvHandleFromUnixSocket@@LIBNATIVEWINDOW'>
      <parameter type-id='95e97e5e' name='socketFd'/>
      <parameter type-id='2cb5879a' name='outBuffer'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_release' mangled-name='AHardwareBuffer_release' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_release@@LIBNATIVEWINDOW'>
      <parameter type-id='cdc60214' name='buffer'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_sendHandleToUnixSocket' mangled-name='AHardwareBuffer_sendHandleToUnixSocket' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_sendHandleToUnixSocket@@LIBNATIVEWINDOW'>
      <parameter type-id='277bcce5' name='buffer'/>
      <parameter type-id='95e97e5e' name='socketFd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AHardwareBuffer_unlock' mangled-name='AHardwareBuffer_unlock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AHardwareBuffer_unlock@@LIBNATIVEWINDOW'>
      <parameter type-id='cdc60214' name='buffer'/>
      <parameter type-id='4aafb922' name='fence'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ANativeWindow_acquire' mangled-name='ANativeWindow_acquire' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_acquire@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeWindow_getBuffersDataSpace' mangled-name='ANativeWindow_getBuffersDataSpace' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_getBuffersDataSpace@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_getFormat' mangled-name='ANativeWindow_getFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_getFormat@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_getHeight' mangled-name='ANativeWindow_getHeight' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_getHeight@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_getWidth' mangled-name='ANativeWindow_getWidth' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_getWidth@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_lock' mangled-name='ANativeWindow_lock' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_lock@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='05466fe8' name='outBuffer'/>
      <parameter type-id='b5e45470' name='inOutDirtyBounds'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_release' mangled-name='ANativeWindow_release' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_release@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeWindow_setBuffersDataSpace' mangled-name='ANativeWindow_setBuffersDataSpace' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_setBuffersDataSpace@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='3ff5601b' name='transform'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_setBuffersGeometry' mangled-name='ANativeWindow_setBuffersGeometry' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_setBuffersGeometry@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='3ff5601b' name='width'/>
      <parameter type-id='3ff5601b' name='height'/>
      <parameter type-id='3ff5601b' name='format'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_setBuffersTransform' mangled-name='ANativeWindow_setBuffersTransform' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_setBuffersTransform@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='3ff5601b' name='transform'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_setFrameRate' mangled-name='ANativeWindow_setFrameRate' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_setFrameRate@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='a6c45d85' name='frameRate'/>
      <parameter type-id='ee31ee44' name='compatibility'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='ANativeWindow_tryAllocateBuffers' mangled-name='ANativeWindow_tryAllocateBuffers' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_tryAllocateBuffers@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ANativeWindow_unlockAndPost' mangled-name='ANativeWindow_unlockAndPost' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ANativeWindow_unlockAndPost@@LIBNATIVEWINDOW'>
      <parameter type-id='96ae8d47' name='window'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <pointer-type-def type-id='1b5f78db' size-in-bits='32' id='05466fe8'/>
    <pointer-type-def type-id='0eede28d' size-in-bits='32' id='277bcce5'/>
    <pointer-type-def type-id='cdc60214' size-in-bits='32' id='2cb5879a'/>
    <pointer-type-def type-id='26b17c11' size-in-bits='32' id='36b2fc1e'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='32' id='4aafb922'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <pointer-type-def type-id='739fb858' size-in-bits='32' id='96ae8d47'/>
    <pointer-type-def type-id='d6dabff9' size-in-bits='32' id='b5e45470'/>
    <pointer-type-def type-id='86608c17' size-in-bits='32' id='c6fcc407'/>
    <pointer-type-def type-id='7a58eebd' size-in-bits='32' id='cdc60214'/>
    <pointer-type-def type-id='2a561b69' size-in-bits='32' id='e88cea79'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <pointer-type-def type-id='f5bb5067' size-in-bits='32' id='f3610084'/>
    <qualified-type-def type-id='7a58eebd' const='yes' id='0eede28d'/>
    <qualified-type-def type-id='d6dabff9' const='yes' id='2a561b69'/>
    <qualified-type-def type-id='f5bb5067' const='yes' id='86608c17'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='0d77e947'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='AHardwareBuffer' type-id='4d45f31e' id='7a58eebd'/>
    <typedef-decl name='AHardwareBuffer_Desc' type-id='820e87ae' id='f5bb5067'/>
    <typedef-decl name='AHardwareBuffer_Plane' type-id='b428b08b' id='b1c6a238'/>
    <typedef-decl name='AHardwareBuffer_Planes' type-id='940e9668' id='26b17c11'/>
    <typedef-decl name='ANativeWindow' type-id='4d637dbf' id='739fb858'/>
    <typedef-decl name='ANativeWindow_Buffer' type-id='e90e56ba' id='1b5f78db'/>
    <typedef-decl name='ARect' type-id='c9ee9172' id='d6dabff9'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='0d77e947' id='8910171f'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
  </abi-instr>
</abi-corpus>
