<abi-corpus version='2.1' architecture='elf-arm' soname='libmediandk.so'>
  <elf-needed>
    <dependency name='android.hardware.graphics.bufferqueue@1.0.so'/>
    <dependency name='android.hidl.token@1.0-utils.so'/>
    <dependency name='libandroid_runtime_lazy.so'/>
    <dependency name='libbase.so'/>
    <dependency name='libdatasource.so'/>
    <dependency name='libmedia.so'/>
    <dependency name='libmediadrm.so'/>
    <dependency name='libmedia_omx.so'/>
    <dependency name='libmedia_jni_utils.so'/>
    <dependency name='libstagefright.so'/>
    <dependency name='libstagefright_foundation.so'/>
    <dependency name='liblog.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libnativewindow.so'/>
    <dependency name='libhidlbase.so'/>
    <dependency name='libgui.so'/>
    <dependency name='libui.so'/>
    <dependency name='libmediandk_utils.so'/>
    <dependency name='android.hardware.drm-V1-ndk.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AMediaCodecCryptoInfo_delete' version='LIBMEDIANDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='AMediaMuxer_start' version='LIBMEDIANDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMediaMuxer_stop' version='LIBMEDIANDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMediaMuxer_writeSampleData' version='LIBMEDIANDK' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='AMEDIAFORMAT_KEY_AAC_PROFILE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_BIT_RATE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_CHANNEL_COUNT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_CHANNEL_MASK' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_COLOR_FORMAT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_DURATION' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_FLAC_COMPRESSION_LEVEL' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_FRAME_RATE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_HEIGHT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_IS_ADTS' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_IS_AUTOSELECT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_IS_DEFAULT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_IS_FORCED_SUBTITLE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_I_FRAME_INTERVAL' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_LANGUAGE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_MAX_HEIGHT' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_MAX_INPUT_SIZE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_MAX_WIDTH' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_MIME' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_PUSH_BLANK_BUFFERS_ON_STOP' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_REPEAT_PREVIOUS_FRAME_AFTER' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_SAMPLE_RATE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_STRIDE' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AMEDIAFORMAT_KEY_WIDTH' size='4' version='LIBMEDIANDK' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='32' language='LANG_C_plus_plus_14' path='various'>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <class-decl name='AMediaCodec' size-in-bits='608' is-struct='yes' visibility='default' id='e582d26a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mCodec' type-id='c59f6c00' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mLooper' type-id='5fbf0404' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mHandler' type-id='4ffcdbb7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mActivityNotification' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mGeneration' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mRequestedActivityNotification' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mCallback' type-id='927f265f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mCallbackUserData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mAsyncNotify' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mAsyncCallbackLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mAsyncCallback' type-id='75ec1ac2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mAsyncCallbackUserData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='mFrameRenderedNotify' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mFrameRenderedCallbackLock' type-id='406f4753' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='mFrameRenderedCallback' type-id='6e7445d0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='mFrameRenderedCallbackUserData' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCodecBufferInfo' size-in-bits='192' is-struct='yes' visibility='default' id='5a377cc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='size' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='presentationTimeUs' type-id='9da381c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCodecCryptoInfo' size-in-bits='448' is-struct='yes' visibility='default' id='72200e73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numsubsamples' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='key' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='iv' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mode' type-id='cb8ce096' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pattern' type-id='e36979af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='clearbytes' type-id='78c01427' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='encryptedbytes' type-id='78c01427' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCodecOnAsyncNotifyCallback' size-in-bits='128' is-struct='yes' visibility='default' id='1ddfa4b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='onAsyncInputAvailable' type-id='7337a56f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='onAsyncOutputAvailable' type-id='15b64de8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='onAsyncFormatChanged' type-id='1ad4eaa1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='onAsyncError' type-id='ea41e5fe' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaCrypto' size-in-bits='32' is-struct='yes' visibility='default' id='45fc6539'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mCrypto' type-id='fb567094' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaDrm' size-in-bits='960' is-struct='yes' visibility='default' id='25082c7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mDrm' type-id='04810e42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mIds' type-id='bd474af3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mQueryResults' type-id='2236983b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mKeyRequest' type-id='75c74f24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mDefaultUrl' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mkeyRequestType' type-id='48294b8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='mProvisionRequest' type-id='75c74f24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mProvisionUrl' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='mPropertyString' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mPropertyByteArray' type-id='75c74f24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='mSecureStops' type-id='bd474af3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='mListener' type-id='e6881728' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaDrmKeyStatus' size-in-bits='96' is-struct='yes' visibility='default' id='5a341c9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keyId' type-id='fd431bd8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='keyType' type-id='e810d7cf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaDrmKeyValuePair' size-in-bits='64' is-struct='yes' visibility='default' id='2a2999e9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mKey' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mValue' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaExtractor' size-in-bits='64' is-struct='yes' visibility='default' id='66585c10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mImpl' type-id='41728969' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mPsshBuf' type-id='8213f55d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaFormat' size-in-bits='224' is-struct='yes' visibility='default' id='eb8cac6b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mFormat' type-id='0e20bb94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mDebug' type-id='bacf3393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mStringCache' type-id='2236983b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='AMediaMuxer' size-in-bits='32' is-struct='yes' visibility='default' id='68b7df85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mImpl' type-id='93f5453e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ANativeWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='4d637dbf'/>
    <class-decl name='CodecHandler' size-in-bits='448' visibility='default' id='c07cb5cb'>
      <base-class access='public' layout-offset-in-bits='0' type-id='64606595'/>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='mCodec' type-id='d6a33e98' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='CodecHandler' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8d03b16b' is-artificial='yes'/>
          <parameter type-id='d6a33e98'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='DrmListener' size-in-bits='224' is-struct='yes' visibility='default' id='7bcb42ae'>
      <base-class access='public' layout-offset-in-bits='288' is-virtual='yes' type-id='5a20c16f'/>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='mObj' type-id='3de0002d' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mEventListener' type-id='5f16d02e' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='mExpirationUpdateListener' type-id='22b0d5aa' visibility='default'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='mKeysChangeListener' type-id='e9ca4612' visibility='default'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='DrmListener' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8c3b9314' is-artificial='yes'/>
          <parameter type-id='3de0002d'/>
          <parameter type-id='5f16d02e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DrmListener' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8c3b9314' is-artificial='yes'/>
          <parameter type-id='3de0002d'/>
          <parameter type-id='22b0d5aa'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DrmListener' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='8c3b9314' is-artificial='yes'/>
          <parameter type-id='3de0002d'/>
          <parameter type-id='e9ca4612'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PsshInfo' is-struct='yes' visibility='default' is-declaration-only='yes' id='567ded7b'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='00bc5b46' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encryptBlocks' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='skipBlocks' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' visibility='default' id='92fa54c8' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' visibility='default' id='bbb76264' is-anonymous='yes'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='9f7200cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='length' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='AMediaDrmEventType' id='54a1c1c6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='EVENT_PROVISION_REQUIRED' value='1'/>
      <enumerator name='EVENT_KEY_REQUIRED' value='2'/>
      <enumerator name='EVENT_KEY_EXPIRED' value='3'/>
      <enumerator name='EVENT_VENDOR_DEFINED' value='4'/>
      <enumerator name='EVENT_SESSION_RECLAIMED' value='5'/>
    </enum-decl>
    <enum-decl name='AMediaDrmKeyRequestType' id='6005c0f6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='KEY_REQUEST_TYPE_INITIAL' value='0'/>
      <enumerator name='KEY_REQUEST_TYPE_RENEWAL' value='1'/>
      <enumerator name='KEY_REQUEST_TYPE_RELEASE' value='2'/>
      <enumerator name='KEY_REQUEST_TYPE_NONE' value='3'/>
      <enumerator name='KEY_REQUEST_TYPE_UPDATE' value='4'/>
    </enum-decl>
    <enum-decl name='AMediaDrmKeyType' id='18ba2a59'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='KEY_TYPE_STREAMING' value='1'/>
      <enumerator name='KEY_TYPE_OFFLINE' value='2'/>
      <enumerator name='KEY_TYPE_RELEASE' value='3'/>
    </enum-decl>
    <enum-decl name='AMediaKeyStatusType' id='031917a6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='KEY_STATUS_TYPE_USABLE' value='0'/>
      <enumerator name='KEY_STATUS_TYPE_EXPIRED' value='1'/>
      <enumerator name='KEY_STATUS_TYPE_OUTPUTNOTALLOWED' value='2'/>
      <enumerator name='KEY_STATUS_TYPE_STATUSPENDING' value='3'/>
      <enumerator name='KEY_STATUS_TYPE_INTERNALERROR' value='4'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='14011b62' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_CLEAR' value='0'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_AES_CTR' value='1'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_AES_WV' value='2'/>
      <enumerator name='AMEDIACODECRYPTOINFO_MODE_AES_CBC' value='3'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='58cf06da' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIAMUXER_OUTPUT_FORMAT_MPEG_4' value='0'/>
      <enumerator name='AMEDIAMUXER_OUTPUT_FORMAT_WEBM' value='1'/>
      <enumerator name='AMEDIAMUXER_OUTPUT_FORMAT_THREE_GPP' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='c04b7afb' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIAEXTRACTOR_SEEK_PREVIOUS_SYNC' value='0'/>
      <enumerator name='AMEDIAEXTRACTOR_SEEK_NEXT_SYNC' value='1'/>
      <enumerator name='AMEDIAEXTRACTOR_SEEK_CLOSEST_SYNC' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' id='d3fca860' is-anonymous='yes'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='AMEDIA_OK' value='0'/>
      <enumerator name='AMEDIACODEC_ERROR_INSUFFICIENT_RESOURCE' value='1100'/>
      <enumerator name='AMEDIACODEC_ERROR_RECLAIMED' value='1101'/>
      <enumerator name='AMEDIA_ERROR_BASE' value='-10000'/>
      <enumerator name='AMEDIA_ERROR_UNKNOWN' value='-10000'/>
      <enumerator name='AMEDIA_ERROR_MALFORMED' value='-10001'/>
      <enumerator name='AMEDIA_ERROR_UNSUPPORTED' value='-10002'/>
      <enumerator name='AMEDIA_ERROR_INVALID_OBJECT' value='-10003'/>
      <enumerator name='AMEDIA_ERROR_INVALID_PARAMETER' value='-10004'/>
      <enumerator name='AMEDIA_ERROR_INVALID_OPERATION' value='-10005'/>
      <enumerator name='AMEDIA_ERROR_END_OF_STREAM' value='-10006'/>
      <enumerator name='AMEDIA_ERROR_IO' value='-10007'/>
      <enumerator name='AMEDIA_ERROR_WOULD_BLOCK' value='-10008'/>
      <enumerator name='AMEDIA_DRM_ERROR_BASE' value='-20000'/>
      <enumerator name='AMEDIA_DRM_NOT_PROVISIONED' value='-20001'/>
      <enumerator name='AMEDIA_DRM_RESOURCE_BUSY' value='-20002'/>
      <enumerator name='AMEDIA_DRM_DEVICE_REVOKED' value='-20003'/>
      <enumerator name='AMEDIA_DRM_SHORT_BUFFER' value='-20004'/>
      <enumerator name='AMEDIA_DRM_SESSION_NOT_OPENED' value='-20005'/>
      <enumerator name='AMEDIA_DRM_TAMPER_DETECTED' value='-20006'/>
      <enumerator name='AMEDIA_DRM_VERIFY_FAILED' value='-20007'/>
      <enumerator name='AMEDIA_DRM_NEED_KEY' value='-20008'/>
      <enumerator name='AMEDIA_DRM_LICENSE_EXPIRED' value='-20009'/>
      <enumerator name='AMEDIA_IMGREADER_ERROR_BASE' value='-30000'/>
      <enumerator name='AMEDIA_IMGREADER_NO_BUFFER_AVAILABLE' value='-30001'/>
      <enumerator name='AMEDIA_IMGREADER_MAX_IMAGES_ACQUIRED' value='-30002'/>
      <enumerator name='AMEDIA_IMGREADER_CANNOT_LOCK_IMAGE' value='-30003'/>
      <enumerator name='AMEDIA_IMGREADER_CANNOT_UNLOCK_IMAGE' value='-30004'/>
      <enumerator name='AMEDIA_IMGREADER_IMAGE_NOT_LOCKED' value='-30005'/>
    </enum-decl>
    <function-decl name='AMediaCodecCryptoInfo_delete' mangled-name='AMediaCodecCryptoInfo_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_delete@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='info'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getClearBytes' mangled-name='AMediaCodecCryptoInfo_getClearBytes' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getClearBytes@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='78c01427' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getEncryptedBytes' mangled-name='AMediaCodecCryptoInfo_getEncryptedBytes' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getEncryptedBytes@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='78c01427' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getIV' mangled-name='AMediaCodecCryptoInfo_getIV' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getIV@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='ae3e8ca6' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getKey' mangled-name='AMediaCodecCryptoInfo_getKey' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getKey@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <parameter type-id='ae3e8ca6' name='dst'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getMode' mangled-name='AMediaCodecCryptoInfo_getMode' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getMode@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <return type-id='cb8ce096'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_getNumSubSamples' mangled-name='AMediaCodecCryptoInfo_getNumSubSamples' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_getNumSubSamples@@LIBMEDIANDK'>
      <parameter type-id='83027323' name='ci'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='AMediaCodecCryptoInfo_new' mangled-name='AMediaCodecCryptoInfo_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodecCryptoInfo_new@@LIBMEDIANDK'>
      <parameter type-id='95e97e5e' name='numsubsamples'/>
      <parameter type-id='ae3e8ca6' name='key'/>
      <parameter type-id='ae3e8ca6' name='iv'/>
      <parameter type-id='cb8ce096' name='mode'/>
      <parameter type-id='78c01427' name='clearbytes'/>
      <parameter type-id='78c01427' name='encryptedbytes'/>
      <return type-id='83027323'/>
    </function-decl>
    <function-decl name='AMediaCodec_configure' mangled-name='AMediaCodec_configure' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_configure@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='4762cd34' name='format'/>
      <parameter type-id='96ae8d47' name='window'/>
      <parameter type-id='c5c780c1' name='crypto'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_createCodecByName' mangled-name='AMediaCodec_createCodecByName' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createCodecByName@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='d6a33e98'/>
    </function-decl>
    <function-decl name='AMediaCodec_createDecoderByType' mangled-name='AMediaCodec_createDecoderByType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createDecoderByType@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='d6a33e98'/>
    </function-decl>
    <function-decl name='AMediaCodec_createEncoderByType' mangled-name='AMediaCodec_createEncoderByType' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_createEncoderByType@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='d6a33e98'/>
    </function-decl>
    <function-decl name='AMediaCodec_delete' mangled-name='AMediaCodec_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_delete@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_dequeueInputBuffer' mangled-name='AMediaCodec_dequeueInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_dequeueInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='9da381c4' name='timeoutUs'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaCodec_dequeueOutputBuffer' mangled-name='AMediaCodec_dequeueOutputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_dequeueOutputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='7e84cc8e' name='info'/>
      <parameter type-id='9da381c4' name='timeoutUs'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaCodec_flush' mangled-name='AMediaCodec_flush' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_flush@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_getInputBuffer' mangled-name='AMediaCodec_getInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='78c01427' name='out_size'/>
      <return type-id='ae3e8ca6'/>
    </function-decl>
    <function-decl name='AMediaCodec_getOutputBuffer' mangled-name='AMediaCodec_getOutputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getOutputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='78c01427' name='out_size'/>
      <return type-id='ae3e8ca6'/>
    </function-decl>
    <function-decl name='AMediaCodec_getOutputFormat' mangled-name='AMediaCodec_getOutputFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_getOutputFormat@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaCodec_queueInputBuffer' mangled-name='AMediaCodec_queueInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_queueInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='ad707ada' name='offset'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='9c313c2d' name='time'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_queueSecureInputBuffer' mangled-name='AMediaCodec_queueSecureInputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_queueSecureInputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='codec'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='ad707ada' name='offset'/>
      <parameter type-id='83027323' name='crypto'/>
      <parameter type-id='9c313c2d' name='time'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_releaseOutputBuffer' mangled-name='AMediaCodec_releaseOutputBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_releaseOutputBuffer@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='c894953d' name='render'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_releaseOutputBufferAtTime' mangled-name='AMediaCodec_releaseOutputBufferAtTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_releaseOutputBufferAtTime@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <parameter type-id='9da381c4' name='timestampNs'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_start' mangled-name='AMediaCodec_start' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_start@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCodec_stop' mangled-name='AMediaCodec_stop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCodec_stop@@LIBMEDIANDK'>
      <parameter type-id='d6a33e98' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaCrypto_delete' mangled-name='AMediaCrypto_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_delete@@LIBMEDIANDK'>
      <parameter type-id='c5c780c1' name='crypto'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaCrypto_isCryptoSchemeSupported' mangled-name='AMediaCrypto_isCryptoSchemeSupported' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_isCryptoSchemeSupported@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaCrypto_new' mangled-name='AMediaCrypto_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_new@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <parameter type-id='b59d7dce' name='datasize'/>
      <return type-id='c5c780c1'/>
    </function-decl>
    <function-decl name='AMediaCrypto_requiresSecureDecoderComponent' mangled-name='AMediaCrypto_requiresSecureDecoderComponent' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaCrypto_requiresSecureDecoderComponent@@LIBMEDIANDK'>
      <parameter type-id='80f4b756' name='mime'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaDrm_closeSession' mangled-name='AMediaDrm_closeSession' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_closeSession@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_createByUUID' mangled-name='AMediaDrm_createByUUID' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_createByUUID@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <return type-id='3de0002d'/>
    </function-decl>
    <function-decl name='AMediaDrm_decrypt' mangled-name='AMediaDrm_decrypt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_decrypt@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='cipherAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='ae3e8ca6' name='iv'/>
      <parameter type-id='9f7200cf' name='input'/>
      <parameter type-id='ae3e8ca6' name='output'/>
      <parameter type-id='b59d7dce' name='dataSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_encrypt' mangled-name='AMediaDrm_encrypt' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_encrypt@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='cipherAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='ae3e8ca6' name='iv'/>
      <parameter type-id='9f7200cf' name='input'/>
      <parameter type-id='ae3e8ca6' name='output'/>
      <parameter type-id='b59d7dce' name='dataSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getKeyRequest' mangled-name='AMediaDrm_getKeyRequest' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getKeyRequest@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='e8ea3838' name='scope'/>
      <parameter type-id='9f7200cf' name='init'/>
      <parameter type-id='b59d7dce' name='initSize'/>
      <parameter type-id='80f4b756' name='mimeType'/>
      <parameter type-id='d269cc45' name='keyType'/>
      <parameter type-id='db1c60d8' name='optionalParameters'/>
      <parameter type-id='b59d7dce' name='numOptionalParameters'/>
      <parameter type-id='e577687f' name='keyRequest'/>
      <parameter type-id='78c01427' name='keyRequestSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getPropertyByteArray' mangled-name='AMediaDrm_getPropertyByteArray' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getPropertyByteArray@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='1154b432' name='propertyValue'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getPropertyString' mangled-name='AMediaDrm_getPropertyString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getPropertyString@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='7d3cd834' name='propertyValue'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getProvisionRequest' mangled-name='AMediaDrm_getProvisionRequest' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getProvisionRequest@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='e577687f' name='provisionRequest'/>
      <parameter type-id='78c01427' name='provisionRequestSize'/>
      <parameter type-id='7d3cd834' name='serverUrl'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_getSecureStops' mangled-name='AMediaDrm_getSecureStops' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_getSecureStops@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='4f7fa9b6' name='secureStops'/>
      <parameter type-id='78c01427' name='numSecureStops'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_isCryptoSchemeSupported' mangled-name='AMediaDrm_isCryptoSchemeSupported' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_isCryptoSchemeSupported@@LIBMEDIANDK'>
      <parameter type-id='9f7200cf' name='uuid'/>
      <parameter type-id='80f4b756' name='mimeType'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaDrm_openSession' mangled-name='AMediaDrm_openSession' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_openSession@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='3b9154e0' name='sessionId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_provideKeyResponse' mangled-name='AMediaDrm_provideKeyResponse' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_provideKeyResponse@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='e8ea3838' name='scope'/>
      <parameter type-id='9f7200cf' name='response'/>
      <parameter type-id='b59d7dce' name='responseSize'/>
      <parameter type-id='992377e9' name='keySetId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_provideProvisionResponse' mangled-name='AMediaDrm_provideProvisionResponse' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_provideProvisionResponse@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='9f7200cf' name='response'/>
      <parameter type-id='b59d7dce' name='responseSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_queryKeyStatus' mangled-name='AMediaDrm_queryKeyStatus' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_queryKeyStatus@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='e7e0920d' name='keyValuePairs'/>
      <parameter type-id='78c01427' name='numPairs'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_release' mangled-name='AMediaDrm_release' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_release@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaDrm_releaseSecureStops' mangled-name='AMediaDrm_releaseSecureStops' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_releaseSecureStops@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='0eef552b' name='ssRelease'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_removeKeys' mangled-name='AMediaDrm_removeKeys' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_removeKeys@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_restoreKeys' mangled-name='AMediaDrm_restoreKeys' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_restoreKeys@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='5acf19a4' name='keySetId'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setOnEventListener' mangled-name='AMediaDrm_setOnEventListener' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setOnEventListener@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='5f16d02e' name='listener'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setPropertyByteArray' mangled-name='AMediaDrm_setPropertyByteArray' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setPropertyByteArray@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='9f7200cf' name='value'/>
      <parameter type-id='b59d7dce' name='valueSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_setPropertyString' mangled-name='AMediaDrm_setPropertyString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_setPropertyString@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='80f4b756' name='propertyName'/>
      <parameter type-id='80f4b756' name='value'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_sign' mangled-name='AMediaDrm_sign' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_sign@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='macAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='ae3e8ca6' name='message'/>
      <parameter type-id='b59d7dce' name='messageSize'/>
      <parameter type-id='ae3e8ca6' name='signature'/>
      <parameter type-id='78c01427' name='signatureSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaDrm_verify' mangled-name='AMediaDrm_verify' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaDrm_verify@@LIBMEDIANDK'>
      <parameter type-id='3de0002d' name='mObj'/>
      <parameter type-id='92d29827' name='sessionId'/>
      <parameter type-id='80f4b756' name='macAlgorithm'/>
      <parameter type-id='ae3e8ca6' name='keyId'/>
      <parameter type-id='9f7200cf' name='message'/>
      <parameter type-id='b59d7dce' name='messageSize'/>
      <parameter type-id='9f7200cf' name='signature'/>
      <parameter type-id='b59d7dce' name='signatureSize'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_advance' mangled-name='AMediaExtractor_advance' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_advance@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaExtractor_delete' mangled-name='AMediaExtractor_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_delete@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getPsshInfo' mangled-name='AMediaExtractor_getPsshInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getPsshInfo@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='ex'/>
      <return type-id='48753e7b'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleCryptoInfo' mangled-name='AMediaExtractor_getSampleCryptoInfo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleCryptoInfo@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='ex'/>
      <return type-id='83027323'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleFlags' mangled-name='AMediaExtractor_getSampleFlags' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleFlags@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleTime' mangled-name='AMediaExtractor_getSampleTime' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleTime@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getSampleTrackIndex' mangled-name='AMediaExtractor_getSampleTrackIndex' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getSampleTrackIndex@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getTrackCount' mangled-name='AMediaExtractor_getTrackCount' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getTrackCount@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='AMediaExtractor_getTrackFormat' mangled-name='AMediaExtractor_getTrackFormat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_getTrackFormat@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaExtractor_new' mangled-name='AMediaExtractor_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_new@@LIBMEDIANDK'>
      <return type-id='cc75e8f6'/>
    </function-decl>
    <function-decl name='AMediaExtractor_readSampleData' mangled-name='AMediaExtractor_readSampleData' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_readSampleData@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='ae3e8ca6' name='buffer'/>
      <parameter type-id='b59d7dce' name='capacity'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaExtractor_seekTo' mangled-name='AMediaExtractor_seekTo' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_seekTo@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='ex'/>
      <parameter type-id='9da381c4' name='seekPosUs'/>
      <parameter type-id='1c26b687' name='mode'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_selectTrack' mangled-name='AMediaExtractor_selectTrack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_selectTrack@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_setDataSource' mangled-name='AMediaExtractor_setDataSource' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_setDataSource@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='80f4b756' name='location'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_setDataSourceFd' mangled-name='AMediaExtractor_setDataSourceFd' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_setDataSourceFd@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='05d4c620' name='offset'/>
      <parameter type-id='05d4c620' name='length'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaExtractor_unselectTrack' mangled-name='AMediaExtractor_unselectTrack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaExtractor_unselectTrack@@LIBMEDIANDK'>
      <parameter type-id='cc75e8f6' name='mData'/>
      <parameter type-id='b59d7dce' name='idx'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaFormat_delete' mangled-name='AMediaFormat_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_delete@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='mData'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaFormat_getBuffer' mangled-name='AMediaFormat_getBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getBuffer@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='63e171df' name='data'/>
      <parameter type-id='78c01427' name='outsize'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getFloat' mangled-name='AMediaFormat_getFloat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getFloat@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='361f7a7d' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getInt32' mangled-name='AMediaFormat_getInt32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getInt32@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4aafb922' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getInt64' mangled-name='AMediaFormat_getInt64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getInt64@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='cb785ebf' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getSize' mangled-name='AMediaFormat_getSize' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getSize@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='78c01427' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_getString' mangled-name='AMediaFormat_getString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_getString@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='mData'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='7d3cd834' name='out'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='AMediaFormat_new' mangled-name='AMediaFormat_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_new@@LIBMEDIANDK'>
      <return type-id='29a0c04b'/>
    </function-decl>
    <function-decl name='AMediaFormat_setBuffer' mangled-name='AMediaFormat_setBuffer' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setBuffer@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setFloat' mangled-name='AMediaFormat_setFloat' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setFloat@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='a6c45d85' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setInt32' mangled-name='AMediaFormat_setInt32' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setInt32@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='3ff5601b' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setInt64' mangled-name='AMediaFormat_setInt64' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setInt64@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='9da381c4' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_setString' mangled-name='AMediaFormat_setString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_setString@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='format'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='AMediaFormat_toString' mangled-name='AMediaFormat_toString' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaFormat_toString@@LIBMEDIANDK'>
      <parameter type-id='29a0c04b' name='mData'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='AMediaMuxer_addTrack' mangled-name='AMediaMuxer_addTrack' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_addTrack@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='4762cd34' name='format'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='AMediaMuxer_delete' mangled-name='AMediaMuxer_delete' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_delete@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_new' mangled-name='AMediaMuxer_new' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_new@@LIBMEDIANDK'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='3cea8d1e' name='format'/>
      <return type-id='373b05c5'/>
    </function-decl>
    <function-decl name='AMediaMuxer_setLocation' mangled-name='AMediaMuxer_setLocation' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_setLocation@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='a6c45d85' name='latitude'/>
      <parameter type-id='a6c45d85' name='longtitude'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_setOrientationHint' mangled-name='AMediaMuxer_setOrientationHint' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_setOrientationHint@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='95e97e5e' name='degrees'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_start' mangled-name='AMediaMuxer_start' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_start@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_stop' mangled-name='AMediaMuxer_stop' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_stop@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-decl name='AMediaMuxer_writeSampleData' mangled-name='AMediaMuxer_writeSampleData' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='AMediaMuxer_writeSampleData@@LIBMEDIANDK'>
      <parameter type-id='373b05c5' name='muxer'/>
      <parameter type-id='b59d7dce' name='trackIdx'/>
      <parameter type-id='9f7200cf' name='data'/>
      <parameter type-id='73f80ab3' name='info'/>
      <return type-id='c085b0c4'/>
    </function-decl>
    <function-type size-in-bits='32' id='1fb355d5'>
      <parameter type-id='3de0002d'/>
      <parameter type-id='92d29827'/>
      <parameter type-id='2c14ef72'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9f7200cf'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='2017cf73'>
      <parameter type-id='3de0002d'/>
      <parameter type-id='92d29827'/>
      <parameter type-id='95234477'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='c894953d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='207d6275'>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='354f7eb9'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='24c55490'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='3ff5601b'/>
      <parameter type-id='7e84cc8e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='6d57b281'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='94cc7d21'>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='32' id='ad755a89'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='3ff5601b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='ad881969'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='29a0c04b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='c00bdd9f'>
      <parameter type-id='3de0002d'/>
      <parameter type-id='92d29827'/>
      <parameter type-id='9da381c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='ca0a2c8d'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='c085b0c4'/>
      <parameter type-id='3ff5601b'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='32' id='fbe8b8bf'>
      <parameter type-id='d6a33e98'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9da381c4'/>
      <parameter type-id='9da381c4'/>
      <return type-id='48b5725f'/>
    </function-type>
    <pointer-type-def type-id='7ae24efa' size-in-bits='32' id='04190168'/>
    <pointer-type-def type-id='c67b5099' size-in-bits='32' id='09f09c51'/>
    <pointer-type-def type-id='6abbfd23' size-in-bits='32' id='0eef552b'/>
    <pointer-type-def type-id='d0a6d3f1' size-in-bits='32' id='1154b432'/>
    <pointer-type-def type-id='5a20c16f' size-in-bits='32' id='15f18b87'/>
    <pointer-type-def type-id='9981a92b' size-in-bits='32' id='163017cb'/>
    <pointer-type-def type-id='e6881728' size-in-bits='32' id='171c354e'/>
    <pointer-type-def type-id='c59f6c00' size-in-bits='32' id='1a1ccc06'/>
    <pointer-type-def type-id='0bd5aa84' size-in-bits='32' id='1b0ba912'/>
    <pointer-type-def type-id='24c55490' size-in-bits='32' id='1ec29ba2'/>
    <pointer-type-def type-id='0e20bb94' size-in-bits='32' id='262a6002'/>
    <pointer-type-def type-id='7860f206' size-in-bits='32' id='29a0c04b'/>
    <pointer-type-def type-id='30d9048a' size-in-bits='32' id='30c178f8'/>
    <pointer-type-def type-id='ad11d894' size-in-bits='32' id='3118331a'/>
    <pointer-type-def type-id='0e12036a' size-in-bits='32' id='33f74d48'/>
    <pointer-type-def type-id='c00bdd9f' size-in-bits='32' id='34117163'/>
    <pointer-type-def type-id='ea86de29' size-in-bits='32' id='354f7eb9'/>
    <pointer-type-def type-id='93f5453e' size-in-bits='32' id='359a6cd4'/>
    <pointer-type-def type-id='a6c45d85' size-in-bits='32' id='361f7a7d'/>
    <pointer-type-def type-id='01f11092' size-in-bits='32' id='373b05c5'/>
    <pointer-type-def type-id='84004c8f' size-in-bits='32' id='3a368097'/>
    <pointer-type-def type-id='941be827' size-in-bits='32' id='3b9154e0'/>
    <pointer-type-def type-id='fbe8b8bf' size-in-bits='32' id='3bb65f3b'/>
    <pointer-type-def type-id='a464d9b6' size-in-bits='32' id='3de0002d'/>
    <pointer-type-def type-id='207d6275' size-in-bits='32' id='3ea32c19'/>
    <pointer-type-def type-id='fd376fcf' size-in-bits='32' id='40a3d947'/>
    <pointer-type-def type-id='47040e56' size-in-bits='32' id='4762cd34'/>
    <pointer-type-def type-id='75dc43de' size-in-bits='32' id='48753e7b'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='32' id='4aafb922'/>
    <pointer-type-def type-id='ff1f0153' size-in-bits='32' id='4f7fa9b6'/>
    <pointer-type-def type-id='406f4753' size-in-bits='32' id='5a5e1f63'/>
    <pointer-type-def type-id='92241666' size-in-bits='32' id='5acf19a4'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='32' id='63e171df'/>
    <pointer-type-def type-id='ae1a064b' size-in-bits='32' id='73f80ab3'/>
    <pointer-type-def type-id='bc6f38a0' size-in-bits='32' id='74a200d6'/>
    <pointer-type-def type-id='4b9d3492' size-in-bits='32' id='7613b793'/>
    <pointer-type-def type-id='6d57b281' size-in-bits='32' id='76bff34d'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='32' id='78c01427'/>
    <pointer-type-def type-id='42876cb5' size-in-bits='32' id='78e03335'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='32' id='7d3cd834'/>
    <pointer-type-def type-id='889c0c5b' size-in-bits='32' id='7e84cc8e'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <pointer-type-def type-id='d9946db8' size-in-bits='32' id='83027323'/>
    <pointer-type-def type-id='7bcb42ae' size-in-bits='32' id='8c3b9314'/>
    <pointer-type-def type-id='c07cb5cb' size-in-bits='32' id='8d03b16b'/>
    <pointer-type-def type-id='bd474af3' size-in-bits='32' id='90c51dc3'/>
    <pointer-type-def type-id='a0b07bb7' size-in-bits='32' id='92d29827'/>
    <pointer-type-def type-id='060e1027' size-in-bits='32' id='95234477'/>
    <pointer-type-def type-id='4d637dbf' size-in-bits='32' id='96ae8d47'/>
    <pointer-type-def type-id='de6480b6' size-in-bits='32' id='992377e9'/>
    <pointer-type-def type-id='4d159548' size-in-bits='32' id='9bca647e'/>
    <pointer-type-def type-id='94cc7d21' size-in-bits='32' id='9d86b205'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='32' id='9f7200cf'/>
    <pointer-type-def type-id='6460c12a' size-in-bits='32' id='a1abad78'/>
    <pointer-type-def type-id='75c74f24' size-in-bits='32' id='adab0622'/>
    <pointer-type-def type-id='e9ddea86' size-in-bits='32' id='ae2251ac'/>
    <pointer-type-def type-id='b96825af' size-in-bits='32' id='ae3e8ca6'/>
    <pointer-type-def type-id='1fb355d5' size-in-bits='32' id='b196dfc9'/>
    <pointer-type-def type-id='ad881969' size-in-bits='32' id='b1eb312d'/>
    <pointer-type-def type-id='cc518f2c' size-in-bits='32' id='b6f9962a'/>
    <pointer-type-def type-id='8213f55d' size-in-bits='32' id='b804143d'/>
    <pointer-type-def type-id='64606595' size-in-bits='32' id='bafcf955'/>
    <pointer-type-def type-id='5fbf0404' size-in-bits='32' id='bfd7e242'/>
    <pointer-type-def type-id='07da9dcb' size-in-bits='32' id='c10e4dfb'/>
    <pointer-type-def type-id='ca0a2c8d' size-in-bits='32' id='c1e11669'/>
    <pointer-type-def type-id='41728969' size-in-bits='32' id='c2c2b841'/>
    <pointer-type-def type-id='2017cf73' size-in-bits='32' id='c325452f'/>
    <pointer-type-def type-id='ad755a89' size-in-bits='32' id='c39b454d'/>
    <pointer-type-def type-id='b492b5f4' size-in-bits='32' id='c5c780c1'/>
    <pointer-type-def type-id='fb567094' size-in-bits='32' id='c6d2d6b2'/>
    <pointer-type-def type-id='9da381c4' size-in-bits='32' id='cb785ebf'/>
    <pointer-type-def type-id='4ffcdbb7' size-in-bits='32' id='cbdc0a3f'/>
    <pointer-type-def type-id='d9f17f9f' size-in-bits='32' id='cc2c09ef'/>
    <pointer-type-def type-id='1bc40a3f' size-in-bits='32' id='cc75e8f6'/>
    <pointer-type-def type-id='f1c99104' size-in-bits='32' id='ce4f8b6a'/>
    <pointer-type-def type-id='002ac4a6' size-in-bits='32' id='cf536864'/>
    <pointer-type-def type-id='ae098004' size-in-bits='32' id='d42e47b2'/>
    <pointer-type-def type-id='8d7f3d19' size-in-bits='32' id='d6a33e98'/>
    <pointer-type-def type-id='58d228f7' size-in-bits='32' id='da6a86df'/>
    <pointer-type-def type-id='ef8802e2' size-in-bits='32' id='db1c60d8'/>
    <pointer-type-def type-id='04810e42' size-in-bits='32' id='e1a13110'/>
    <pointer-type-def type-id='9f7200cf' size-in-bits='32' id='e577687f'/>
    <pointer-type-def type-id='8da74890' size-in-bits='32' id='e5b6b376'/>
    <pointer-type-def type-id='01ff0772' size-in-bits='32' id='e7e0920d'/>
    <pointer-type-def type-id='16dee9c2' size-in-bits='32' id='e8ea3838'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <pointer-type-def type-id='ab4b368f' size-in-bits='32' id='eb96a877'/>
    <pointer-type-def type-id='2236983b' size-in-bits='32' id='eed56f2b'/>
    <qualified-type-def type-id='5d06feb7' const='yes' id='060e1027'/>
    <qualified-type-def type-id='c4d0cb92' const='yes' id='16dee9c2'/>
    <qualified-type-def type-id='2b07a017' const='yes' id='1b0f5007'/>
    <qualified-type-def type-id='e6881728' const='yes' id='1c9857c9'/>
    <qualified-type-def type-id='f0981eeb' const='yes' id='20f5f452'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <qualified-type-def type-id='fd376fcf' const='yes' id='2e96e5aa'/>
    <qualified-type-def type-id='4ffcdbb7' const='yes' id='3908b1f0'/>
    <qualified-type-def type-id='b4109b6f' const='yes' id='3c1d762e'/>
    <qualified-type-def type-id='7860f206' const='yes' id='47040e56'/>
    <qualified-type-def type-id='4d159548' const='yes' id='584de2ab'/>
    <qualified-type-def type-id='c59f6c00' const='yes' id='5e2f2399'/>
    <qualified-type-def type-id='ff1f0153' const='yes' id='6abbfd23'/>
    <qualified-type-def type-id='bacf3393' const='yes' id='745c9152'/>
    <qualified-type-def type-id='75c74f24' const='yes' id='7cd2b135'/>
    <qualified-type-def type-id='0e20bb94' const='yes' id='8abd7579'/>
    <qualified-type-def type-id='93f5453e' const='yes' id='8c42dfaf'/>
    <qualified-type-def type-id='de6480b6' const='yes' id='92241666'/>
    <qualified-type-def type-id='25e73793' const='yes' id='94acdc63'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <qualified-type-def type-id='8213f55d' const='yes' id='9e54bf82'/>
    <qualified-type-def type-id='941be827' const='yes' id='a0b07bb7'/>
    <qualified-type-def type-id='ae098004' const='yes' id='a34554c3'/>
    <qualified-type-def type-id='406f4753' const='yes' id='a3f5ae0e'/>
    <qualified-type-def type-id='64606595' const='yes' id='a8b69e1e'/>
    <qualified-type-def type-id='84004c8f' const='yes' id='ad11d894'/>
    <qualified-type-def type-id='889c0c5b' const='yes' id='ae1a064b'/>
    <qualified-type-def type-id='04810e42' const='yes' id='bacf7787'/>
    <qualified-type-def type-id='5fbf0404' const='yes' id='bcd6c637'/>
    <qualified-type-def type-id='5a20c16f' const='yes' id='c7efac24'/>
    <qualified-type-def type-id='fb567094' const='yes' id='d04a5857'/>
    <qualified-type-def type-id='b59d7dce' const='yes' id='d0fa5dde'/>
    <qualified-type-def type-id='0bd5aa84' const='yes' id='d7c11d13'/>
    <qualified-type-def type-id='8da74890' const='yes' id='d9f17f9f'/>
    <qualified-type-def type-id='41728969' const='yes' id='e5c158a4'/>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
    <qualified-type-def type-id='bd474af3' const='yes' id='ef421bd6'/>
    <qualified-type-def type-id='01ff0772' const='yes' id='ef8802e2'/>
    <qualified-type-def type-id='ab4b368f' const='yes' id='f1c99104'/>
    <reference-type-def kind='lvalue' type-id='5e2f2399' size-in-bits='32' id='033545ad'/>
    <reference-type-def kind='rvalue' type-id='41728969' size-in-bits='32' id='1f7def29'/>
    <reference-type-def kind='rvalue' type-id='fb567094' size-in-bits='32' id='21f1a808'/>
    <reference-type-def kind='lvalue' type-id='ad11d894' size-in-bits='32' id='25182036'/>
    <reference-type-def kind='lvalue' type-id='e5c158a4' size-in-bits='32' id='315e54a6'/>
    <reference-type-def kind='rvalue' type-id='e6881728' size-in-bits='32' id='395e35ac'/>
    <reference-type-def kind='lvalue' type-id='a3f5ae0e' size-in-bits='32' id='43c128f8'/>
    <reference-type-def kind='rvalue' type-id='8213f55d' size-in-bits='32' id='494e5aed'/>
    <reference-type-def kind='lvalue' type-id='94acdc63' size-in-bits='32' id='511ec09f'/>
    <reference-type-def kind='rvalue' type-id='93f5453e' size-in-bits='32' id='53fb6be2'/>
    <reference-type-def kind='lvalue' type-id='d04a5857' size-in-bits='32' id='560939e3'/>
    <reference-type-def kind='lvalue' type-id='8c42dfaf' size-in-bits='32' id='5645e4ab'/>
    <reference-type-def kind='lvalue' type-id='bcd6c637' size-in-bits='32' id='5719ccc3'/>
    <reference-type-def kind='lvalue' type-id='406f4753' size-in-bits='32' id='665e3247'/>
    <reference-type-def kind='lvalue' type-id='584de2ab' size-in-bits='32' id='8f9ba3f7'/>
    <reference-type-def kind='lvalue' type-id='7cd2b135' size-in-bits='32' id='92acc0e9'/>
    <reference-type-def kind='lvalue' type-id='ef421bd6' size-in-bits='32' id='9511fad0'/>
    <reference-type-def kind='lvalue' type-id='3908b1f0' size-in-bits='32' id='9eaff3e2'/>
    <reference-type-def kind='lvalue' type-id='745c9152' size-in-bits='32' id='a1b8f99c'/>
    <reference-type-def kind='lvalue' type-id='3c1d762e' size-in-bits='32' id='aa60ce98'/>
    <reference-type-def kind='lvalue' type-id='bacf7787' size-in-bits='32' id='b5995273'/>
    <reference-type-def kind='lvalue' type-id='1b0f5007' size-in-bits='32' id='ba1b23f3'/>
    <reference-type-def kind='lvalue' type-id='c7efac24' size-in-bits='32' id='c04bc726'/>
    <reference-type-def kind='lvalue' type-id='8abd7579' size-in-bits='32' id='c73fc48d'/>
    <reference-type-def kind='rvalue' type-id='0e20bb94' size-in-bits='32' id='c8bf35b8'/>
    <reference-type-def kind='rvalue' type-id='c59f6c00' size-in-bits='32' id='cb72bb24'/>
    <reference-type-def kind='lvalue' type-id='a8b69e1e' size-in-bits='32' id='cf7b1228'/>
    <reference-type-def kind='lvalue' type-id='d7c11d13' size-in-bits='32' id='da00fa6f'/>
    <reference-type-def kind='lvalue' type-id='9e54bf82' size-in-bits='32' id='e369af2c'/>
    <reference-type-def kind='lvalue' type-id='2e96e5aa' size-in-bits='32' id='e38b5b64'/>
    <reference-type-def kind='rvalue' type-id='4ffcdbb7' size-in-bits='32' id='e46e4057'/>
    <reference-type-def kind='rvalue' type-id='04810e42' size-in-bits='32' id='e6ddc396'/>
    <reference-type-def kind='lvalue' type-id='a34554c3' size-in-bits='32' id='eb24a47f'/>
    <reference-type-def kind='lvalue' type-id='1c9857c9' size-in-bits='32' id='f2d26d3d'/>
    <reference-type-def kind='rvalue' type-id='5fbf0404' size-in-bits='32' id='f4e34078'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='32' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='0d77e947'/>
    <type-decl name='void' id='48b5725f'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <typedef-decl name='AMediaCodec' type-id='e582d26a' id='8d7f3d19'/>
    <typedef-decl name='AMediaCodecBufferInfo' type-id='5a377cc8' id='889c0c5b'/>
    <typedef-decl name='AMediaCodecCryptoInfo' type-id='72200e73' id='d9946db8'/>
    <typedef-decl name='AMediaCodecOnAsyncError' type-id='c1e11669' id='ea41e5fe'/>
    <typedef-decl name='AMediaCodecOnAsyncFormatChanged' type-id='b1eb312d' id='1ad4eaa1'/>
    <typedef-decl name='AMediaCodecOnAsyncInputAvailable' type-id='c39b454d' id='7337a56f'/>
    <typedef-decl name='AMediaCodecOnAsyncNotifyCallback' type-id='1ddfa4b7' id='75ec1ac2'/>
    <typedef-decl name='AMediaCodecOnAsyncOutputAvailable' type-id='1ec29ba2' id='15b64de8'/>
    <typedef-decl name='AMediaCodecOnFrameRendered' type-id='3bb65f3b' id='6e7445d0'/>
    <typedef-decl name='AMediaCrypto' type-id='45fc6539' id='b492b5f4'/>
    <typedef-decl name='AMediaDrm' type-id='25082c7d' id='a464d9b6'/>
    <typedef-decl name='AMediaDrmByteArray' type-id='bbb76264' id='d0a6d3f1'/>
    <typedef-decl name='AMediaDrmEventListener' type-id='b196dfc9' id='5f16d02e'/>
    <typedef-decl name='AMediaDrmEventType' type-id='54a1c1c6' id='2c14ef72'/>
    <typedef-decl name='AMediaDrmExpirationUpdateListener' type-id='34117163' id='22b0d5aa'/>
    <typedef-decl name='AMediaDrmKeyId' type-id='d0a6d3f1' id='fd431bd8'/>
    <typedef-decl name='AMediaDrmKeyRequestType' type-id='6005c0f6' id='48294b8a'/>
    <typedef-decl name='AMediaDrmKeySetId' type-id='d0a6d3f1' id='de6480b6'/>
    <typedef-decl name='AMediaDrmKeyStatus' type-id='5a341c9e' id='5d06feb7'/>
    <typedef-decl name='AMediaDrmKeyStatusType' type-id='031917a6' id='e810d7cf'/>
    <typedef-decl name='AMediaDrmKeyType' type-id='18ba2a59' id='d269cc45'/>
    <typedef-decl name='AMediaDrmKeyValue' type-id='2a2999e9' id='01ff0772'/>
    <typedef-decl name='AMediaDrmKeysChangeListener' type-id='c325452f' id='e9ca4612'/>
    <typedef-decl name='AMediaDrmScope' type-id='d0a6d3f1' id='c4d0cb92'/>
    <typedef-decl name='AMediaDrmSecureStop' type-id='d0a6d3f1' id='ff1f0153'/>
    <typedef-decl name='AMediaDrmSessionId' type-id='d0a6d3f1' id='941be827'/>
    <typedef-decl name='AMediaExtractor' type-id='66585c10' id='1bc40a3f'/>
    <typedef-decl name='AMediaFormat' type-id='eb8cac6b' id='7860f206'/>
    <typedef-decl name='AMediaMuxer' type-id='68b7df85' id='01f11092'/>
    <typedef-decl name='OnCodecEvent' type-id='76bff34d' id='927f265f'/>
    <typedef-decl name='OutputFormat' type-id='58cf06da' id='3cea8d1e'/>
    <typedef-decl name='PsshInfo' type-id='567ded7b' id='75dc43de'/>
    <typedef-decl name='SeekMode' type-id='c04b7afb' id='1c26b687'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' id='0c9942d2'/>
    <typedef-decl name='__kernel_loff_t' type-id='1eb56b1e' id='537a730e'/>
    <typedef-decl name='__kernel_long_t' type-id='bd54fe1a' id='6a11bd61'/>
    <typedef-decl name='__kernel_off_t' type-id='6a11bd61' id='8dda407a'/>
    <typedef-decl name='__kernel_ssize_t' type-id='95e97e5e' id='b6b3ebaf'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='0d77e947' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='cryptoinfo_mode_t' type-id='14011b62' id='cb8ce096'/>
    <typedef-decl name='cryptoinfo_pattern_t' type-id='00bc5b46' id='e36979af'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <typedef-decl name='loff_t' type-id='537a730e' id='69bf7bee'/>
    <typedef-decl name='media_status_t' type-id='d3fca860' id='c085b0c4'/>
    <typedef-decl name='off64_t' type-id='69bf7bee' id='05d4c620'/>
    <typedef-decl name='off_t' type-id='8dda407a' id='ad707ada'/>
    <typedef-decl name='pthread_mutex_t' type-id='92fa54c8' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='ssize_t' type-id='b6b3ebaf' id='79a0948f'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='weakref_type' type-id='114d3ce2' id='4b9d3492'/>
    <var-decl name='AMEDIAFORMAT_KEY_AAC_PROFILE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_AAC_PROFILE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_AAC_PROFILE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_BIT_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_BIT_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_BIT_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CHANNEL_COUNT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CHANNEL_COUNT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CHANNEL_COUNT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_CHANNEL_MASK' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_CHANNEL_MASK' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_CHANNEL_MASK@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_COLOR_FORMAT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_COLOR_FORMAT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_COLOR_FORMAT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_DURATION' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_DURATION' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_DURATION@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_FLAC_COMPRESSION_LEVEL' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_FLAC_COMPRESSION_LEVEL' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_FLAC_COMPRESSION_LEVEL@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_FRAME_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_FRAME_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_FRAME_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_ADTS' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_ADTS' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_ADTS@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_AUTOSELECT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_AUTOSELECT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_AUTOSELECT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_DEFAULT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_DEFAULT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_DEFAULT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_IS_FORCED_SUBTITLE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_IS_FORCED_SUBTITLE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_IS_FORCED_SUBTITLE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_I_FRAME_INTERVAL' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_I_FRAME_INTERVAL' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_I_FRAME_INTERVAL@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_LANGUAGE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_LANGUAGE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_LANGUAGE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_HEIGHT' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_HEIGHT' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_HEIGHT@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_INPUT_SIZE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_INPUT_SIZE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_INPUT_SIZE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MAX_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MAX_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MAX_WIDTH@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_MIME' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_MIME' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_MIME@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_PUSH_BLANK_BUFFERS_ON_STOP' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_PUSH_BLANK_BUFFERS_ON_STOP' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_PUSH_BLANK_BUFFERS_ON_STOP@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_REPEAT_PREVIOUS_FRAME_AFTER' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_REPEAT_PREVIOUS_FRAME_AFTER' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_REPEAT_PREVIOUS_FRAME_AFTER@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_SAMPLE_RATE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_SAMPLE_RATE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_SAMPLE_RATE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_STRIDE' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_STRIDE' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_STRIDE@@LIBMEDIANDK'/>
    <var-decl name='AMEDIAFORMAT_KEY_WIDTH' type-id='80f4b756' mangled-name='AMEDIAFORMAT_KEY_WIDTH' visibility='default' elf-symbol-id='AMEDIAFORMAT_KEY_WIDTH@@LIBMEDIANDK'/>
    <namespace-decl name='android'>
      <class-decl name='ABuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='c67b5099'/>
      <class-decl name='AData&lt;int, long long, unsigned int, float, double, android::AMessage::Rect, android::AString, void *, android::sp&lt;android::AMessage&gt;, android::sp&lt;android::ABuffer&gt;, android::sp&lt;android::RefBase&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='fa1964c5'>
        <member-type access='public'>
          <class-decl name='flagger&lt;unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' id='a6874e6b'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='f0981eeb' id='983ef37e'/>
            </member-type>
            <data-member access='private' static='yes'>
              <var-decl name='count' type-id='20f5f452' visibility='default'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='mask' type-id='20f5f452' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='Strict&lt;unsigned int&gt;' type-id='30d9048a' id='8cb9750b'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='Basic' type-id='8cb9750b' id='69c36994'/>
        </member-type>
        <member-type access='public'>
          <class-decl name='Custom&lt;android::AData&lt;int, long long, unsigned int, float, double, android::AMessage::Rect, android::AString, void *, android::sp&lt;android::AMessage&gt;, android::sp&lt;android::ABuffer&gt;, android::sp&lt;android::RefBase&gt; &gt;::flagger&lt;unsigned int&gt; &gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='30d9048a'>
            <member-function access='public' destructor='yes'>
              <function-decl name='~Custom' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='30c178f8' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='num_types' type-id='d0fa5dde' visibility='default'/>
        </data-member>
      </class-decl>
      <class-decl name='AHandler' size-in-bits='448' is-struct='yes' visibility='default' id='64606595'>
        <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mID' type-id='bd26b9e3' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='mLooper' type-id='4d159548' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='160'>
          <var-decl name='mVerboseStats' type-id='c894953d' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mMessageCounter' type-id='9c313c2d' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='mMessages' type-id='07da9dcb' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='AHandler' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bafcf955' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='AHandler' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bafcf955' is-artificial='yes'/>
            <parameter type-id='cf7b1228'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='ALooper' is-struct='yes' visibility='default' is-declaration-only='yes' id='6460c12a'>
        <member-type access='public'>
          <typedef-decl name='handler_id' type-id='3ff5601b' id='bd26b9e3'/>
        </member-type>
      </class-decl>
      <class-decl name='AMessage' is-struct='yes' visibility='default' is-declaration-only='yes' id='0e12036a'>
        <member-type access='public'>
          <enum-decl name='Type' id='3f4a1601'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='kTypeInt32' value='0'/>
            <enumerator name='kTypeInt64' value='1'/>
            <enumerator name='kTypeSize' value='2'/>
            <enumerator name='kTypeFloat' value='3'/>
            <enumerator name='kTypeDouble' value='4'/>
            <enumerator name='kTypePointer' value='5'/>
            <enumerator name='kTypeString' value='6'/>
            <enumerator name='kTypeObject' value='7'/>
            <enumerator name='kTypeMessage' value='8'/>
            <enumerator name='kTypeRect' value='9'/>
            <enumerator name='kTypeBuffer' value='10'/>
          </enum-decl>
        </member-type>
        <member-type access='public'>
          <class-decl name='Rect' size-in-bits='128' is-struct='yes' visibility='default' id='86c6d40c'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mLeft' type-id='3ff5601b' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='mTop' type-id='3ff5601b' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='mRight' type-id='3ff5601b' visibility='default'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='96'>
              <var-decl name='mBottom' type-id='3ff5601b' visibility='default'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='ItemData' type-id='69c36994' id='685fe30e'/>
        </member-type>
      </class-decl>
      <class-decl name='ICrypto' is-struct='yes' visibility='default' is-declaration-only='yes' id='7ae24efa'/>
      <class-decl name='IDrm' is-struct='yes' visibility='default' is-declaration-only='yes' id='bc6f38a0'/>
      <class-decl name='IDrmClient' size-in-bits='96' visibility='default' id='5a20c16f'>
        <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
        <member-function access='protected' constructor='yes'>
          <function-decl name='IDrmClient' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='15f18b87' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='IDrmClient' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='15f18b87' is-artificial='yes'/>
            <parameter type-id='c04bc726'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IDrmClient' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='15f18b87' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='KeyedVector&lt;android::String8, android::String8&gt;' size-in-bits='160' visibility='default' id='2236983b'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mVector' type-id='0bd5aa84' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='KeyedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed56f2b' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='KeyedVector&lt;unsigned int, unsigned int&gt;' size-in-bits='160' visibility='default' id='07da9dcb'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mVector' type-id='ae098004' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='KeyedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c10e4dfb' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='List&lt;android::Vector&lt;unsigned char&gt; &gt;' size-in-bits='64' visibility='default' id='bd474af3'>
        <member-type access='protected'>
          <class-decl name='_Node' size-in-bits='224' visibility='default' id='8da74890'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mVal' type-id='75c74f24' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='160'>
              <var-decl name='mpPrev' type-id='e5b6b376' visibility='default'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='192'>
              <var-decl name='mpNext' type-id='e5b6b376' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='e5b6b376' is-artificial='yes'/>
                <parameter type-id='92acc0e9'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_Node' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='e5b6b376' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='CONST_ITERATOR&lt;android::Vector&lt;unsigned char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='efcacb5c'>
            <member-type access='public'>
              <typedef-decl name='NodePtr' type-id='cc2c09ef' id='37724b67'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='Type' type-id='7cd2b135' id='0504e4e3'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='NON_CONST_ITERATOR&lt;android::Vector&lt;unsigned char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' id='b189d1a8'>
            <member-type access='public'>
              <typedef-decl name='NodePtr' type-id='e5b6b376' id='26c12703'/>
            </member-type>
            <member-type access='public'>
              <typedef-decl name='Type' type-id='75c74f24' id='1e952d0f'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;android::Vector&lt;unsigned char&gt;, android::List&lt;android::Vector&lt;unsigned char&gt; &gt;::CONST_ITERATOR&gt;' size-in-bits='32' visibility='default' id='58d228f7'>
            <member-type access='private'>
              <typedef-decl name='_Iter' type-id='58d228f7' id='25e73793'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_NodePtr' type-id='37724b67' id='233089dd'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_Type' type-id='0504e4e3' id='c5b21be9'/>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mpNode' type-id='233089dd' visibility='default'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <parameter type-id='233089dd'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <parameter type-id='511ec09f'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='da6a86df' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_ListIterator&lt;android::Vector&lt;unsigned char&gt;, android::List&lt;android::Vector&lt;unsigned char&gt; &gt;::NON_CONST_ITERATOR&gt;' size-in-bits='32' visibility='default' id='9981a92b'>
            <member-type access='private'>
              <typedef-decl name='_Iter' type-id='9981a92b' id='2b07a017'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_NodePtr' type-id='26c12703' id='72300c71'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='_Type' type-id='1e952d0f' id='2272fe9d'/>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mpNode' type-id='72300c71' visibility='default'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <parameter type-id='72300c71'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <parameter type-id='ba1b23f3'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~_ListIterator' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='163017cb' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='9981a92b' id='a659b810'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='58d228f7' id='942a6ae0'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mpMiddle' type-id='e5b6b376' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='90c51dc3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='90c51dc3' is-artificial='yes'/>
            <parameter type-id='9511fad0'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~List' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='90c51dc3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='MediaCodec' is-struct='yes' visibility='default' is-declaration-only='yes' id='e9ddea86'/>
      <class-decl name='MediaMuxerBase' is-struct='yes' visibility='default' is-declaration-only='yes' id='cc518f2c'>
        <member-type access='public'>
          <enum-decl name='OutputFormat' id='c7b6f6c1'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='OUTPUT_FORMAT_MPEG_4' value='0'/>
            <enumerator name='OUTPUT_FORMAT_WEBM' value='1'/>
            <enumerator name='OUTPUT_FORMAT_THREE_GPP' value='2'/>
            <enumerator name='OUTPUT_FORMAT_HEIF' value='3'/>
            <enumerator name='OUTPUT_FORMAT_OGG' value='4'/>
            <enumerator name='OUTPUT_FORMAT_LIST_END' value='5'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='Mutex' size-in-bits='32' visibility='default' id='406f4753'>
        <member-type access='public'>
          <class-decl name='Autolock' size-in-bits='32' visibility='default' id='fd376fcf'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mLock' type-id='665e3247' visibility='default'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='665e3247'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='5a5e1f63'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='Autolock' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='e38b5b64'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mMutex' type-id='7a6844eb' visibility='default'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='Mutex' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='43c128f8'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='NuMediaExtractor' is-struct='yes' visibility='default' is-declaration-only='yes' id='42876cb5'/>
      <class-decl name='RefBase' visibility='default' is-declaration-only='yes' id='12f619c0'>
        <member-type access='public'>
          <class-decl name='weakref_type' size-in-bits='8' visibility='default' id='114d3ce2'/>
        </member-type>
      </class-decl>
      <class-decl name='SortedVector&lt;android::key_value_pair_t&lt;android::String8, android::String8&gt; &gt;' size-in-bits='160' visibility='default' id='0bd5aa84'>
        <base-class access='private' layout-offset-in-bits='0' type-id='77b46eb8'/>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='3a368097' id='313d8bc9'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='3118331a' id='2b62b929'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1b0ba912' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1b0ba912' is-artificial='yes'/>
            <parameter type-id='da00fa6f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1b0ba912' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='SortedVector&lt;android::key_value_pair_t&lt;unsigned int, unsigned int&gt; &gt;' size-in-bits='160' visibility='default' id='ae098004'>
        <base-class access='private' layout-offset-in-bits='0' type-id='77b46eb8'/>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='eb96a877' id='b47e14f9'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='ce4f8b6a' id='19b23fb9'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d42e47b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d42e47b2' is-artificial='yes'/>
            <parameter type-id='eb24a47f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~SortedVector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='d42e47b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='SortedVector&lt;unsigned char&gt;' visibility='default' is-declaration-only='yes' id='b4109b6f'/>
      <class-decl name='SortedVectorImpl' visibility='default' is-declaration-only='yes' id='77b46eb8'/>
      <class-decl name='String8' visibility='default' is-declaration-only='yes' id='bacf3393'/>
      <class-decl name='Vector&lt;unsigned char&gt;' size-in-bits='160' visibility='default' id='75c74f24'>
        <base-class access='private' layout-offset-in-bits='0' type-id='86634f01'/>
        <member-type access='private'>
          <typedef-decl name='compar_t' type-id='3ea32c19' id='1710ada2'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='compar_r_t' type-id='9d86b205' id='bd0e6a6b'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='cf536864' id='e03617ff'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='354f7eb9' id='0e8867db'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <parameter type-id='92acc0e9'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <parameter type-id='aa60ce98'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Vector' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='adab0622' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='VectorImpl' visibility='default' is-declaration-only='yes' id='86634f01'>
        <member-type access='private'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca1b'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='HAS_TRIVIAL_CTOR' value='1'/>
            <enumerator name='HAS_TRIVIAL_DTOR' value='2'/>
            <enumerator name='HAS_TRIVIAL_COPY' value='4'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='key_value_pair_t&lt;android::String8, android::String8&gt;' size-in-bits='64' is-struct='yes' visibility='default' id='84004c8f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='key' type-id='bacf3393' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='value' type-id='bacf3393' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <parameter type-id='25182036'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <parameter type-id='a1b8f99c'/>
            <parameter type-id='a1b8f99c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='key_value_pair_t' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3a368097' is-artificial='yes'/>
            <parameter type-id='a1b8f99c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='key_value_pair_t&lt;unsigned int, unsigned int&gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='ab4b368f'/>
      <class-decl name='sp&lt;CodecHandler&gt;' size-in-bits='32' visibility='default' id='4ffcdbb7'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='8d03b16b' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <parameter type-id='8d03b16b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <parameter type-id='9eaff3e2'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <parameter type-id='e46e4057'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='cbdc0a3f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;DrmListener&gt;' size-in-bits='32' visibility='default' id='e6881728'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='8c3b9314' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <parameter type-id='8c3b9314'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <parameter type-id='f2d26d3d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <parameter type-id='395e35ac'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='171c354e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::ABuffer&gt;' size-in-bits='32' visibility='default' id='8213f55d'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='09f09c51' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <parameter type-id='09f09c51'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <parameter type-id='e369af2c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <parameter type-id='494e5aed'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b804143d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::ALooper&gt;' size-in-bits='32' visibility='default' id='5fbf0404'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='a1abad78' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <parameter type-id='a1abad78'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <parameter type-id='5719ccc3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <parameter type-id='f4e34078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='bfd7e242' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::AMessage&gt;' size-in-bits='32' visibility='default' id='0e20bb94'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='33f74d48' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <parameter type-id='33f74d48'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <parameter type-id='c73fc48d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <parameter type-id='c8bf35b8'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='262a6002' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::ICrypto&gt;' size-in-bits='32' visibility='default' id='fb567094'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='04190168' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <parameter type-id='04190168'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <parameter type-id='560939e3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <parameter type-id='21f1a808'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c6d2d6b2' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IDrm&gt;' size-in-bits='32' visibility='default' id='04810e42'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='74a200d6' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <parameter type-id='74a200d6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <parameter type-id='b5995273'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <parameter type-id='e6ddc396'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1a13110' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::MediaCodec&gt;' size-in-bits='32' visibility='default' id='c59f6c00'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='ae2251ac' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <parameter type-id='ae2251ac'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <parameter type-id='033545ad'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <parameter type-id='cb72bb24'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ccc06' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::MediaMuxerBase&gt;' size-in-bits='32' visibility='default' id='93f5453e'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='b6f9962a' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <parameter type-id='b6f9962a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <parameter type-id='5645e4ab'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <parameter type-id='53fb6be2'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='359a6cd4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::NuMediaExtractor&gt;' size-in-bits='32' visibility='default' id='41728969'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='78e03335' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <parameter type-id='78e03335'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <parameter type-id='315e54a6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <parameter type-id='1f7def29'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c2c2b841' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='wp&lt;android::ALooper&gt;' size-in-bits='64' visibility='default' id='4d159548'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='a1abad78' visibility='default'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='m_refs' type-id='7613b793' visibility='default'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9bca647e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9bca647e' is-artificial='yes'/>
            <parameter type-id='a1abad78'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9bca647e' is-artificial='yes'/>
            <parameter type-id='8f9ba3f7'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9bca647e' is-artificial='yes'/>
            <parameter type-id='5719ccc3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~wp' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9bca647e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
</abi-corpus>
